[
  {
    "term": "Sadhak",
    "definition": "One who follows a yogic discipline.",
    "source": "[wotm2, Yoga]"
  },
  {
    "term": "Sadhana",
    "definition": "Yogic discipline.",
    "source": "[wotm2, Yoga]"
  },
  {
    "term": "Yoga",
    "definition": "Union with the Divine (by extension: the path which leads to this union).",
    "source": "[wotm2, Yoga]"
  },
  {
    "term": "Integral Yoga (Aim)",
    "definition": "A yoga that aims at transformation and divinisation of physical life instead of escape from it.",
    "source": "[wotm2, The Integral Yoga]"
  },
  {
    "term": "Yogic Action (Essence)",
    "definition": "It is the spirit and the consciousness from which it is done that makes an action yogic; it is not the action itself.",
    "source": "[wotm2, Yogic Action]"
  },
  {
    "term": "Opening (in Sadhana)",
    "definition": "An inner purity and receptivity that freely lets in the Mother's influence. Begin with the heart.",
    "source": "[wotm2, Aspects of Sadhana]"
  },
  {
    "term": "Psychic Being (Nature)",
    "definition": "Your true being, the being that is in the heart and that is the spark of the Mother's own consciousness.",
    "source": "[wotm2, Aspects of Sadhana]"
  },
  {
    "term": "Vital Being (Nature)",
    "definition": "The part from which proceed desires and hunger and dynamic activities, having its physical basis round about the navel.",
    "source": "[wotm2, Aspects of Sadhana]"
  },
  {
    "term": "Tapasya",
    "definition": "A discipline imposed by the will for any spiritual end is tapasya. Integral tapasya: the whole being lives only to know and serve the Divine.",
    "source": "[wotm2, Tapasya]"
  },
  {
    "term": "Concentration (Aim)",
    "definition": "Concentration does not aim for any effect, but is simple and persistent.",
    "source": "[wotm2, Concentration]"
  },
  {
    "term": "Spiritual Experience",
    "definition": "Spiritual experience means the contact with the Divine in oneself (or without, which comes to the same thing in that domain).",
    "source": "[wotm2, Experiences and Visions]"
  },
  {
    "term": "Sincerity (Core Meaning)",
    "definition": "Sincerity means to lift all the movements of the being to the level of the highest consciousness and realisation already attained. Sincerity exacts the unification and harmonisation of the whole being in all its parts and movements around the central Divine Will.",
    "source": "[wotm2, Sincerity]"
  },
  {
    "term": "Sincere Aspiration",
    "definition": "An aspiration which is not mixed with any interested and egoistic calculation.",
    "source": "[wotm2, Aspiration]"
  },
  {
    "term": "Faith (Psychic)",
    "definition": "Faith is spontaneous knowledge in the psychic.",
    "source": "[wotm2, Faith]"
  },
  {
    "term": "Faith (Certitude)",
    "definition": "Faith—confidence in the Divine and the unshakable certitude of the Divine's Victory.",
    "source": "[wotm2, Faith]"
  },
  {
    "term": "Divine Grace (Essence)",
    "definition": "The Divine Grace alone has the power to intervene and change the course of Universal Justice. The great work of the Avatar is to manifest the Divine Grace upon earth.",
    "source": "[wotm2, The Divine Grace]"
  },
  {
    "term": "Certitude",
    "definition": "Assured and calm it never argues.",
    "source": "[wotm2, Certitude]"
  },
  {
    "term": "Devotion (Nature)",
    "definition": "Modest and fragrant, it gives itself without seeking for anything in return.",
    "source": "[wotm2, Devotion]"
  },
  {
    "term": "Worship (True)",
    "definition": "Total and constant without demand or exigence.",
    "source": "[wotm2, Worship]"
  },
  {
    "term": "Offering (Integral)",
    "definition": "The placing of your entire being, with all its movements true and false, good and bad, right and wrong, before the Divine for transformation.",
    "source": "[wotm2, Offering]"
  },
  {
    "term": "Consecration",
    "definition": "The consummation, when the Light has illuminated all the parts of your being, with a central will acting on the feelings, impulses, thoughts, emotions, activities, directing them always towards the Divine.",
    "source": "[wotm2, Consecration]"
  },
  {
    "term": "Self-giving (Core)",
    "definition": "By this the whole being gets progressively unified round the central psychic being. Self-giving is true prayer.",
    "source": "[wotm2, Self-giving]"
  },
  {
    "term": "Surrender",
    "definition": "The decision to hand over the responsibility of your life to the Divine. This is done either through the mind or the emotion or the life-impulse or through all of them together.",
    "source": "[wotm2, Surrender]"
  },
  {
    "term": "Divine Will",
    "definition": "The will expressing the highest Truth.",
    "source": "[wotm2, To Will What the Divine Wills]"
  },
  {
    "term": "Divine Love (Essence)",
    "definition": "Love is a mighty vibration coming straight from the One, and only the very pure and very strong are capable of receiving and manifesting it.",
    "source": "[wotm2, Love and Sexual Desire]"
  },
  {
    "term": "Purity (Spiritual)",
    "definition": "This is purity, to accept no other influence but only the influence of the Divine.",
    "source": "[wotm2, Purity]"
  },
  {
    "term": "Humility (True)",
    "definition": "True humility consists in knowing that the Supreme Consciousness, the Supreme Will alone exists and that the I *is not*.",
    "source": "[wotm2, Humility and Modesty]"
  },
  {
    "term": "Gratitude (Loving)",
    "definition": "A loving recognition of the Grace received from the Divine. A humble recognition of all that the Divine has done and is doing for you.",
    "source": "[wotm2, Gratitude]"
  },
  {
    "term": "Faithfulness (Spiritual)",
    "definition": "This is faithfulness, to admit and to manifest no other movements but only the movements prompted and guided by the Divine.",
    "source": "[wotm2, Faithfulness]"
  },
  {
    "term": "Will (Spiritual)",
    "definition": "Power of consciousness turned towards effectuation.",
    "source": "[wotm2, Will]"
  },
  {
    "term": "Perseverance",
    "definition": "The decision to go to the very end. Perseverance is patience in action.",
    "source": "[wotm2, Perseverance]"
  },
  {
    "term": "Endurance (Spiritual)",
    "definition": "Going to the very end of the effort without fatigue or relaxing. Endurance is the capacity of bearing without depression.",
    "source": "[wotm2, Endurance]"
  },
  {
    "term": "Patience (Spiritual)",
    "definition": "The capacity to wait steadily for the Realisation to come. Accomplishment is without any doubt the fruit of patience.",
    "source": "[wotm2, Patience]"
  },
  {
    "term": "Heroism (Spiritual)",
    "definition": "To be able to stand for the Truth in all circumstances, to declare it amidst opposition and to fight for it whenever necessary. And to act always from one's highest consciousness.",
    "source": "[wotm2, Heroism and Bravery]"
  },
  {
    "term": "Courage (True)",
    "definition": "Courage is a sign of the soul's nobility. But courage must be calm and master of itself, generous and benevolent. In true courage there is no impatience and no rashness.",
    "source": "[wotm2, Courage]"
  },
  {
    "term": "Truth (Practical)",
    "definition": "Practically, the Truth is the surrender of the ego, to make possible the birth and manifestation of the Divine.",
    "source": "[wotm2, Truth Is above Mind]"
  },
  {
    "term": "Honesty (Vital)",
    "definition": "Not to allow our sensations and desires to falsify our judgement and determine our action.",
    "source": "[wotm2, Honesty]"
  },
  {
    "term": "Liberty (Spiritual)",
    "definition": "Liberty is to depend only on the Divine. Freedom is to do only what the Supreme Consciousness makes us do.",
    "source": "[wotm2, Freedom]"
  },
  {
    "term": "Ego (Nature)",
    "definition": "The ego thinks of what it wants and has not. This is its constant preoccupation.",
    "source": "[wotm2, Ego]"
  },
  {
    "term": "Soul (vs Ego)",
    "definition": "The soul is aware of what it is given and lives in endless gratitude.",
    "source": "[wotm2, Ego]"
  },
  {
    "term": "Purity (True Earthly)",
    "definition": "On earth, true purity is to think as the Divine thinks, to will as the Divine wills, to feel as the Divine feels.",
    "source": "[wotm2, Purity]"
  },
  {
    "term": "Integral Purity",
    "definition": "The whole being is purified of the ego.",
    "source": "[wotm2, Purity]"
  },
  {
    "term": "Mental Purity",
    "definition": "A mirror which does not distort. Perfect mental purity: a spotless mirror constantly turned towards the Divine.",
    "source": "[wotm2, Purity]"
  },
  {
    "term": "Vital Purity",
    "definition": "It begins with the abolition of desire.",
    "source": "[wotm2, Purity]"
  },
  {
    "term": "Humility (Adorable)",
    "definition": "Adorable in its simplicity.",
    "source": "[wotm2, Humility and Modesty]"
  },
  {
    "term": "Humility (Actionable)",
    "definition": "To be humble means for the mind, the vital and the body never to forget that *without the Divine* they know nothing, are nothing and can do nothing; without the Divine they are nothing but ignorance, chaos and impotence. The Divine alone is Truth, Life, Power, Love, Felicity.",
    "source": "[wotm2, Humility and Modesty]"
  },
  {
    "term": "Gratitude (Detailed)",
    "definition": "The gratitude that awakens in us all the details of the Divine Grace.",
    "source": "[wotm2, Gratitude]"
  },
  {
    "term": "Integral Gratitude",
    "definition": "The whole being offers itself to the Lord in absolute trust.",
    "source": "[wotm2, Gratitude]"
  },
  {
    "term": "Obedience (Perfect)",
    "definition": "Obedience to the divine order with joy and without hesitation or reserve in all parts of the being.",
    "source": "[wotm2, Obedience]"
  },
  {
    "term": "Resolution",
    "definition": "Nothing can stop its development.",
    "source": "[wotm2, Resolution]"
  },
  {
    "term": "Determination",
    "definition": "Determination knows what it wants and does it.",
    "source": "[wotm2, Determination]"
  },
  {
    "term": "Boldness",
    "definition": "Do fearlessly what must be done, not dreading any difficulty.",
    "source": "[wotm2, Boldness]"
  },
  {
    "term": "Prudence",
    "definition": "Very useful for weakness because weakness needs prudence; strength does not need it.",
    "source": "[wotm2, Prudence and Balance]"
  },
  {
    "term": "Equanimity",
    "definition": "Immutable peace and calm.",
    "source": "[wotm2, Prudence and Balance]"
  },
  {
    "term": "Nobility",
    "definition": "The incapacity for any pettiness either of sentiments or of action.",
    "source": "[wotm2, Nobility and Refinement]"
  },
  {
    "term": "Refinement",
    "definition": "Gradually grossness is eliminated from the being.",
    "source": "[wotm2, Nobility and Refinement]"
  },
  {
    "term": "Cheerfulness",
    "definition": "A joyous smile of Nature.",
    "source": "[wotm2, Cheerfulness]"
  },
  {
    "term": "Harmony (Integral)",
    "definition": "Harmony between things, harmony between people, harmony of circumstances and above all harmony of all aspiration directed towards the Supreme Truth.",
    "source": "[wotm2, Harmony]"
  },
  {
    "term": "Collaboration (True)",
    "definition": "True collaboration is a non-egoistic union of all personal efforts to express and realise the Divine's Will.",
    "source": "[wotm2, Collaboration]"
  },
  {
    "term": "Goodwill",
    "definition": "Of modest appearance, it makes no noise but is ever ready to be useful.",
    "source": "[wotm2, Goodwill]"
  },
  {
    "term": "Benevolence",
    "definition": "Benevolence makes life fragrant without attracting attention.",
    "source": "[wotm2, Benevolence]"
  },
  {
    "term": "Tolerance (as a step)",
    "definition": "Tolerance is only the first step towards wisdom. The need to tolerate indicates the presence of preferences.",
    "source": "[wotm2, Tolerance]"
  },
  {
    "term": "Liberation (from ego)",
    "definition": "The disappearance of the ego.",
    "source": "[wotm2, Freedom]"
  },
  {
    "term": "The Soul (Divine Origin)",
    "definition": "The soul is the Divine made individual without ceasing to be divine. In the soul the individual and the Divine are eternally one.",
    "source": "[wotm2, The Soul (the Psychic)]"
  },
  {
    "term": "Psychic Centre",
    "definition": "Luminous and calm, it is made to govern the human being.",
    "source": "[wotm2, The Soul (the Psychic)]"
  },
  {
    "term": "Mind (Surrendered)",
    "definition": "Mental surrender: this happens when the mind has understood that it is only an instrument.",
    "source": "[wotm2, Mind: Only an Instrument]"
  },
  {
    "term": "Higher Mind",
    "definition": "Its superiority consists in its capacity to open to the divine light.",
    "source": "[wotm2, Mind: Only an Instrument]"
  },
  {
    "term": "The Heart (Spiritual)",
    "definition": "In the silence of a simple and faithful heart one can understand the mystery of incarnation. A great joy is always deep in our heart, and always we can find it there.",
    "source": "[wotm2, The Heart]"
  },
  {
    "term": "Vital Centre",
    "definition": "Passionate and strong, it asks for control.",
    "source": "[wotm2, The Vital]"
  },
  {
    "term": "Physical Centre",
    "definition": "Occupied mainly with material things, it likes to have an ordered life.",
    "source": "[wotm2, The Body (the Physical)]"
  },
    {
    "term": "Abolition of the Ego",
    "definition": "One exists only by the Divine and for the Divine.",
    "source": "[wotm2, Ego]"
  },
  {
    "term": "Calm (Spiritual)",
    "definition": "Calm is self-possessed strength, quiet and conscious energy, mastery of the impulses, control over the unconscious reflexes. In work calm is the source of efficiency and an indispensable condition for perfection.",
    "source": "[wotm2, Calm]"
  },
  {
    "term": "Certitude (of Victory)",
    "definition": "It is not noisy but it is sure.",
    "source": "[wotm2, Certitude]"
  },
  {
    "term": "Collaboration (Goodwill)",
    "definition": "Substitute the spirit of rivalry and competition by the goodwill of collaboration and mutual understanding.",
    "source": "[wotm2, Collaboration]"
  },
  {
    "term": "Confidence (Childlike)",
    "definition": "There is a great power in the simple confidence of a child. It is with the confidence of a child that our heart implores the Divine.",
    "source": "[wotm2, Confidence]"
  },
  {
    "term": "Consecration (Sincere)",
    "definition": "A sincere consecration of all you are and all you do is for the sadhana much more effective than meditation.",
    "source": "[wotm2, Consecration]"
  },
  {
    "term": "Continence",
    "definition": "Control over oneself. To be continent is to allow no other movements in the being (mental, vital and physical) than those strictly indispensable to manifest the Divine's Will.",
    "source": "[wotm2, Desires, Impulses and Self-Control]"
  },
  {
    "term": "Detailed Surrender",
    "definition": "A surrender which does not forget anything. Detailed surrender means the surrender of all the details of life, even the smallest and the most insignificant in appearance.",
    "source": "[wotm2, Surrender]"
  },
  {
    "term": "Dignity",
    "definition": "Dignity affirms its worth, but demands nothing.",
    "source": "[wotm2, Nobility and Refinement]"
  },
  {
    "term": "Divine Help (Nature of)",
    "definition": "Modest in appearance, powerful in action.",
    "source": "[wotm2, The Divine Help]"
  },
  {
    "term": "Enthusiasm (True)",
    "definition": "True enthusiasm is full of a peaceful endurance.",
    "source": "[wotm2, Enthusiasm and Straightforwardness]"
  },
  {
    "term": "Falsehood (Nature)",
    "definition": "Falsehood is the great ally of Death. Before dying falsehood rises in full swing.",
    "source": "[wotm2, Falsehood and Truth]"
  },
  {
    "term": "Fear (as Consent)",
    "definition": "Fear is hidden consent. When you are afraid of something, it means that you admit its possibility and thus strengthen its hand. It can be said that it is a subconscient consent.",
    "source": "[wotm2, Fear]"
  },
  {
    "term": "Frankness",
    "definition": "Frankness says candidly what it has to say without caring for the result.",
    "source": "[wotm2, Control of Speech]"
  },
  {
    "term": "Integral Honesty",
    "definition": "Be honest towards yourself—(no self-deception). Be sincere towards the Divine—(no bargaining in the surrender). Be straightforward with humanity—(no pretence and show).",
    "source": "[wotm2, Insincerity, Pretension and Self-deception]"
  },
  {
    "term": "Joy (Source)",
    "definition": "Joy comes when you take the right attitude. Joy comes from submission to the divine command.",
    "source": "[wotm2, Joy]"
  },
  {
    "term": "Love (True Nature)",
    "definition": "True love has no need of reciprocation; there *can be no* reciprocation because there is only *one* Love, *the Love*, which has no other aim than to love.",
    "source": "[wotm2, Divine Love and Human Love]"
  },
  {
    "term": "Modesty",
    "definition": "Modesty is satisfied with its own charm and does not draw attention to itself.",
    "source": "[wotm2, Humility and Modesty]"
  },
  {
    "term": "Openness (Spiritual)",
    "definition": "Openness is the will to receive and to utilise for progress the force and influence; the constant aspiration to remain in touch with the Consciousness; the faith that the force and consciousness are always with you, around you, inside you and that you have only to let nothing stand in the way of your receiving them.",
    "source": "[wotm2, Openness]"
  },
  {
    "term": "Peace (Unshakable)",
    "definition": "The peace must be immense, the quietness deep and still, the calm unshakable, and the trust in the Divine ever–increasing.",
    "source": "[wotm2, Peace]"
  },
  {
    "term": "Plasticity (Spiritual)",
    "definition": "Always ready for the progress demanded.",
    "source": "[wotm2, Plasticity]"
  },
  {
    "term": "Quiet Mind",
    "definition": "The best way of learning. Perfect quietness in the mind: essential condition for true progress.",
    "source": "[wotm2, Quiet Mind, Calm Mind, Silent Mind]"
  },
  {
    "term": "Receptivity (Spiritual)",
    "definition": "Receptivity is the capacity of admitting and retaining the Divine Workings. Conscious of the Divine Will and surrendered to it.",
    "source": "[wotm2, Receptivity]"
  },
  {
    "term": "Silence (Spiritual)",
    "definition": "The ideal condition for progress. It is *only in silence* that a true progress can be made.",
    "source": "[wotm2, Silence]"
  },
  {
    "term": "Simplicity (Integral)",
    "definition": "The simplicity which is the consequence of perfect sincerity. Spirituality is supreme simplicity.",
    "source": "[wotm2, Simplicity]"
  },
   {
    "term": "Agni (True)",
    "definition": "The true Agni always burns in deep peace; it is the fire of an all-conquering will.",
    "source": "[wotm2, Will]"
  },
  {
    "term": "Anxiety (Nature of)",
    "definition": "Anxiety is a lack of confidence in the Divine's Grace, the unmistakable sign that the consecration is not complete and perfect.",
    "source": "[wotm2, Never Worry about Difficulties]"
  },
  {
    "term": "Attachment (to Divine)",
    "definition": "Attachment for the Divine wraps itself around the Divine and finds all its support in Him so as to be sure never to leave Him.",
    "source": "[wotm2, Relationship with the Divine]"
  },
  {
    "term": "Beatitude (Immutable)",
    "definition": "The immutable Beatitude of the Divine is translated in the consciousness by an impelling force of progress of an incomparable intensity.",
    "source": "[wotm2, Beatitude and Bliss]"
  },
  {
    "term": "Circumstances (as Expression)",
    "definition": "It is always a mistake to complain about the circumstances of our life, for they are the outward expression of what we are ourselves.",
    "source": "[wotm2, Circumstances: Results of Past Actions]"
  },
  {
    "term": "Common Sense",
    "definition": "It is very practical and avoids any mistakes, but it lacks light.",
    "source": "[wotm2, Prudence and Balance]"
  },
  {
    "term": "Concentration (Yogic)",
    "definition": "The Yogi knows by his capacity for a containing or dynamic identity with things and persons and forces.",
    "source": "[wotm2, Concentration]"
  },
  {
    "term": "Consecration (Effect on Mind)",
    "definition": "The true lasting quietness in the vital and the physical as well as in the mind comes from a complete consecration to the Divine; for when you can no more call anything, not even yourself, yours... the Divine takes the entire responsibility of all and you have nothing more to worry about.",
    "source": "[wotm2, Consecration]"
  },
  {
    "term": "Conversion of the Mind",
    "definition": "The mind has liberated itself from its arrogance and knows it is only an instrument.",
    "source": "[wotm2, Mind: Only an Instrument]"
  },
  {
    "term": "Doubt (Nature of)",
    "definition": "Doubt is not a sport to indulge in with impunity; it is a poison which drop by drop corrodes the soul.",
    "source": "[wotm2, Doubt]"
  },
  {
    "term": "Divine (Meaning for us)",
    "definition": "This is what we mean by \"Divine\": all the knowledge we have to acquire, all the power we have to obtain, all the love we have to become, all the perfection we have to achieve, all the harmonious and progressive poise we have to manifest in light and joy, all the new and unknown splendours that have to be realised.",
    "source": "[wotm2, 'The Divine' and 'Man']"
  },
  {
    "term": "Divine's Words (Effect)",
    "definition": "The Divine's words comfort and bless, soothe and illumine, and the Divine's generous hand lifts a fold of the veil which hides the infinite knowledge.",
    "source": "[wotm2, The Divine Is with You]"
  },
  {
    "term": "Ego (Obstacle to Love)",
    "definition": "So long as the ego is there, one cannot love. Love alone can love, Love alone can conquer the ego.",
    "source": "[wotm2, Divine Love and Human Love]"
  },
  {
    "term": "Faith (Unshakable)",
    "definition": "In an unshakable faith lies all our hope.",
    "source": "[wotm2, Faith]"
  },
  {
    "term": "Greed (for Food)",
    "definition": "When you have a desire you are governed by the thing you desire, it takes possession of your mind and your life, and you become a slave. If you have greed for food you are no more the master of food, it is the food that masters you.",
    "source": "[wotm2, Greed (for Food)]"
  },
  {
    "term": "Happiness (Spiritual)",
    "definition": "Calm and smiling, nothing can disturb it. The happiness you give makes you more happy than the happiness you receive.",
    "source": "[wotm2, Happiness]"
  },
  {
    "term": "Hypocrisy (as Homage)",
    "definition": "Hypocrisy and pretension are the homage ignorance pays to the truth. Hypocrisy and pretension are the first signs of the inconscient's aspiration towards consciousness.",
    "source": "[wotm2, Falsehood and Truth]"
  },
  {
    "term": "Imagination",
    "definition": "Abundant and varied, it may be charming but must not be substituted for the Truth.",
    "source": "[wotm2, Mental Limitations and Weaknesses]"
  },
  {
    "term": "Insincerity (Root of)",
    "definition": "It is through ignorance and stupidity that the being is insincere. But with a persevering will and an absolute confidence in the Divine Grace, one can cure this insincerity.",
    "source": "[wotm2, Insincerity, Pretension and Self-deception]"
  },
  {
    "term": "Intimacy with the Divine (Psychic)",
    "definition": "The natural state of the fully developed psychic.",
    "source": "[wotm2, Relationship with the Divine]"
  },
  {
    "term": "Justice (Divine vs Universal)",
    "definition": "Justice is the strict logical determinism of the movements of Universal Nature... The Divine Grace alone has the power to intervene and change the course of Universal Justice.",
    "source": "[wotm2, The Divine Grace]"
  },
  {
    "term": "Laziness (as Illness)",
    "definition": "It is a dangerous illness: laziness.",
    "source": "[wotm2, Laziness, Tiredness, Fatigue, Tamas]"
  },
  {
    "term": "Love (Supreme Power)",
    "definition": "It may be said that at its origin love is the supreme power of attraction which awakens, in response, the irresistible need of an absolute self-giving; they are the two poles of the urge towards complete fusion.",
    "source": "[wotm2, Divine Love]"
  },
  {
    "term": "Mental Honesty",
    "definition": "One does not try to deceive others or to deceive oneself.",
    "source": "[wotm2, Honesty]"
  },
  {
    "term": "Mental Sincerity",
    "definition": "The essential condition for integral honesty.",
    "source": "[wotm2, Honesty]"
  },
  {
    "term": "Passion (Spiritual Use)",
    "definition": "It is a force, but is dangerous and cannot be used unless it is perfectly surrendered to the Divine.",
    "source": "[wotm2, Love and Sexual Desire]"
  },
  {
    "term": "Peace (Source of)",
    "definition": "Nowhere will you be able to find peace unless you have peace in your heart.",
    "source": "[wotm2, Peace]"
  },
  {
    "term": "Perfection (Ideal in Work)",
    "definition": "Let nothing short of perfection be your ideal in work and you are sure to become a true instrument of the Divine.",
    "source": "[wotm2, Progress and Perfection in Work]"
  },
  {
    "term": "Receptivity (Increasing)",
    "definition": "It is with the widening of the consciousness and the one-pointedness of the aspiration that the receptivity increases.",
    "source": "[wotm2, Receptivity]"
  },
  {
    "term": "Self-Mastery",
    "definition": "Self-mastery is the greatest conquest, it is the basis of all enduring happiness.",
    "source": "[wotm2, Desires, Impulses and Self-Control]"
  },
   {
    "term": "Divine Consciousness (as Guide)",
    "definition": "The Divine Consciousness must be our only guide. The Divine Consciousness is the only true help, the only true happiness.",
    "source": "[wotm2, The Divine Is with You]"
  },
  {
    "term": "Divine's Presence (Value)",
    "definition": "It is the Divine Presence that gives value to life. This Presence is the source of all peace, all joy, all security.",
    "source": "[wotm2, The Divine Is with You]"
  },
  {
    "term": "Divine (What it means for us)",
    "definition": "This is what we mean by \"Divine\": all the knowledge we have to acquire, all the power we have to obtain, all the love we have to become, all the perfection we have to achieve, all the harmonious and progressive poise we have to manifest in light and joy, all the new and unknown splendours that have to be realised.",
    "source": "[wotm2, 'The Divine' and 'Man']"
  },
  {
    "term": "God (as Perfection)",
    "definition": "God is the perfection that we must aspire to realise. The Divine is the perfection towards which we move.",
    "source": "[wotm2, 'The Divine' and 'Man']"
  },
  {
    "term": "Human Worth (True Measure)",
    "definition": "Our worth lies only in the measure of our effort to exceed ourselves, and to exceed ourselves is to attain the Divine.",
    "source": "[wotm2, 'The Divine' and 'Man']"
  },
  {
    "term": "Communion with the Divine",
    "definition": "For him who has it, all circumstances can truly become an opportunity for it.",
    "source": "[wotm2, Relationship with the Divine]"
  },
  {
    "term": "Friendship with the Divine",
    "definition": "Delicate, attentive and faithful, ever ready to respond to the smallest appeal.",
    "source": "[wotm2, Relationship with the Divine]"
  },
  {
    "term": "Affection for the Divine",
    "definition": "A sweet and confident tenderness that gives itself unfailingly to the Divine.",
    "source": "[wotm2, Relationship with the Divine]"
  },
  {
    "term": "Intimacy with the Divine (Integral)",
    "definition": "The entire being no longer vibrates except with the Divine's touch.",
    "source": "[wotm2, Relationship with the Divine]"
  },
  {
    "term": "Divine's Grace (Working)",
    "definition": "The ways of working of the Lord are full of a delightful sense of humour...",
    "source": "[wotm2, The Ways of Working of the Lord]"
  },
  {
    "term": "Divine Law (vs Human Law)",
    "definition": "According to the law of man the guilty ought to be punished. But there is a law more imperative than the human law. It is the Divine law, the law of compassion and mercy.",
    "source": "[wotm2, The Ways of Working of the Lord]"
  },
  {
    "term": "Ascension (Spiritual)",
    "definition": "Stage by stage one climbs towards the Consciousness. Spiritual ascension: fearless, regular, uninterrupted.",
    "source": "[wotm2, The Path]"
  },
  {
    "term": "Mental Tapasya",
    "definition": "The process leading to the goal.",
    "source": "[wotm2, Tapasya]"
  },
  {
    "term": "Vital Tapasya",
    "definition": "The vital undergoes a rigorous discipline in order to transform itself.",
    "source": "[wotm2, Tapasya]"
  },
  {
    "term": "Perfect Tapasya",
    "definition": "That which will reach its goal.",
    "source": "[wotm2, Tapasya]"
  },
  {
    "term": "Discipline (Necessity of)",
    "definition": "No life can be successful without self-discipline. To be a man, discipline is indispensable. Without discipline one is only an animal.",
    "source": "[wotm2, Tapasya]"
  },
  {
    "term": "Mental Boldness",
    "definition": "Let your mind be capable of foreseeing the perfections of tomorrow.",
    "source": "[wotm2, Boldness]"
  },
  {
    "term": "Integral Courage",
    "definition": "Whatever the domain, whatever the danger, the attitude remains the same—calm and assured.",
    "source": "[wotm2, Courage]"
  },
  {
    "term": "Vigilance (Spiritual)",
    "definition": "Indispensable for all true progress. In each human being there is a beast crouching ready to manifest at the slightest unwatchfulness. The only remedy is a constant vigilance.",
    "source": "[wotm2, Prudence and Balance]"
  },
  {
    "term": "Straightforwardness",
    "definition": "Shows itself as it is, without compromising.",
    "source": "[wotm2, Enthusiasm and Straightforwardness]"
  },
  {
    "term": "Transparency (Integral)",
    "definition": "It is the result of perfect goodwill and sincerity. Integrality is super-sincerity.",
    "source": "[wotm2, Enthusiasm and Straightforwardness]"
  },
  {
    "term": "Dignity of the Emotions",
    "definition": "Not to permit one's emotions to contradict the inner Divinity.",
    "source": "[wotm2, Nobility and Refinement]"
  },
  {
    "term": "Sensitivity (Spiritual)",
    "definition": "One of the results of the refinement of the being.",
    "source": "[wotm2, Nobility and Refinement]"
  },
  {
    "term": "Sweetness (Power of)",
    "definition": "Sweetness itself becomes powerful when at the service of the Divine.",
    "source": "[wotm2, Nobility and Refinement]"
  },
  {
    "term": "Happy Heart",
    "definition": "Smiling, peaceful, wide open, without a shadow.",
    "source": "[wotm2, Happiness]"
  },
  {
    "term": "Joy of Spirituality",
    "definition": "The reward of sincere effort.",
    "source": "[wotm2, Joy]"
  },
  {
    "term": "Mental Goodwill",
    "definition": "Likes to show off a little, but is very useful.",
    "source": "[wotm2, Goodwill]"
  },
  {
    "term": "Truth (as Governor of Life)",
    "definition": "Our life ought to be governed by the Love for Truth and the thirst for Light.",
    "source": "[wotm2, Truth]"
  },
  {
    "term": "Truth (as a Goal)",
    "definition": "We aspire for the Truth and its triumph in our being and our activities.",
    "source": "[wotm2, Truth]"
  },
  {
    "term": "Mental Sincerity (as Condition)",
    "definition": "The essential condition for integral honesty.",
    "source": "[wotm2, Honesty]"
  },
   {
    "term": "Accurate Perception",
    "definition": "A perception which does not deform the Truth.",
    "source": "[wotm2, The Senses]"
  },
  {
    "term": "Ananda in the Physical Body",
    "definition": "Purified of all desire and all repulsion, in a perfect equality and surrender, the physical body is ready to enjoy the divine Ananda.",
    "source": "[wotm2, The Body (the Physical)]"
  },
  {
    "term": "Aristocracy (Spiritual)",
    "definition": "Incapable of baseness and pettiness, it asserts itself with dignity and authority.",
    "source": "[wotm2, Nobility and Refinement]"
  },
  {
    "term": "Aspiration of the Mind (for Supramental Guidance)",
    "definition": "The mind feels that its complexity is powerless and asks for a greater light to illumine it.",
    "source": "[wotm2, Mind: Only an Instrument]"
  },
  {
    "term": "Birth of True Mental Sincerity",
    "definition": "With its birth the mind will understand that it is only a means and not an end in itself.",
    "source": "[wotm2, Mind: Only an Instrument]"
  },
  {
    "term": "Call of the Divine Grace",
    "definition": "Not noisy but persistent and very perceptible to those who know how to listen.",
    "source": "[wotm2, The Divine Grace]"
  },
  {
    "term": "Candid Simplicity in the Vital",
    "definition": "One of the most difficult qualities for the vital to acquire.",
    "source": "[wotm2, The Vital]"
  },
  {
    "term": "Certitude of Victory",
    "definition": "It is not noisy but it is sure.",
    "source": "[wotm2, Certitude]"
  },
  {
    "term": "Charm (Spiritual)",
    "definition": "Envelops and conquers by an inexhaustible sweetness.",
    "source": "[wotm2, Nobility and Refinement]"
  },
  {
    "term": "Cheerful Endeavour",
    "definition": "The joy that one finds in the effort towards the Divine.",
    "source": "[wotm2, Cheerfulness]"
  },
  {
    "term": "Collective Purity",
    "definition": "A very precious achievement but one difficult to obtain.",
    "source": "[wotm2, Purity]"
  },
  {
    "term": "Consent of the Vital",
    "definition": "Amiable, smiling, ever ready for action, with a great goodwill.",
    "source": "[wotm2, The Vital]"
  },
  {
    "term": "Continuity (in Effort)",
    "definition": "Knowing how to persist in one's effort.",
    "source": "[wotm2, Persistence]"
  },
  {
    "term": "Correct Self-evaluation",
    "definition": "Simple and modest, does not try to push itself forward.",
    "source": "[wotm2, Humility and Modesty]"
  },
  {
    "term": "Devotional Attitude",
    "definition": "Moderate and self-effacing, it gives remarkable fruit.",
    "source": "[wotm2, Devotion]"
  },
  {
    "term": "Disinterested Work",
    "definition": "Work done with no other motive than of doing as well as possible the Divine's work.",
    "source": "[wotm2, Work as on Offering to the Divine]"
  },
  {
    "term": "Divine Purity",
    "definition": "It is happy just to be, in all simplicity.",
    "source": "[wotm2, Purity]"
  },
  {
    "term": "Dynamic Power",
    "definition": "Indispensable for progress.",
    "source": "[wotm2, Strength, Force and Power]"
  },
  {
    "term": "Emotional Receptivity",
    "definition": "Emotions wanting to be divinised.",
    "source": "[wotm2, Receptivity]"
  },
  {
    "term": "Enlightened Individual Power",
    "definition": "Limited in its action but of a very high capacity.",
    "source": "[wotm2, Strength, Force and Power]"
  },
  {
    "term": "Eternal Smile",
    "definition": "A kindness only the Divine can give.",
    "source": "[wotm2, Nobility and Refinement]"
  },
  {
    "term": "Faith (as Bargaining - Negative)",
    "definition": "A faith based on material proofs is not faith—it is a bargaining.",
    "source": "[wotm2, Faith]"
  },
  {
    "term": "Flaming Love for the Divine",
    "definition": "Ready for all heroism and all sacrifice.",
    "source": "[wotm2, Love for the Divine]"
  },
  {
    "term": "Formative Faculty in the Mind",
    "definition": "It is a natural and very spontaneous gift.",
    "source": "[wotm2, Mental Limitations and Weaknesses]"
  },
  {
    "term": "Formative Faculty in the Vital",
    "definition": "Spontaneous but not always happy, it needs to be disciplined.",
    "source": "[wotm2, The Vital]"
  },
  {
    "term": "Generosity in the Vital",
    "definition": "Gives itself unstintingly.",
    "source": "[wotm2, The Vital]"
  },
  {
    "term": "Gentleness",
    "definition": "Always gracious and wishing to give pleasure.",
    "source": "[wotm2, Nobility and Refinement]"
  },
  {
    "term": "Goodwill (Mental)",
    "definition": "Likes to show off a little, but is very useful.",
    "source": "[wotm2, Goodwill]"
  },
  {
    "term": "Heroic Action",
    "definition": "Fights for the beautiful and the true without fear of obstacles and opposition.",
    "source": "[wotm2, Heroism and Bravery]"
  },
  {
    "term": "Heroic Thought",
    "definition": "Goes to the conquest of the unknown without fear of difficulty and incomprehension.",
    "source": "[wotm2, Heroism and Bravery]"
  },
  {
    "term": "Illumined Transparency",
    "definition": "An effect of the Divine Grace.",
    "source": "[wotm2, Enthusiasm and Straightforwardness]"
  },
  {
    "term": "Incorruptible Faithfulness",
    "definition": "Nothing can turn you away from the duty you have chosen.",
    "source": "[wotm2, Faithfulness]"
  },
  {
    "term": "Individual Existence (as Canticle)",
    "definition": "The individual existence is a canticle perpetually renewed, that the universe offers to the inconceivable splendour of the Divine.",
    "source": "[wotm2, 'The Divine' and 'Man']"
  },
  {
    "term": "Individual Power",
    "definition": "Limited in its capacity and action.",
    "source": "[wotm2, Strength, Force and Power]"
  },
  {
    "term": "Integral Intimacy with the Divine",
    "definition": "The entire being no longer vibrates except with the Divine's touch.",
    "source": "[wotm2, Relationship with the Divine]"
  },
  {
    "term": "Integral Offering",
    "definition": "The surest road to realisation.",
    "source": "[wotm2, Offering]"
  },
  {
    "term": "Integral Opening of the Being",
    "definition": "The first step of the ascent.",
    "source": "[wotm2, Openness]"
  },
  {
    "term": "Integral Receptivity",
    "definition": "The whole being is aware of the Divine Will and obeys it.",
    "source": "[wotm2, Receptivity]"
  },
  {
    "term": "Integral Simplicity",
    "definition": "The simplicity which is the consequence of perfect sincerity.",
    "source": "[wotm2, Simplicity]"
  },
  {
    "term": "Joy of Integral Peace",
    "definition": "Calm and tranquil, a smile which does not disappoint.",
    "source": "[wotm2, Joy]"
  },
  {
    "term": "Consciousness",
    "definition": "Consciousness is the faculty of becoming aware of anything through identification.",
    "source": "[wotm3, The Universe: Manifestation of the Divine]"
  },
  {
    "term": "Divine Consciousness",
    "definition": "The Divine Consciousness is not only aware but knows and effects. To become aware of a vibration, for instance, does not mean that you know everything about it.",
    "source": "[wotm3, The Universe: Manifestation of the Divine]"
  },
  {
    "term": "The Universe",
    "definition": "The whole universe is the manifestation of the Divine, but a manifestation which begins with a total unconsciousness of its origin and rises little by little towards this consciousness.",
    "source": "[wotm3, The Universe: Manifestation of the Divine]"
  },
  {
    "term": "Manifestation",
    "definition": "The manifestation is just this diversity. It is the One that unfolds itself in the Many—endlessly.",
    "source": "[wotm3, The Divine Working in the Universe]"
  },
  {
    "term": "Divine Expression",
    "definition": "On the physical plane the Divine expresses himself through beauty, on the mental plane through knowledge, on the vital plane through power and on the psychic plane through love.",
    "source": "[wotm3, The Divine Working in the Universe]"
  },
  {
    "term": "Krishna",
    "definition": "Krishna represents both the universal Godhead and the immanent Godhead, he whom one can meet within one's being and in all that constitutes the manifested world.",
    "source": "[wotm3, Krishna and Radha]"
  },
  {
    "term": "Krishna's Play",
    "definition": "A power of progress veiling itself behind appearances.",
    "source": "[wotm3, Krishna and Radha]"
  },
  {
    "term": "Radha's Consciousness",
    "definition": "Symbolises perfect attachment to the Divine.",
    "source": "[wotm3, Krishna and Radha]"
  },
  {
    "term": "Avatar",
    "definition": "The supreme Divine manifested on earth in a body.",
    "source": "[wotm3, The Avatar]"
  },
  {
    "term": "Divine in Nature",
    "definition": "The Divine in Nature creates nothing final; everything is temporary and at the same time as perfect as it is possible for it to be under the circumstances at the time.",
    "source": "[wotm3, Nature and the Forces of Nature]"
  },
  {
    "term": "Nature's Progress",
    "definition": "In order to progress Nature destroys, while the Divine Consciousness stimulates growth and finally transforms.",
    "source": "[wotm3, Nature and the Forces of Nature]"
  },
  {
    "term": "Religion",
    "definition": "We call 'religion' any concept of the world or the universe which is presented as the exclusive Truth in which one must have absolute faith, generally because this Truth is declared to be the result of a revelation.",
    "source": "[wotm3, Religion]"
  },
  {
    "term": "Religious Teaching",
    "definition": "Religious teaching belongs to the past and halts progress.",
    "source": "[wotm3, Religion]"
  },
  {
    "term": "Spiritual Teaching",
    "definition": "Spiritual teaching is the teaching of the future—it illumines the consciousness and prepares it for future realisation.",
    "source": "[wotm3, Religion]"
  },
  {
    "term": "Pre-vision",
    "definition": "The power of projecting one's consciousness into the future.",
    "source": "[wotm3, Occultism]"
  },
  {
    "term": "Occultism",
    "definition": "Occultism does not truly blossom except when it is surrendered to the Divine.",
    "source": "[wotm3, Occultism]"
  },
  {
    "term": "Beauty",
    "definition": "Beauty is the joyous offering of Nature.",
    "source": "[wotm3, Nature and the Forces of Nature]"
  },
  {
    "term": "Intimacy with Universal Nature",
    "definition": "This intimacy is only possible for those whose consciousness is vast and who are without preference and without repulsion.",
    "source": "[wotm3, Nature and the Forces of Nature]"
  },
  {
    "term": "Forces of Nature",
    "definition": "The so-called forces of Nature are nothing but the exterior activities of beings out of proportion with man by their size and by the powers which they wield.",
    "source": "[wotm3, Nature and the Forces of Nature]"
  },
  {
    "term": "Divine Will",
    "definition": "There is no other will than the Supreme Will.",
    "source": "[wotm3, The Divine Working in the Universe]"
  },
  {
    "term": "Divine Life",
    "definition": "There is no other life than the Supreme Life.",
    "source": "[wotm3, The Divine Working in the Universe]"
  },
  {
    "term": "Divine Personality",
    "definition": "There is no other personality than the Supreme Personality, the One and the All.",
    "source": "[wotm3, The Divine Working in the Universe]"
  },
  {
    "term": "Divine Presence",
    "definition": "Divine presence: it hides from ignorant eyes its ever-present magnificence.",
    "source": "[wotm3, The Divine Working in the Universe]"
  },
  {
    "term": "Worship",
    "definition": "It is far better to become than to worship. It is the reluctance to change that makes one worship.",
    "source": "[wotm3, Religion]"
  },
  {
    "term": "Attitude Towards Religions",
    "definition": "A benevolent goodwill towards all worshippers. An enlightened indifference towards all religions.",
    "source": "[wotm3, Religion]"
  },
  {
    "term": "Religions (Nature)",
    "definition": "All religions are partial approximations of the one sole Truth that is far above them.",
    "source": "[wotm3, Religion]"
  },
  {
    "term": "Religions (Basis)",
    "definition": "Religions are based on creeds which are spiritual experiences brought down to a level where they become more easy to grasp, but at the cost of their integral purity and truth.",
    "source": "[wotm3, Religion]"
  },
  {
    "term": "New Age",
    "definition": "The time of religions is over. We have entered the age of universal spirituality, of spiritual experience in its initial purity.",
    "source": "[wotm3, Religion]"
  },
  {
    "term": "Religious Thought",
    "definition": "Religious thought cannot be used unless it is liberated from the influence of religions.",
    "source": "[wotm3, Religion]"
  },
  {
    "term": "Man's Right",
    "definition": "Man's right is to pursue the Truth freely and to approach it freely in his own way. But each one ought to know that his discovery is good for him alone and is not to be imposed upon others.",
    "source": "[wotm3, Religion]"
  },
  {
    "term": "Solar Light",
    "definition": "The solar light is the symbol of the supramental light.",
    "source": "[wotm3, Occultism]"
  },
  {
    "term": "Morality",
    "definition": "You can break the moral rules only when you observe the Divine Law.",
    "source": "[wotm3, Morality]"
  },
  {
    "term": "Moral Laws",
    "definition": "Moral laws have only a very relative value from the point of view of Truth. Besides, they vary considerably according to country, climate and period.",
    "source": "[wotm3, Morality]"
  },
  {
    "term": "Service to the Divine",
    "definition": "Service to the Divine exacts a sincerity of self-sacrifice unknown to any morality.",
    "source": "[wotm3, Morality]"
  },
  {
    "term": "Violence",
    "definition": "I disapprove totally of violence. Each act of violence is a step back on the path leading to the goal to which we aspire.",
    "source": "[wotm3, War and Violence]"
  },
  {
    "term": "Violence vs Cruelty",
    "definition": "There is a difference between violence and cruelty. In a violent mood one can do a very dreadful act, but afterwards one feels very sorry for it. Whereas a cruel person does the thing in a cold-blooded way—everything is prearranged and is done for its own sake.",
    "source": "[wotm3, War and Violence]"
  },
  {
    "term": "Protection",
    "definition": "The best protection is an unshakable faith in the Divine Grace.",
    "source": "[wotm3, Safety and Protection]"
  },
  {
    "term": "Integral Protection",
    "definition": "That which can be given only by the Divine.",
    "source": "[wotm3, Safety and Protection]"
  },
  {
    "term": "Psychic Protection",
    "definition": "The protection resulting from surrender to the Divine.",
    "source": "[wotm3, Safety and Protection]"
  },
  {
    "term": "Physical Protection",
    "definition": "Physical protection is possible only with a total surrender to the Divine and the absence of all desires.",
    "source": "[wotm3, Safety and Protection]"
  },
  {
    "term": "Security",
    "definition": "Exclusive turning of all movements towards the Divine: the sure means of having security.",
    "source": "[wotm3, Safety and Protection]"
  },
  {
    "term": "Money",
    "definition": "Money is not meant to make money, money is meant to make the earth ready for the advent of the new creation.",
    "source": "[wotm3, Wealth and Economics]"
  },
  {
    "term": "Riches",
    "definition": "It is to the Divine that all riches belong. It is the Divine who lends them to living beings, and it is to Him that they must naturally return.",
    "source": "[wotm3, Wealth and Economics]"
  },
  {
    "term": "Wealth under Psychic Influence",
    "definition": "Wealth ready to return to its true possessor, the Divine.",
    "source": "[wotm3, Wealth and Economics]"
  },
  {
    "term": "True Wealth",
    "definition": "True wealth is that which one offers to the Divine.",
    "source": "[wotm3, Wealth and Economics]"
  },
  {
    "term": "True Fortune",
    "definition": "The true fortune is to spend in the right way.",
    "source": "[wotm3, Wealth and Economics]"
  },
  {
    "term": "Prosperity",
    "definition": "Prosperity stays consistently only with him who offers it to the Divine.",
    "source": "[wotm3, Wealth and Economics]"
  },
  {
    "term": "Unselfish Prosperity",
    "definition": "He who receives it abundantly, gives all that he has as he receives it.",
    "source": "[wotm3, Wealth and Economics]"
  },
  {
    "term": "Generosity",
    "definition": "Generosity gives and gives itself without bargaining.",
    "source": "[wotm3, Wealth and Economics]"
  },
  {
    "term": "Change of Consciousness",
    "definition": "A change of consciousness is equivalent to a new birth, a birth into a higher sphere of existence.",
    "source": "[wotm3, Government and Politics]"
  },
  {
    "term": "World Unity",
    "definition": "To realise the Consciousness of the ONE.",
    "source": "[wotm3, Government and Politics]"
  },
  {
    "term": "Unity",
    "definition": "Unity does not come from any exterior disposition, but by becoming conscious of the eternal Oneness.",
    "source": "[wotm3, Government and Politics]"
  },
  {
    "term": "Human Unity",
    "definition": "The unity of humanity is an underlying and existing fact. But the external union of mankind depends on man's goodwill and sincerity.",
    "source": "[wotm3, Government and Politics]"
  },
  {
    "term": "Light",
    "definition": "Light must illumine the consciousness and the shadows of Ignorance must be dissolved in all.",
    "source": "[wotm3, Darkness and Light]"
  },
  {
    "term": "Past",
    "definition": "Use the past as a spring-board to leap towards the future.",
    "source": "[wotm3, The Past]"
  },
  {
    "term": "Present",
    "definition": "The present is the most important moment in life.",
    "source": "[wotm3, The Present]"
  },
  {
    "term": "Future",
    "definition": "The future is necessarily better than the past. We have only to push forward.",
    "source": "[wotm3, The Future]"
  },
  {
    "term": "Progress",
    "definition": "Progress is the sign of the divine influence in creation.",
    "source": "[wotm3, Progress]"
  },
  {
    "term": "Purpose of Earthly Life",
    "definition": "The purpose of earthly life is progress. If you stop progressing you will die. Every moment that you spend without progressing is one step closer to your grave.",
    "source": "[wotm3, Progress]"
  },
  {
    "term": "Perfection",
    "definition": "Perfection is not a maximum or an extreme. It is an equilibrium and a harmonisation.",
    "source": "[wotm3, Perfection]"
  },
  {
    "term": "Perfection (Progressive)",
    "definition": "Perfection is eternal; it is only the resistance of the world that makes it progressive.",
    "source": "[wotm3, Perfection]"
  },
  {
    "term": "Thirst for Perfection",
    "definition": "Constant and multiple aspiration.",
    "source": "[wotm3, Perfection]"
  },
  {
    "term": "Success",
    "definition": "All success depends upon the measure of your truth.",
    "source": "[wotm3, Success]"
  },
  {
    "term": "Spiritual Success",
    "definition": "Spiritual success is the conscious union with the Divine.",
    "source": "[wotm3, Success]"
  },
  {
    "term": "Victory",
    "definition": "The ultimate victory of the Divine is certain beyond all doubt.",
    "source": "[wotm3, Victory]"
  },
  {
    "term": "Transformation",
    "definition": "The goal is not to lose oneself in the Divine Consciousness. The goal is to let the Divine Consciousness penetrate into Matter and transform it.",
    "source": "[wotm3, Transformation]"
  },
  {
    "term": "True Spirituality",
    "definition": "True spirituality transforms life.",
    "source": "[wotm3, Transformation]"
  },
  {
    "term": "Transformation (Goal)",
    "definition": "Transformation: the goal of creation.",
    "source": "[wotm3, Transformation]"
  },
  {
    "term": "Supramental",
    "definition": "The supramental is not only Truth itself, but also the very negation of falsehood. The supramental will never come down, settle and manifest in a consciousness harbouring falsehood.",
    "source": "[wotm3, The Supramental]"
  },
  {
    "term": "Realisation",
    "definition": "The establishment of the supramental Truth upon earth.",
    "source": "[wotm3, The Supramental]"
  },
    {
    "term": "Solar Light (Symbolism)",
    "definition": "The solar light is the symbol of the supramental light.",
    "source": "[wotm3, Symbolism]"
  },
  {
    "term": "Morality (Higher Law)",
    "definition": "You have no right to dispense with morality unless you submit yourself to a law that is higher and much more rigorous than any moral law.",
    "source": "[wotm3, Morality]"
  },
  {
    "term": "Divine Law vs. Morality",
    "definition": "You can break moral rules only when you observe the Divine Law. Moral laws have only a very relative value from the point of view of Truth.",
    "source": "[wotm3, Morality]"
  },
  {
    "term": "Integral Protection",
    "definition": "Safety that can be given only by the Divine, requiring unshakable faith in Divine Grace and total surrender.",
    "source": "[wotm3, Safety and Protection]"
  },
  {
    "term": "Wealth (Divine Purpose)",
    "definition": "Money is not meant to make money; it is meant to make the earth ready for the advent of the new creation. All riches belong to the Divine.",
    "source": "[wotm3, Wealth and Economics]"
  },
  {
    "term": "True Wealth",
    "definition": "That which one offers to the Divine. You are richer with the wealth you give than with what you keep.",
    "source": "[wotm3, Wealth and Economics]"
  },
  {
    "term": "Governance (Prerequisites)",
    "definition": "To govern others, one must first have complete self-control, no personal preferences, patience, and speak only what is indispensable.",
    "source": "[wotm3, Government and Politics]"
  },
  {
    "term": "Human Unity (Foundation)",
    "definition": "Lasting peace requires growth of consciousness of human unity. External union depends on mankind's goodwill and sincerity.",
    "source": "[wotm3, Human Unity]"
  },
  {
    "term": "Change of Consciousness",
    "definition": "A new birth into a higher sphere of existence, essential for humanity's salvation. It enables manifestation of higher Force, purer Light, and total Truth.",
    "source": "[wotm3, Human Unity]"
  },
  {
    "term": "Past (Yogic Attitude)",
    "definition": "To do yoga, one must shed attachment to the past. Complete consecration to the Divine wipes out what one has been.",
    "source": "[wotm3, The Past]"
  },
  {
    "term": "Present Moment",
    "definition": "The most important moment in life, for the past no longer exists and the future does not yet exist.",
    "source": "[wotm3, The Present]"
  },
  {
    "term": "True Progress",
    "definition": "To come always closer to the Divine. Stagnation means decomposition; life requires continuous advancement.",
    "source": "[wotm3, Progress]"
  },
    {
    "term": "Violence (Limitation)",
    "definition": "Violence is never a good way to make a cause triumph. How can one hope to obtain justice by injustice, harmony by hatred?",
    "source": "[wotm3, War and Violence]"
  },
  {
    "term": "Atomic Bomb (Duality)",
    "definition": "A sign of man's growing power over material nature, but dangerous without corresponding spiritual progress to counteract its misuse.",
    "source": "[wotm3, War and Violence]"
  },
  {
    "term": "Faith (Protection)",
    "definition": "The best protection is an unshakable faith in the Divine Grace. Protection is active and effective only with absolute and constant faith.",
    "source": "[wotm3, Safety and Protection]"
  },
  {
    "term": "Generosity (True)",
    "definition": "Gives and gives itself without bargaining. A gift made through vanity profits neither giver nor receiver.",
    "source": "[wotm3, Wealth and Economics]"
  },
  {
    "term": "Money (Divine Medium)",
    "definition": "Only a medium of exchange; Divine resources are inexhaustible. Never mix spiritual power and money, for it leads to catastrophe.",
    "source": "[wotm3, Wealth and Economics]"
  },
  {
    "term": "Government (Inspiration)",
    "definition": "Leaders should receive inspiration from those who have realized Truth and have no will but the Supreme’s—not from political ideologies.",
    "source": "[wotm3, Government and Politics]"
  },
  {
    "term": "Politics (Truthful)",
    "definition": "Avoid abusing personalities; wage a war of ideas so Truth may triumph. Bring Truth into politics—a sure way toward effective spirituality.",
    "source": "[wotm3, Government and Politics]"
  },
  {
    "term": "World Union (Principle)",
    "definition": "An outward movement to harmonize humanity, based on the fact of human unity realizing the truth of the Spirit.",
    "source": "[wotm3, Human Unity]"
  },
  {
    "term": "Peace (Precondition)",
    "definition": "To want peace upon earth, first establish peace in your heart. To want world union, first unify the parts of your own being.",
    "source": "[wotm3, Human Unity]"
  },
  {
    "term": "Darkness (Paradox)",
    "definition": "Some seek knowledge by forsaking the Light—only to enter a new darkness. The Light is everywhere, but men cling to ignorance.",
    "source": "[wotm3, Darkness and Light]"
  },
  {
    "term": "Past (Progress)",
    "definition": "Use the past as a springboard to leap toward the future. Lasting remembrance is only of what helped the being progress.",
    "source": "[wotm3, The Past]"
  },
  {
    "term": "Future (Promise)",
    "definition": "Necessarily better than the past. Full of possibilities for those who prepare. Each dawn brings the chance for new progress.",
    "source": "[wotm3, The Future]"
  },
  {
    "term": "Progress (Divine Sign)",
    "definition": "The sign of divine influence in creation. Purpose of earthly life; stagnation means decomposition.",
    "source": "[wotm3, Progress]"
  },
  {
    "term": "Perfection (Journey)",
    "definition": "Go always forward toward growing perfection. Each year must mark new progress.",
    "source": "[wotm3, Progress]"
  },
  {
    "term": "World (Transition)",
    "definition": "A new world based on Truth wants to take birth. The future depends on a change of consciousness—collaborate or be forced by circumstances.",
    "source": "[wotm3, The World Today]"
  },

 {
  "term": "Legitimate Authority",
  "definition": "To be legitimately exercised over others, authority must be enlightened, impartial, and unegoistic to the point where none can challenge its value.",
  "source": "[wotm3, Government and Politics]"
},
{
  "term": "Obedience (True)",
  "definition": "Only those with a perfect sense of justice can claim the right to be obeyed. To command well, one must first know how to obey.",
  "source": "[wotm3, Government and Politics]"
},
{
  "term": "Organisation (Basis)",
  "definition": "Organisation and discipline are the necessary basis for all realisation. Suppression is easier, but true order is far superior.",
  "source": "[wotm3, Government and Politics]"
},
{
  "term": "Surrender (Total)",
  "definition": "Give all you are and all you have; nothing more is asked, but nothing less. Only what is given to the Divine is truly safe.",
  "source": "[wotm3, Wealth and Economics]"
},
{
  "term": "Divine Will (Priority)",
  "definition": "In this material world, money is often treated as more sacred than the Divine’s Will—but the future will crush such narrowness.",
  "source": "[wotm3, Wealth and Economics]"
},
{
  "term": "Offering (Unconditional)",
  "definition": "A gift made without conditions can be taken as coming from the Divine, leaving the Divine to handle all obligations in return.",
  "source": "[wotm3, Wealth and Economics]"
},
{
  "term": "New Force (Manifestation)",
  "definition": "A new Consciousness has entered the world, giving humanity the capacity to realize its unity. The time for this endeavor is now.",
  "source": "[wotm3, Human Unity]"
},
{
  "term": "Change (Radical)",
  "definition": "Nothing but a radical change of consciousness can save humanity. All practical means are temporary; only inner transformation lasts.",
  "source": "[wotm3, Human Unity]"
},
{
  "term": "Synthesis (Living)",
  "definition": "Truth exists behind all theories, but none is perfect. A supple, progressive synthesis must emerge from lived experience—not mental constructs.",
  "source": "[wotm3, Human Unity]"
},
{
  "term": "New Force (Manifestation)",
  "definition": "A new Consciousness has entered the world, giving humanity the capacity to realize its unity. The time for this endeavor is now.",
  "source": "[wotm3, Human Unity]"
},
{
  "term": "Change (Radical)",
  "definition": "Nothing but a radical change of consciousness can save humanity. All practical means are temporary; only inner transformation lasts.",
  "source": "[wotm3, Human Unity]"
},
{
  "term": "Synthesis (Living)",
  "definition": "Truth exists behind all theories, but none is perfect. A supple, progressive synthesis must emerge from lived experience—not mental constructs.",
  "source": "[wotm3, Human Unity]"
},
{
  "term": "Hour of God",
  "definition": "A pivotal moment in evolution where the world’s transformation accelerates. Those who remain steady will emerge stronger.",
  "source": "[wotm3, The World Today]"
},
{
  "term": "Transition (Disgust)",
  "definition": "As the old world rots, disgust grows—a sign of the need for a new life-centre based on spiritual aspiration, not material strife.",
  "source": "[wotm3, The World Today]"
},
{
  "term": "Future (Collaboration)",
  "definition": "The new world will be born through collaboration with Truth. Those who feel this must answer the call.",
  "source": "[wotm3, The World Today]"
},
{
  "term": "Ignorance (Blindness)",
  "definition": "Men often leave the Light to seek knowledge in darkness, not realizing the Light itself holds all wisdom.",
  "source": "[wotm3, Darkness and Light]"
},
{
  "term": "Veils (Dissolution)",
  "definition": "All veils must dissolve for the Light to shine fully in every heart. This is the work of the Divine’s knowledge.",
  "source": "[wotm3, Darkness and Light]"
},
{
  "term": "Night (Journey)",
  "definition": "Life is a journey through darkness. Wake to the inner Light—it alone guides the way.",
  "source": "[wotm3, Darkness and Light]"
},
{
  "term": "Healing (True Source)",
  "definition": "In every case, it is the Force that cures. Medicines have little effect; it is the faith in medicines that cures.",
  "source": "[wotm3, Healing]"
},
{
  "term": "Doctor (Choice)",
  "definition": "To go from one doctor to another is like changing Gurus—it creates confusion. Choose one and stick to them unless they recommend consultation.",
  "source": "[wotm3, Healing]"
},
{
  "term": "Ayurveda (Advantage)",
  "definition": "Allopaths cure one thing to the detriment of another. Ayurvedic doctors lack this drawback, as their treatments harmonize with the body’s totality.",
  "source": "[wotm3, Healing]"
},
{
  "term": "Faith (Healing Power)",
  "definition": "Faith cures more than treatment. Combine medical help with a call to the Divine’s Force for true healing.",
  "source": "[wotm3, Healing]"
},
{
  "term": "Body (Channel)",
  "definition": "The human body is not a closed jar that empties by spending energy, but a channel that receives only when it spends. Eat, sleep, and avoid wrong thinking to restore balance.",
  "source": "[wotm3, Healing]"
},
{
  "term": "Tumours (Root Cause)",
  "definition": "Tumours signify cells rebelling against the body’s discipline, often due to greed—material or subtle. Surgery alone fails unless the inner nature changes.",
  "source": "[wotm3, Healing]"
},
{
  "term": "Cancer (Consciousness)",
  "definition": "Cancer arises when cells habitually multiply without cause. Cure requires changing the consciousness in the cells to dissolve this habit.",
  "source": "[wotm3, Healing]"
},
{
  "term": "Hour of God",
  "definition": "A pivotal moment in evolution when the world’s transformation accelerates. Those who remain steady emerge stronger.",
  "source": "[wotm3, New Year Messages]"
},
{
  "term": "Truth (Imperative)",
  "definition": "Men, countries, continents must choose: Truth or the abyss. The abyss is the combination of fear, distrust, and material interests governing human actions.",
  "source": "[wotm3, New Year Messages]"
},
{
  "term": "New Light (Advent)",
  "definition": "Celebrate the advent of a new light in consciousness—higher, purer, and free from past habits.",
  "source": "[wotm3, Christmas Messages]"
},
{
  "term": "Fear (Enemy)",
  "definition": "The greatest of all enemies. At its slightest touch, react and call for help. Do not identify with the body’s fears; treat it as a child needing reassurance.",
  "source": "[wotm3, Darshan Messages]"
},
{
  "term": "Supramental (Manifestation)",
  "definition": "No longer a promise but a living fact working upon earth. Even the most unwilling will one day recognize its reality.",
  "source": "[wotm3, Darshan Messages]"
},
{
  "term": "Warrior (Sadhana)",
  "definition": "To follow Sri Aurobindo’s Yoga, one must be a warrior; after his passing, a hero. Fear nothing—neither enemies nor death—for the struggle ends in Victory.",
  "source": "[wotm3, Darshan Messages]"
},
{
  "term": "Golden Day",
  "definition": "29 February, the day of the Lord, marks the descent of the supramental Light and Force upon earth, shattering the door separating the world from the Divine.",
  "source": "[wotm3, Supramental Manifestation]"
},
{
  "term": "Supramental (Permanence)",
  "definition": "Only when the Supramental manifests in the body-mind can its presence become permanent. This is the next stage of evolution.",
  "source": "[wotm3, Supramental Manifestation]"
},
{
  "term": "Divine Grace (Aspects)",
  "definition": "Two indispensable aspects: (1) Sovereign peace liberating from suffering, and (2) Dynamic progress liberating from inertia. The latter is welcomed only by the courageous.",
  "source": "[wotm3, Darshan Messages]"
},
{
  "term": "Sincerity (Perfect)",
  "definition": "Better to *be* than to seem good. Express only the central truth of your being in thoughts, feelings, and actions.",
  "source": "[wotm3, Spiritual Practice]"
},
{
  "term": "Path (Requirements)",
  "definition": "Demands dauntless courage, perfect sincerity, and total self-giving—without bargaining, calculation, or faith that needs proofs.",
  "source": "[wotm3, Spiritual Practice]"
},
{
  "term": "Purification (Fire)",
  "definition": "The fire of purification need not cause illness. One can be purified without falling sick, as illness often stems from resistance or wrong suggestions.",
  "source": "[wotm3, Healing]"
},
{
  "term": "Gratitude (Delight)",
  "definition": "Physically, materially, upon earth, gratitude is the source of the purest delight. It opens the heart to the Divine’s gifts.",
  "source": "[wotm3, Spiritual Practice]"
},
{
  "term": "New World (Birth)",
  "definition": "A world based on Truth, refusing the slavery of falsehood, is struggling to be born. Its advent depends on human collaboration with the new Consciousness.",
  "source": "[wotm3, The World Today]"
},
{
  "term": "Human Unity (Foundation)",
  "definition": "Beyond all preferences and limitations, the aspiration for divine consciousness is the common ground where all can meet in harmony.",
  "source": "[wotm3, Darshan Messages]"
},
{
  "term": "Consciousness (Universal)",
  "definition": "When you are conscious of the whole world simultaneously, you become conscious of the Divine. This is the key to supramental realization.",
  "source": "[wotm3, New Year Messages]"
}
]

