{
"Divine Name": { "quote": "But you, LORD, are the Most High over all the earth. (Psalm 97:9)" },
"Divine Unity": { "quote": "Hear, O Israel: The LORD our God, the LORD is one. (Deuteronomy 6:4)" },
"Divine Sovereignty": { "quote": "Yours, O LORD, is the greatness and the power and the glory and the majesty and the splendor. (1 Chronicles 29:11)" },
"Divine Covenant": { "quote": "I will take you as my own people, and I will be your God. (Exodus 6:7)" },
"Divine Justice": { "quote": "For the LORD is a God of justice; blessed are all who wait for him. (Isaiah 30:18)" },
"Divine Mercy": { "quote": "The LORD, the LORD, the compassionate and gracious God, slow to anger, abounding in love and faithfulness. (Exodus 34:6)" },
"Divine Creation": { "quote": "In the beginning God created the heavens and the earth. (Genesis 1:1)" },
"Divine Protection": { "quote": "The LORD is my rock, my fortress and my deliverer. (Psalm 18:2)" },
"Divine Wisdom": { "quote": "For the LORD gives wisdom; from his mouth come knowledge and understanding. (Proverbs 2:6)" },
"Divine Presence": { "quote": "Where can I go from your Spirit? Where can I flee from your presence? (Psalm 139:7)" },
"Divine Law": { "quote": "The law of the LORD is perfect, refreshing the soul. (Psalm 19:7)" },
"Divine Holiness": { "quote": "Holy, holy, holy is the LORD Almighty; the whole earth is full of his glory. (Isaiah 6:3)" },
"Divine Redemption": { "quote": "In his love and mercy he redeemed them; he lifted them up and carried them. (Isaiah 63:9)" },
"Divine Truth": { "quote": "The LORD is near to all who call on him, to all who call on him in truth. (Psalm 145:18)" },
"Divine Guidance": { "quote": "He guides the humble in what is right and teaches them his way. (Psalm 25:9)" },
"Divine Promise": { "quote": "Know therefore that the LORD your God is God; he is the faithful God, keeping his covenant of love. (Deuteronomy 7:9)" },
"Divine Judgment": { "quote": "For the LORD will judge his people and have compassion on his servants. (Psalm 135:14)" },
"Divine Power": { "quote": "Ah, Sovereign LORD, you have made the heavens and the earth by your great power. (Jeremiah 32:17)" },
"Divine Glory": { "quote": "The heavens declare the glory of God; the skies proclaim the work of his hands. (Psalm 19:1)" },
"Divine Providence": { "quote": "The LORD will keep you from all harm—he will watch over your life. (Psalm 121:7)" },
"Divine Blessing": { "quote": "The LORD bless you and keep you; the LORD make his face shine on you. (Numbers 6:24-25)" },
"Divine Knowledge": { "quote": "O LORD, you have searched me and you know me. (Psalm 139:1)" },
"Divine Voice": { "quote": "The voice of the LORD is powerful; the voice of the LORD is majestic. (Psalm 29:4)" },
"Divine Eternity": { "quote": "Before the mountains were born or you brought forth the earth and the world, from everlasting to everlasting you are God. (Psalm 90:2)" },
"Divine Kingship": { "quote": "The LORD reigns forever and ever. (Exodus 15:18)" },
"Divine Peace": { "quote": "The LORD gives strength to his people; the LORD blesses his people with peace. (Psalm 29:11)" },
"Divine Commandments": { "quote": "The commands of the LORD are radiant, giving light to the eyes. (Psalm 19:8)" },
"Divine Salvation": { "quote": "The LORD is my light and my salvation—whom shall I fear? (Psalm 27:1)" },
"Divine Faithfulness": { "quote": "Your faithfulness continues through all generations. (Psalm 119:90)" },
"Divine Victory": { "quote": "The LORD your God is the one who goes with you to fight for you against your enemies to give you victory. (Deuteronomy 20:4)" }
}
