{
"Exploration": { "quote": "Discovery of new environments drives the player forward. Breath of the Wild rewards curiosity with unexpected discoveries on every horizon." },
"Puzzle Solving": { "quote": "Intellectual challenges that gate progression. Myst requires careful observation and logical thinking to decode its mechanical puzzles." },
"Narrative Focus": { "quote": "Story as the primary motivation for player engagement. Life is Strange centers its gameplay around branching narrative decisions and character relationships." },
"Inventory Management": { "quote": "Collecting and using items to overcome obstacles. Monkey Island's inventory-based puzzles create humorous combinations and solutions." },
"Character Interaction": { "quote": "Dialogues and relationships with NPCs drive the experience. Mass Effect's conversation system shapes both narrative and character development." },
"Environmental Storytelling": { "quote": "Using space and objects to convey narrative. What Remains of Edith Finch tells family stories through uniquely designed rooms and interactive vignettes." },
"Point-and-Click Interface": { "quote": "Simplified interaction through cursor-based navigation. Machinarium uses intuitive pointing and clicking to interact with its detailed environments." },
"Text Adventures": { "quote": "Text-based input and output forms the original adventure game format. Zork's parser interpreted player commands to navigate its underground empire." },
"Graphic Adventures": { "quote": "Visual presentation with point-and-click interaction. The Secret of Monkey Island pioneered LucasArts' accessible interface and humorous puzzles." },
"Walking Simulators": { "quote": "Exploration-focused experiences with minimal mechanical complexity. Firewatch emphasizes narrative discovery through environmental exploration." },
"Visual Novels": { "quote": "Text-driven narratives with branching choices and static imagery. Phoenix Wright: Ace Attorney combines visual novel elements with investigation and courtroom gameplay." },
"Puzzle Design": { "quote": "Creating challenges that test player logic and observation. Portal integrates spatial reasoning puzzles with its core mechanics and narrative." },
"Adventure Game Logic": { "quote": "The often unusual solutions required in classic adventure games. Using a rubber chicken with a pulley in the middle to cross a chasm in Monkey Island 2." },
"Narrative Puzzles": { "quote": "Challenges integrated with storytelling. Her Story requires piecing together a fragmented narrative through database searches." },
"Dialogue Trees": { "quote": "Branching conversations that offer player choice. Telltale's The Walking Dead uses timed dialogue choices to create emotional pressure." },
"Cutscenes": { "quote": "Non-interactive story sequences. Final Fantasy VII uses pre-rendered cutscenes to highlight dramatic moments in its narrative." },
"Environmental Puzzles": { "quote": "Challenges integrated into the game world. The Witness embeds puzzles within its landscape, teaching principles through spatial discovery." },
"Quest Structure": { "quote": "Organized objectives that guide player progression. The Witcher 3 uses branching quests with moral choices and consequences." },
"Interactive Objects": { "quote": "Elements within the environment that players can manipulate. Return of the Obra Dinn allows examination of specific objects to unlock memories." },
"Adventure Game Interfaces": { "quote": "Methods for interacting with the game world. LucasArts' SCUMM interface streamlined interaction with a verb-based action system." },
"Cinematic Adventure": { "quote": "Visually driven experiences with dramatic presentation. Uncharted blends cinematic storytelling with action and puzzle elements." },
"Mystery Solving": { "quote": "Piecing together clues to uncover truth. L.A. Noire challenges players to interview suspects and analyze crime scenes." },
"Morality Systems": { "quote": "Ethical choices that affect story outcomes. The Walking Dead forces difficult decisions with consequences that persist throughout the series." },
"Interactive Fiction": { "quote": "Text-based adventures with parser input. A Mind Forever Voyaging uses text to create a complex dystopian future scenario." },
"Narrative Design": { "quote": "Structuring story elements for player discovery. Gone Home arranges environmental storytelling elements to reveal its narrative gradually." },
"Escape Room Design": { "quote": "Self-contained puzzle environments. The Room series creates intricate puzzle boxes with mechanical challenges." },
"Checkpoint Systems": { "quote": "Methods of tracking player progress. Adventure games evolved from save points to automatic checkpoints to reduce frustration." },
"Hidden Object Games": { "quote": "Finding concealed items within detailed scenes. Hidden Folks creates whimsical scenes where objects blend into intricate illustrations." },
"Adventure Game Hints": { "quote": "Systems to assist stuck players. LucasArts' hint hotline evolved to in-game hint systems and now contextual assistance." },
"Emergent Narrative": { "quote": "Stories that develop through player interaction. Outer Wilds' time loop allows players to piece together a cosmic mystery at their own pace." }
}
