{
"Tragic Vision": { "quote": "There is advantage in the wisdom won from pain. (Agamemnon, 177)" },
"Divine Justice": { "quote": "Justice shines in smoke-blackened houses and honors the righteous life. (Agamemnon, 774-775)" },
"Fate and Destiny": { "quote": "Fate works most for woe with Fate's decree. (Agamemnon, 1536)" },
"Human Suffering": { "quote": "Even in our sleep, pain that cannot forget falls drop by drop upon the heart. (Agamemnon, 179-181)" },
"Dramatic Innovation": { "quote": "Aeschylus added a second actor, diminished the chorus, and gave the dialogue the leading part. (Aristotle, Poetics)" },
"Moral Law": { "quote": "For the crime of evil done, the payment of evil suffered. (Libation Bearers, 313)" },
"Divine Wisdom": { "quote": "Zeus, who guided mortals to be wise, has established his fixed law—wisdom comes through suffering. (Agamemnon, 176-178)" },
"Dramatic Form": { "quote": "Words are the physicians of a mind diseased. (Prometheus Bound, 378)" },
"Poetic Style": { "quote": "Bronze is the mirror of the form; wine, of the heart. (Fragment 393)" },
"Theatrical Legacy": { "quote": "Every play of Aeschylus is a slices from the great banquet of Homer's poems. (Athenaeus)" },
"Religious Thought": { "quote": "God's mouth knows not to speak falsehood, but he will accomplish every word. (Prometheus Bound, 1032-1033)" },
"Political Ideas": { "quote": "Neither anarchy nor tyranny, my countrymen, worship ye; to the middle way does God give glory. (Eumenides, 696-697)" },
"Historical Context": { "quote": "Happy is he who has learned how to engage in inquiry, with no impulse to harm his countrymen or to pursue wrongful actions. (Fragment 394)" },
"Dramatic Themes": { "quote": "For hostile to me is the whole race of gods. (Prometheus Bound, 975)" },
"Character Development": { "quote": "It is not the oath that makes us believe the man, but the man the oath. (Fragment 385)" },
"Tragic Structure": { "quote": "Success is man's god; but when failure comes, goodbye friend, goodbye glory. (Agamemnon, 1337-1338)" },
"Choral Function": { "quote": "The words of truth are simple. (Fragment 176)" },
"Mythological Treatment": { "quote": "Time brings all things to pass. (Prometheus Bound, 981)" },
"War Commentary": { "quote": "In war, truth is the first casualty. (Fragment attributed to Aeschylus)" },
"Human Nature": { "quote": "Few men have the natural strength to honor a friend's success without envy. (Agamemnon, 832-833)" },
"Dramatic Purpose": { "quote": "It is a profitable thing, if one is wise, to learn wisdom even from a foe. (Seven Against Thebes, 724)" },
"Literary Style": { "quote": "Words are the shadows of deeds. (Fragment 181)" },
"Moral Philosophy": { "quote": "Learning is ever in the freshness of its youth, even for the old. (Agamemnon, 584)" },
"Divine Retribution": { "quote": "The anvil of justice is planted firm, and Fate who makes the sword does the forging in advance. (Agamemnon, 385-386)" },
"Tragic Heroes": { "quote": "For the impious act, the penalty is sure. (Fragment 266)" },
"Dramatic Influence": { "quote": "By suffering comes wisdom. (Agamemnon, 177)" },
"Poetic Innovation": { "quote": "From a small seed a mighty trunk may grow. (Fragment attributed to Aeschylus)" },
"Tragic Philosophy": { "quote": "There is no pain so great as the memory of joy in present grief. (Agamemnon, 737-738)" },
"Dramatic Technique": { "quote": "Better to fall from power, if fall we must, at the hands of men than that women triumph over us. (Agamemnon, 1231)" },
"Cultural Impact": { "quote": "Death is better, a milder fate than tyranny. (Agamemnon, 1364)" }
}
