{
"Divine Essence": { "quote": "He is the First and the Last, the Manifest and the Hidden. (Quran 57:3)" },
"Absolute Being": { "quote": "Everything will perish save His Face (Essence). (Quran 28:88)" },
"Essential Reality": { "quote": "The Essence (Ain) is that which cannot be known except through Its manifestations. (Ibn Arabi, Fusus al-Hikam)" },
"Divine Vision": { "quote": "Vision perceives Him not, but He perceives all vision. (Quran 6:103)" },
"Eye of Reality": { "quote": "Through His Eye, the universe sees itself. (Al-Jili, Universal Man)" },
"Essential Unity": { "quote": "The Essence is One, though Its attributes are many. (Abdul Karim al-Jili)" },
"Divine Witness": { "quote": "Allah is sufficient as Witness. (Quran 4:79)" },
"Essential Knowledge": { "quote": "The knower and the known are One in the Eye of Reality. (Ibn Arabi)" },
"Divine Perception": { "quote": "I become the hearing with which he hears, and the sight with which he sees. (Hadith Qudsi)" },
"Essential Light": { "quote": "Through His Light, all things become manifest. (Al-Ghazali, Mishkat Al-Anwar)" },
"Divine Core": { "quote": "The Essence is the innermost reality of all that exists. (Ibn Arabi, Futuhat)" },
"Essential Identity": { "quote": "The Eye of the Essence sees Itself in all things. (Al-Jili)" },
"Divine Source": { "quote": "From the One Eye flows all vision. (Rumi, Mathnawi)" },
"Essential Presence": { "quote": "Wheresoever you turn, there is the Face of Allah. (Quran 2:115)" },
"Divine Observation": { "quote": "He is with you wherever you are. (Quran 57:4)" },
"Essential Being": { "quote": "Being itself is the manifestation of the Essential Eye. (Ibn Arabi)" },
"Divine Witnessing": { "quote": "Is it not enough that your Lord is Witness over all things? (Quran 41:53)" },
"Essential Nature": { "quote": "The nature of the Essence is to be known through Its effects. (Al-Ghazali)" },
"Divine Gaze": { "quote": "His gaze encompasses all creation. (Ibn Arabi, Fusus)" },
"Essential Truth": { "quote": "Truth is that which never changes in the Eye of the Eternal. (Al-Junayd)" },
"Divine Recognition": { "quote": "Who knows his self knows his Lord. (Prophetic Tradition)" },
"Essential View": { "quote": "Every view is the view of the One Eye. (Al-Jili)" },
"Divine Consciousness": { "quote": "Consciousness itself is the Eye of the Divine. (Ibn Arabi)" },
"Essential Understanding": { "quote": "Understanding comes through the opening of the Essential Eye. (Rumi)" },
"Divine Insight": { "quote": "True insight comes from the Eye of Certainty. (Al-Ghazali)" },
"Essential Awareness": { "quote": "Awareness is the reflection of the Divine Eye. (Ibn Arabi)" },
"Divine Comprehension": { "quote": "Nothing is hidden from His comprehension. (Quran 10:61)" },
"Essential Vision": { "quote": "The Eye of the Heart sees what physical eyes cannot. (Rumi)" },
"Divine Perspective": { "quote": "Every perspective is contained within the Divine Eye. (Al-Jili)" },
"Essential Witnessing": { "quote": "In witnessing the creation, we witness the Creator. (Ibn Ata'Allah)" }
}
