{
"Spiritual Journey": { "quote": "The journey of the seeker of truth has three stages: increase in knowledge, realization of states, and being adorned with Divine attributes. (The Alchemy of Happiness)" },
"Knowledge": { "quote": "Knowledge exists potentially in the human soul like the seed in the soil; by learning the potential becomes actual. (The Book of Knowledge)" },
"Divine Unity": { "quote": "The source of all perfection is the perfect knowledge of Divine Unity. (The Niche of Lights)" },
"Heart Purification": { "quote": "The heart is like a mirror. When a person commits a sin, it becomes dark. But when he repents, it is polished again. (Revival of Religious Sciences)" },
"Spiritual States": { "quote": "The states of the heart change more quickly than a pot of water comes to boil. (Revival of Religious Sciences)" },
"Religious Sciences": { "quote": "The religious sciences are the medicine of hearts, and the worldly sciences are the medicine of bodies. (The Book of Knowledge)" },
"Faith": { "quote": "Faith is not merely believing with the tongue, but knowing with the heart and acting with the limbs. (The Foundations of Islamic Belief)" },
"Divine Love": { "quote": "Love of Allah is the highest of all topics and the most precious of all treasures. (Revival of Religious Sciences)" },
"Philosophical Doubt": { "quote": "The seeker after truth is not one who studies the writings of the ancients and follows his natural disposition to put his trust in them, but rather the one who suspects his faith in them and questions what he gathers from them. (Deliverance from Error)" },
"Moral Character": { "quote": "Good character is not formed simply by knowing what is right, but by constant practice. (Revival of Religious Sciences)" },
"Self-Knowledge": { "quote": "He who knows himself knows his Lord. (The Alchemy of Happiness)" },
"Truth Seeking": { "quote": "The search for truth is more precious than its possession. (Deliverance from Error)" },
"Divine Wisdom": { "quote": "The purpose of divine wisdom is to draw out what is latent in souls. (The Niche of Lights)" },
"Spiritual Practice": { "quote": "Work for your worldly life as if you were going to live forever, and work for your Hereafter as if you were going to die tomorrow. (Revival of Religious Sciences)" },
"Knowledge Types": { "quote": "Knowledge without action is vanity, and action without knowledge is insanity. (The Book of Knowledge)" },
"Mystical Experience": { "quote": "The mystic is he who knows by experience, not he who believes on hearsay. (The Alchemy of Happiness)" },
"Divine Names": { "quote": "The highest knowledge is the knowledge of the names and attributes of Allah. (The Ninety-Nine Beautiful Names of God)" },
"Human Nature": { "quote": "The human heart has two powers: external and internal. The external power is the bodily senses; the internal power is the heart's inherent capacity to know Allah. (The Alchemy of Happiness)" },
"Ethics": { "quote": "The highest form of worship is watchfulness of the moments, that is, a person should keep watch over his moments and breaths. (Revival of Religious Sciences)" },
"Spiritual Intelligence": { "quote": "Intelligence is the light in the heart which distinguishes between truth and falsehood. (The Book of Knowledge)" },
"Divine Proximity": { "quote": "The nearest way to Allah is through service to His creation. (Revival of Religious Sciences)" },
"Virtuous Life": { "quote": "The essence of all worship is gratitude to Allah. (The Alchemy of Happiness)" },
"Religious Authority": { "quote": "The scholars are the inheritors of the prophets. (Revival of Religious Sciences)" },
"Soul Purification": { "quote": "The key to knowing Allah is knowing one's own soul. (The Alchemy of Happiness)" },
"Spiritual Leadership": { "quote": "The true teacher is one who guides to Allah, not to himself. (Revival of Religious Sciences)" },
"Divine Guidance": { "quote": "Guidance is not attained except through submission and humility. (The Beginning of Guidance)" },
"Mystical Knowledge": { "quote": "The goal of mystical knowledge is to remove the veils between the servant and his Lord. (The Niche of Lights)" },
"Spiritual Enlightenment": { "quote": "The light of guidance is proportional to one's detachment from worldly desires. (Revival of Religious Sciences)" },
"Divine Reality": { "quote": "The reality of things is known only through the light which Allah casts into the heart. (The Niche of Lights)" },
"Religious Practice": { "quote": "The essence of worship is following the Sunnah with sincerity of intention. (The Beginning of Guidance)" }
}
