[
  {
    "property": "Stage Name",
    "description": "Albedo (The Whitening)"
  },
  {
    "property": "Yogic Equivalent",
    "description": "The Illumination and Purification of the Nature (Śuddhi); the emergence of the Psychic Being's influence after the initial crisis of transformation."
  },
  {
    "property": "Consciousness Level Correlation",
    "description": "The successful transition into the lower Subtle Realm (levels 19-24). Consciousness is no longer defined by the egoistic structures of the Gross-Reflecting realm but is now open to spiritual Light, Peace, and intuitive guidance."
  },
  {
    "property": "Purpose in Integral Yoga",
    "description": "To establish a foundation of Purity, Peace, and psychic awareness in the nature. This 'whitening' washes away the 'blackness' of the ignorant lower nature, making the being a clear and receptive vessel for the descent of the higher spiritual consciousness."
  },
  {
    "property": "Subjective Experience",
    "description": "A dawning of inner Light, clarity, and hope after the darkness. The turmoil of the vital nature subsides, replaced by experiences of spontaneous peace, purity, love for the Divine (Bhakti), and a growing sense of the Divine's presence and guidance."
  },
  {
    "property": "Key Achievement: Emergence of the Psychic Being",
    "description": "The central event of this stage. The inmost soul (Caitya Purusha) comes forward to govern the mind, life, and body, infusing them with its native qualities of truth, beauty, harmony, and an unerring perception of the Divine."
  },
  {
    "property": "Established State: Purity (Śuddhi)",
    "description": "The consciousness, now under the psychic's influence, responds only to the Divine Influence. It has a spontaneous rejection of egoistic motives and the turbid movements of the lower nature."
  },
  {
    "property": "Established State: Equality (Samatā)",
    "description": "The establishment of a fundamental calm, peace, and equanimity. The being remains unmoved within by external happenings or the passions of the vital nature, observing them from a detached and luminous poise."
  },
  {
    "property": "Established State: Peace (Śānti)",
    "description": "A positive state of settled and harmonious rest and deliverance. This inner peace becomes the stable basis upon which the higher consciousness can be built without being shaken by the lower nature."
  },
  {
    "property": "Central Method: Consecration (Samarpana)",
    "description": "The active, joyful, and continuous offering of all thoughts, feelings, and actions to the Divine. It evolves from the difficult surrender of Nigredo into a spontaneous self-giving guided by the psychic being's love."
  },
  {
    "property": "Technique: Psychic Aspiration",
    "description": "The aspiration is no longer a desperate call from the darkness but a pure, steady flame of devotion rising from the heart, which effectively calls and draws down the higher Light, Force, and Ananda."
  },
  {
    "property": "Technique: Psychic Discernment",
    "description": "The psychic being's innate and unerring perception of truth and falsehood becomes a primary tool. It spontaneously recognizes what is divine and what is not, guiding the sadhak's choices in life and sadhana without the need for mental reasoning."
  },
  {
    "property": "Yogic Practice: Asanas",
    "description": "Practices shift towards opening and receptivity. Heart-opening poses such as Ustrasana (Camel) and Bhujangasana (Cobra) become prominent, facilitating the expression of the psychic being's love and devotion."
  },
  {
    "property": "Yogic Practice: Mudras",
    "description": "Anjali Mudra (Gesture of Reverence) becomes a more constant inner and outer state of being. The Lotus Mudra (Padma Mudra) is used to symbolize the opening of the heart and the entire being to the Divine Influence."
  },
  {
    "property": "Yogic Practice: Japa/Mantra",
    "description": "The repetition of a Divine Name or mantra becomes filled with genuine love and devotion (Bhakti). It ceases to be a mere discipline and transforms into a joyful communion and a means of constant remembrance."
  },
  {
    "property": "Goal of This Stage",
    "description": "Psychicisation. The aim is for the Psychic Being to become the leader of the sadhana and the true ruler of the nature. Its influence purifies and begins to transform the mental, vital, and physical parts, making them fit and willing instruments for a divine life."
  },
  {
    "property": "Guiding Principle",
    "description": "The Mother's Light. The sadhak's experience is now characterized by a conscious and direct perception of a descending Light and Force that purifies, illumines, and guides the path forward, replacing the feeling of being lost in the darkness."
  }
]

