{
"Names of Allah": { "quote": "Allah has ninety-nine names, one hundred minus one; whoever knows them will enter Paradise. (Sahih Bukhari 2736)" },
"Divine Unity": { "quote": "Say, 'He is Allah, [who is] One.' (Quran 112:1)" },
"Divine Attributes": { "quote": "Allah - there is no deity except Him, the Ever-Living, the Self-Sustaining. (Quran 2:255)" },
"Divine Sovereignty": { "quote": "To Him belongs whatever is in the heavens and whatever is on the earth. (Quran 2:255)" },
"Divine Knowledge": { "quote": "He knows what is within the heavens and earth and knows what you conceal and what you declare. (Quran 64:4)" },
"Divine Creation": { "quote": "Indeed, your Lord is Allah, who created the heavens and earth in six days. (Quran 7:54)" },
"Divine Mercy": { "quote": "My mercy embraces all things. (Quran 7:156)" },
"Divine Justice": { "quote": "And your Lord does injustice to no one. (Quran 18:49)" },
"Divine Guidance": { "quote": "Indeed, this Quran guides to that which is most suitable. (Quran 17:9)" },
"Divine Power": { "quote": "Indeed, Allah is over all things competent. (Quran 2:20)" },
"Divine Will": { "quote": "Allah does what He intends. (Quran 22:14)" },
"Divine Presence": { "quote": "And We are closer to him than [his] jugular vein. (Quran 50:16)" },
"Divine Light": { "quote": "Allah is the Light of the heavens and the earth. (Quran 24:35)" },
"Divine Truth": { "quote": "That is because Allah is the Truth. (Quran 22:62)" },
"Divine Wisdom": { "quote": "He gives wisdom to whom He wills, and whoever has been given wisdom has certainly been given much good. (Quran 2:269)" },
"Divine Judgment": { "quote": "Indeed, to Allah belongs the judgment. (Quran 12:40)" },
"Divine Forgiveness": { "quote": "Indeed, Allah forgives all sins. Indeed, it is He who is the Forgiving, the Merciful. (Quran 39:53)" },
"Divine Protection": { "quote": "And Allah is the best of guardians. (Quran 12:64)" },
"Divine Sustenance": { "quote": "Indeed, it is Allah who is the [continual] Provider, the firm possessor of strength. (Quran 51:58)" },
"Divine Signs": { "quote": "We will show them Our signs in the horizons and within themselves. (Quran 41:53)" },
"Divine Oneness": { "quote": "Your god is one God. There is no deity [worthy of worship] except Him. (Quran 2:163)" },
"Divine Authority": { "quote": "All authority belongs to Allah. (Quran 12:67)" },
"Divine Magnificence": { "quote": "He is the Most High, the Most Great. (Quran 2:255)" },
"Divine Nearness": { "quote": "And when My servants ask you concerning Me - indeed I am near. (Quran 2:186)" },
"Divine Hearing": { "quote": "Indeed, Allah is Hearing and Knowing. (Quran 2:181)" },
"Divine Seeing": { "quote": "Indeed, Allah is Seeing of what you do. (Quran 2:110)" },
"Divine Lordship": { "quote": "All praise is due to Allah, Lord of the worlds. (Quran 1:2)" },
"Divine Eternity": { "quote": "He is the First and the Last, the Ascendant and the Intimate. (Quran 57:3)" },
"Divine Relationship": { "quote": "Remember Me; I will remember you. (Quran 2:152)" },
"Divine Worship": { "quote": "I did not create the jinn and mankind except to worship Me. (Quran 51:56)" }
}
