{
"Intelligent Agents": { "quote": "An agent is anything that can perceive its environment through sensors and act upon that environment through actuators." },
"Rationality": { "quote": "A rational agent acts to achieve the best expected outcome, given what it knows about its environment." },
"PEAS Framework": { "quote": "Performance, Environment, Actuators, Sensors - the complete description of an agent's task." },
"Agent Types": { "quote": "Simple reflex agents, model-based reflex agents, goal-based agents, utility-based agents, and learning agents represent increasingly sophisticated AI architectures." },
"Problem Solving": { "quote": "Systematic exploration of a solution space to find paths to goal states, often through search algorithms." },
"Search Algorithms": { "quote": "Breadth-first, depth-first, uniform cost, greedy best-first, A*, and other algorithms represent different strategies for exploring state spaces." },
"Heuristics": { "quote": "Problem-specific knowledge that guides search by estimating the cost from a state to the goal." },
"Constraint Satisfaction": { "quote": "Problems defined by variables with values that must satisfy specific constraints, often solved through backtracking and constraint propagation." },
"Adversarial Search": { "quote": "Search techniques for competitive environments like games, including minimax, alpha-beta pruning, and Monte Carlo tree search." },
"Knowledge Representation": { "quote": "Methods for encoding information about the world in a form that a computer system can utilize to solve complex tasks." },
"First-Order Logic": { "quote": "A formal language for representing objects, properties, relations, and functions, with quantification over variables." },
"Planning": { "quote": "Devising a sequence of actions to achieve a goal, considering preconditions and effects of actions." },
"Uncertainty": { "quote": "Handling incomplete or probabilistic information through methods like Bayesian networks and utility theory." },
"Bayesian Networks": { "quote": "Graphical models that represent probabilistic relationships among variables, enabling efficient reasoning under uncertainty." },
"Utility Theory": { "quote": "Framework for making optimal decisions by maximizing expected utility when outcomes are uncertain." },
"Markov Decision Processes": { "quote": "Mathematical framework for sequential decision making under uncertainty, modeling stochastic environments with rewards." },
"Reinforcement Learning": { "quote": "Learning optimal behavior through trial-and-error interaction with a dynamic environment, using feedback from rewards or penalties." },
"Machine Learning": { "quote": "Systems that improve their performance on a task through experience, without being explicitly programmed." },
"Supervised Learning": { "quote": "Learning a function that maps inputs to outputs based on example input-output pairs, including classification and regression tasks." },
"Unsupervised Learning": { "quote": "Finding patterns or structure in unlabeled data, such as clustering, dimensionality reduction, and density estimation." },
"Neural Networks": { "quote": "Computing systems inspired by biological neural networks, consisting of nodes that process information by dynamic state responses to external inputs." },
"Deep Learning": { "quote": "Neural networks with multiple layers that progressively extract higher-level features from raw input, revolutionizing many AI applications." },
"Natural Language Processing": { "quote": "Techniques enabling computers to understand, interpret, and generate human language in useful ways." },
"Computer Vision": { "quote": "Systems that extract information from images or multi-dimensional data, enabling machines to 'see' and interpret visual information." },
"Robotics": { "quote": "The integration of perception, reasoning, and action in physical systems that interact with the real world." },
"Multi-Agent Systems": { "quote": "Collections of interacting autonomous agents, requiring coordination, cooperation, or competition strategies." },
"Ethics in AI": { "quote": "Consideration of moral implications of AI systems, including issues of bias, transparency, privacy, and potential societal impact." },
"Knowledge Engineering": { "quote": "The process of building knowledge-based systems by extracting knowledge from humans and representing it in a machine-usable form." },
"Expert Systems": { "quote": "AI systems that emulate human expertise in specific domains, typically using rule-based reasoning on a knowledge base." },
"Philosophical Foundations": { "quote": "Questions about the possibility and nature of thinking machines, including concepts of strong AI, the Turing Test, and the Chinese Room argument." }
}
