{
"Divine Fullness": { "quote": "Bhagavan means one who possesses six opulences in full: wealth, strength, fame, beauty, knowledge and renunciation. (Vishnu Purana 6.5.47)" },
"Supreme Being": { "quote": "The word bhagavan means the Supreme Personality who possesses all riches, all strength, all fame, all beauty, all knowledge and all renunciation. (Bhagavata Purana 1.3.28)" },
"Divine Consciousness": { "quote": "Bhagavan is the supreme consciousness, the source of all that exists. (Brahma Sutra 1.1.2)" },
"Divine Energy": { "quote": "Just as fire spreads its light and heat everywhere, similarly, Bhagavan expands Himself by His diverse energies. (Bhagavata Purana 3.28.40)" },
"Divine Existence": { "quote": "The Supreme exists within and without - animate and inanimate. (Bhagavad Gita 13.16)" },
"Divine Form": { "quote": "Though unborn and immutable, the Lord of all beings, by My own nature, I manifest through My Maya. (Bhagavad Gita 4.6)" },
"Divine Nature": { "quote": "The nature of Bhagavan is sat-chit-ananda - eternal existence, pure consciousness, and infinite bliss. (Brahma Samhita 5.1)" },
"Divine Qualities": { "quote": "The Supreme Personality possesses innumerable auspicious qualities, of which sixty-four are considered principal. (Bhakti Rasamrita Sindhu 2.1.1)" },
"Divine Abode": { "quote": "The supreme abode of Lord Vishnu, where the self-realized souls reside, is illuminated neither by sun nor moon. (Bhagavad Gita 15.6)" },
"Divine Creation": { "quote": "I am the source of all spiritual and material worlds. Everything emanates from Me. (Bhagavad Gita 10.8)" },
"Divine Presence": { "quote": "I am the Super-soul, situated within the heart of all living entities. (Bhagavad Gita 10.20)" },
"Divine Grace": { "quote": "Only by devotional service can one understand Me as I am. (Bhagavad Gita 18.55)" },
"Divine Knowledge": { "quote": "To those who are constantly devoted to serving Me with love, I give the understanding by which they can come to Me. (Bhagavad Gita 10.10)" },
"Divine Power": { "quote": "Know that all opulent, beautiful and glorious creations spring from but a spark of My splendor. (Bhagavad Gita 10.41)" },
"Divine Protection": { "quote": "Abandon all varieties of dharma and just surrender unto Me. I shall deliver you from all sinful reactions. (Bhagavad Gita 18.66)" },
"Divine Relationship": { "quote": "I am the father of this universe, the mother, the support and the grandsire. (Bhagavad Gita 9.17)" },
"Divine Activities": { "quote": "The transcendental pastimes of Bhagavan are eternal and full of supreme bliss. (Bhagavata Purana 10.33.36)" },
"Divine Names": { "quote": "The holy name of Bhagavan has all potencies and is non-different from Him. (Padma Purana)" },
"Divine Glory": { "quote": "Neither the hosts of demigods nor the great sages know My origin or opulences. (Bhagavad Gita 10.2)" },
"Divine Manifestation": { "quote": "Whenever and wherever there is a decline in dharma, I manifest Myself. (Bhagavad Gita 4.7)" },
"Divine Love": { "quote": "Pure love for Bhagavan is eternally established in the hearts of living entities. (Chaitanya Charitamrita, Madhya 22.107)" },
"Divine Service": { "quote": "Devotional service to Bhagavan is the only means to approach Him. (Bhagavata Purana 11.14.21)" },
"Divine Vision": { "quote": "One who sees Me everywhere and sees everything in Me is never separated from Me. (Bhagavad Gita 6.30)" },
"Divine Time": { "quote": "I am time, the great destroyer of the worlds. (Bhagavad Gita 11.32)" },
"Divine Will": { "quote": "By My will alone does nature bring forth all moving and unmoving beings. (Bhagavad Gita 9.10)" },
"Divine Reality": { "quote": "I am the basis of the impersonal Brahman, which is immortal, imperishable and eternal. (Bhagavad Gita 14.27)" },
"Divine Experience": { "quote": "When one sees Me in all beings and sees all beings in Me, I never leave him and he never leaves Me. (Bhagavad Gita 6.30)" },
"Divine Path": { "quote": "Fix your mind upon Me, become My devotee, worship Me, offer your homage unto Me, and you shall certainly come to Me. (Bhagavad Gita 18.65)" },
"Divine Liberation": { "quote": "One who knows the transcendental nature of My appearance and activities does not, upon leaving the body, take birth again. (Bhagavad Gita 4.9)" },
"Divine Universe": { "quote": "This entire cosmic manifestation is pervaded by Me in My unmanifest form. (Bhagavad Gita 9.4)" }
}
