{
"Nature of Brahman": { "quote": "\"Brahman is Truth, Knowledge, Infinity.\" (Taittiriya Upanishad 2.1.1)" },
"Ultimate Reality": { "quote": "\"All this is Brahman.\" (Chandogya Upanishad 3.14.1)" },
"Oneness": { "quote": "\"That thou art - Tat tvam asi.\" (Chandogya Upanishad 6.8.7)" },
"Transcendence": { "quote": "\"Brahman is beyond mind and speech.\" (Kena Upanishad 1.3)" },
"Immanence": { "quote": "\"The Self is everywhere, bright, bodiless, whole.\" (Isha Upanishad 8)" },
"Consciousness": { "quote": "\"Prajnanam Brahma - Consciousness is Brahman.\" (Aitareya Upanishad 3.1.3)" },
"Non-Duality": { "quote": "\"There is no diversity here at all.\" (Brihadaranyaka Upanishad 4.4.19)" },
"Self-Knowledge": { "quote": "\"By knowing Brahman one becomes Brahman.\" (Mundaka Upanishad 3.2.9)" },
"Attributes": { "quote": "\"Neither gross nor subtle, neither short nor long.\" (Brihadaranyaka Upanishad 3.8.8)" },
"Manifestation": { "quote": "\"From Brahman come all these beings.\" (Taittiriya Upanishad 3.1)" },
"Eternal Nature": { "quote": "\"Brahman is without beginning or end.\" (Bhagavad Gita 13.12)" },
"Universal Self": { "quote": "\"The Self in all beings and all beings in the Self.\" (Isha Upanishad 6)" },
"Pure Being": { "quote": "\"Sat-chit-ananda - Existence-Consciousness-Bliss.\" (Vivekachudamani 362)" },
"Unknowable": { "quote": "\"That from which words return along with the mind.\" (Taittiriya Upanishad 2.4.1)" },
"Omnipresence": { "quote": "\"Brahman fills all space like salt dissolved in water.\" (Chandogya Upanishad 6.13)" },
"Liberation": { "quote": "\"Knowledge of Brahman leads to immediate liberation.\" (Brahma Sutras 1.1.4)" },
"Unity": { "quote": "\"All this is verily Brahman.\" (Mandukya Upanishad 2)" },
"Beyond Attributes": { "quote": "\"Neither this nor that - neti neti.\" (Brihadaranyaka Upanishad 2.3.6)" },
"Supreme Goal": { "quote": "\"Knowing Brahman one attains the Supreme.\" (Taittiriya Upanishad 2.1)" },
"Cosmic Source": { "quote": "\"From which all beings are born.\" (Taittiriya Upanishad 3.1)" },
"Divine Ground": { "quote": "\"The foundation of all existence.\" (Chandogya Upanishad 6.2.1)" },
"Absolute Truth": { "quote": "\"The Real of the real.\" (Brihadaranyaka Upanishad 2.3.6)" },
"Inner Controller": { "quote": "\"The inner ruler immortal.\" (Brihadaranyaka Upanishad 3.7.3)" },
"Cosmic Intelligence": { "quote": "\"The intelligence of the intelligent.\" (Kena Upanishad 1.2)" },
"Divine Essence": { "quote": "\"The essence of all beings.\" (Bhagavad Gita 7.10)" },
"Supreme Reality": { "quote": "\"Higher than the highest.\" (Mundaka Upanishad 3.2.8)" },
"Infinite Being": { "quote": "\"Infinite is Brahman, infinite is Atman.\" (Brihadaranyaka Upanishad 5.1)" },
"Ultimate Purpose": { "quote": "\"The goal of all Vedanta.\" (Brahma Sutras 1.1.1)" },
"Divine Light": { "quote": "\"The light of all lights.\" (Bhagavad Gita 13.17)" },
"Eternal Truth": { "quote": "\"The unchanging among the changing.\" (Katha Upanishad 2.2.13)" }
}
