{
"Names of Buddha": { "quote": "Siddhartha Gautama, Shakyamuni, Tathagata - Thus Gone One, the Awakened One. (Dhammapada)" },
"Buddha Titles": { "quote": "\"The World-Honored One, The Perfectly Enlightened One, Teacher of Gods and Humans.\" (Pali Canon)" },
"Historical Buddha": { "quote": "\"I am not the first Buddha who came upon Earth, nor shall I be the last.\" (Sutra of Forty-Two Sections)" },
"Definitions": { "quote": "\"One who has awakened to the truth of existence.\" (Majjhima Nikaya)" },
"Buddhist Fundamentals": { "quote": "\"All conditioned things are impermanent, all phenomena are without self, Nirvana is peace.\" (Dhammapada 277-279)" },
"Buddha Nature": { "quote": "\"All beings possess Buddha nature.\" (Mahaparinirvana Sutra)" },
"Buddha Identity": { "quote": "\"He who sees the Dharma sees me; he who sees me sees the Dharma.\" (Vakkali Sutta)" },
"Buddha Person": { "quote": "\"I am a human being who found the path to enlightenment and showed it to others.\" (Attributed to Buddha)" },
"Buddha Aspects": { "quote": "\"The Three Bodies of Buddha: Dharmakaya, Sambhogakaya, Nirmanakaya.\" (Mahayana tradition)" },
"Buddha Attributes": { "quote": "\"The thirty-two major marks and eighty minor marks of a Great Being.\" (Lakkhana Sutta)" },
"Buddha Powers": { "quote": "\"The Ten Powers of a Buddha include knowledge of karma, meditation, and the path to liberation.\" (Mahavacchagotta Sutta)" },
"Buddha Process": { "quote": "\"Through countless births in the cycle of existence I ran, seeking but not finding the builder of this house.\" (Dhammapada 153)" },
"Buddha Teaching": { "quote": "\"I teach suffering, its origin, cessation and path.\" (Ariyapariyesana Sutta)" },
"Buddhist Forces": { "quote": "\"Mind is the forerunner of all states.\" (Dhammapada 1)" },
"Buddha's Nature": { "quote": "\"Neither born nor created, beyond existence and non-existence.\" (Heart Sutra)" },
"Final Liberation": { "quote": "\"This is my last birth. Now there is no more rebirth.\" (Mahaparinibbana Sutta)" },
"Buddhist Formations": { "quote": "\"All formations are impermanent, all formations are suffering, all phenomena are without self.\" (Dhammapada)" },
"Ultimate Reality": { "quote": "\"Form is emptiness, emptiness is form.\" (Heart Sutra)" },
"Buddhist Concepts": { "quote": "\"The Four Noble Truths and the Noble Eightfold Path.\" (First Sermon)" },
"Spiritual Relationship": { "quote": "\"Be a light unto yourselves.\" (Mahaparinibbana Sutta)" },
"Levels of Understanding": { "quote": "\"Gradual training, gradual practice, gradual progress.\" (Kitagiri Sutta)" },
"Buddhist Symbols": { "quote": "\"The Dharma Wheel represents the Noble Eightfold Path.\" (Buddhist tradition)" },
"Buddha Knowledge": { "quote": "\"Direct knowledge, self-awakening, and unbinding.\" (Anguttara Nikaya)" },
"Dharma Parts": { "quote": "\"The 84,000 doors of Dharma.\" (Mahayana tradition)" },
"Buddhist Practice": { "quote": "\"Cease to do evil, learn to do good, purify the mind.\" (Dhammapada 183)" },
"Buddha Properties": { "quote": "\"Wisdom and Compassion are the two wings of enlightenment.\" (Buddhist tradition)" },
"Buddha Representation": { "quote": "\"When you see the Buddha, kill the Buddha.\" (Zen koan)" },
"Buddha Manifestation": { "quote": "\"Wherever the Dharma exists, there the Buddha exists.\" (Lotus Sutra)" },
"Buddhist Practices": { "quote": "\"Meditation, morality, and wisdom are the path to enlightenment.\" (Noble Eightfold Path)" },
"Buddha Domains": { "quote": "\"All worlds in the ten directions.\" (Avatamsaka Sutra)" }
}
