
{
"Buddhism": {
"short_description": "A path of spiritual development and liberation founded by Siddhartha Gautama, teaching the understanding of reality, the nature of mind, and methods for ending suffering through direct insight and ethical conduct."
},
"Four Noble Truths": {
"short_description": "The fundamental teaching of Buddhism identifying the existence of suffering, its cause in craving and ignorance, the possibility of its cessation, and the path leading to its end through systematic practice."
},
"Noble Eightfold Path": {
"short_description": "The comprehensive system of practice leading to liberation, integrating wisdom (right view and intention), ethical conduct (right speech, action, livelihood), and mental development (right effort, mindfulness, concentration)."
},
"Dharma": {
"short_description": "The teachings of the Buddha and the ultimate truth they reveal, representing both the natural law of reality and the path of practice leading to its direct realization."
},
"Sangha": {
"short_description": "The spiritual community practicing the Buddha's teachings, particularly those who have attained direct realization, serving as support and guidance for practitioners."
},
"Sunyata": {
"short_description": "The profound truth of emptiness or voidness, revealing the lack of inherent existence in all phenomena while affirming their interdependent and dynamic nature."
},
"Bodhicitta": {
"short_description": "The awakened heart-mind that seeks enlightenment for the benefit of all beings, combining wisdom and compassion as the foundation of Mahayana practice."
},
"Karma": {
"short_description": "The natural law of cause and effect operating in all dimensions of existence, particularly through intentional actions and their results in shaping experience and reality."
},
"Samsara": {
"short_description": "The cycle of repeated existence driven by ignorance and karmic patterns, characterized by suffering and the continuous arising of conditioned experience."
},
"Nirvana": {
"short_description": "The ultimate state of liberation from suffering and its causes, characterized by the complete cessation of ignorance and craving, resulting in perfect peace and wisdom."
},
"Buddha Nature": {
"short_description": "The fundamental potential for awakening present in all beings, representing the pure and luminous nature of mind beneath temporary obscurations."
},
"Mindfulness": {
"short_description": "The practice of present-moment awareness with clear comprehension, developing direct insight into the nature of mind and phenomena through sustained attention."
},
"Meditation": {
"short_description": "Systematic methods for training the mind and developing insight, including practices for developing concentration, awareness, and direct realization of reality."
},
"Six Paramitas": {
"short_description": "The perfections practiced by bodhisattvas: generosity, ethics, patience, diligence, concentration, and wisdom, forming a complete path to enlightenment."
},
"Three Marks": {
"short_description": "The fundamental characteristics of conditioned existence: impermanence (anicca), suffering (dukkha), and non-self (anatta), understood through direct observation."
},
"Five Skandhas": {
"short_description": "The five aggregates comprising human experience: form, feeling, perception, mental formations, and consciousness, analyzed to understand the nature of self."
},
"Dependent Origination": {
"short_description": "The detailed analysis of how suffering arises through a chain of interdependent causes, revealing both the mechanism of bondage and the possibility of liberation."
},
"Two Truths": {
"short_description": "The fundamental distinction between conventional and ultimate truth, understanding both the practical functioning of reality and its deeper nature beyond conceptual elaboration."
},
"Three Vehicles": {
"short_description": "The major traditions of Buddhist practice: Hinayana focusing on individual liberation, Mahayana emphasizing universal enlightenment, and Vajrayana using transformative methods."
},
"Pure Land": {
"short_description": "Realms manifested by enlightened beings where conditions are perfect for spiritual practice, accessible through devotion and cultivation of mind."
},
"Zen": {
"short_description": "A tradition emphasizing direct experience of mind nature through meditation, spontaneous action, and transcendence of conceptual thinking."
},
"Tantra": {
"short_description": "Advanced methods using transformation of energy and consciousness, working with subtle body systems to accelerate the path to enlightenment."
},
"Dzogchen": {
"short_description": "The Great Perfection teaching pointing directly to the natural state of mind, emphasizing recognition and stabilization of primordial awareness."
},
"Mahamudra": {
"short_description": "The Great Seal teaching revealing the ultimate nature of mind through progressive stages of meditation and insight practice."
},
"Four Immeasurables": {
"short_description": "The cultivation of limitless loving-kindness, compassion, sympathetic joy, and equanimity toward all beings without distinction."
}
}
