{
"Collective Unconscious": { "quote": "The collective unconscious contains the whole spiritual heritage of mankind's evolution born anew in the brain structure of every individual. (The Structure of the Psyche, 1927)" },
"Archetypes": { "quote": "Archetypes are typical modes of apprehension, and wherever we meet with uniform and regularly recurring modes of apprehension, we are dealing with an archetype. (The Concept of the Collective Unconscious, 1936)" },
"Individuation": { "quote": "Individuation means becoming an individual, and, insofar as individuality embraces our innermost, last, and incomparable uniqueness, it also implies becoming one's own self. (The Relations Between the Ego and the Unconscious, 1928)" },
"Shadow": { "quote": "Everyone carries a shadow, and the less it is embodied in the individual's conscious life, the blacker and denser it is. (Psychology and Religion, 1938)" },
"Anima/Animus": { "quote": "The anima is the feminine aspect present in the collective unconscious of men, and the animus is the masculine aspect present in the collective unconscious of women. (The Syzygy: Anima and Animus, 1951)" },
"Synchronicity": { "quote": "Synchronicity: A meaningful coincidence of two or more events where something other than the probability of chance is involved. (Synchronicity: An Acausal Connecting Principle, 1952)" },
"Psychological Types": { "quote": "Every individual tends to understand everything in terms of his own type. (Psychological Types, 1921)" },
"Self": { "quote": "The self is not only the centre, but also the whole circumference which embraces both conscious and unconscious; it is the centre of this totality, just as the ego is the centre of consciousness. (Psychology and Alchemy, 1944)" },
"Dreams": { "quote": "Dreams are the direct expression of the unconscious psychic activity. (The Psychology of the Unconscious, 1912)" },
"Persona": { "quote": "The persona is that which in reality one is not, but which oneself as well as others think one is. (Two Essays on Analytical Psychology, 1928)" },
"Active Imagination": { "quote": "Active imagination is a method of assimilating unconscious contents through some form of self-expression. (The Transcendent Function, 1916)" },
"Complex": { "quote": "A complex is a collection of images and ideas, clustered around a core derived from one or more archetypes. (A Review of the Complex Theory, 1934)" },
"Psychic Energy": { "quote": "Psychic energy tends to flow where there is a gradient between two psychological states or potentials. (On Psychic Energy, 1928)" },
"Symbol Formation": { "quote": "A symbol is an image or representation which points to something essentially unknown. (Symbols of Transformation, 1912)" },
"Psychological Development": { "quote": "The first half of life is devoted to forming a healthy ego, the second half is going inward and letting go of it. (The Stages of Life, 1930)" },
"Mandala Symbolism": { "quote": "The mandala is an archetypal image of wholeness which appears in moments of psychic disorientation to compensate for a chaotic state. (Mandala Symbolism, 1950)" },
"Religious Experience": { "quote": "Religion is a defense against the experience of God. (Psychology and Religion, 1938)" },
"Alchemy": { "quote": "Alchemy is not concerned only with the making of gold, it represents the whole of the development of the personality in the psychic sphere. (Psychology and Alchemy, 1944)" },
"Psychological Transformation": { "quote": "Until you make the unconscious conscious, it will direct your life and you will call it fate. (Attributed to Jung)" },
"Mother Archetype": { "quote": "The mother archetype is the most important of all archetypes. In whatever form it appears, it always has a protective and nurturing quality. (Psychological Aspects of the Mother Archetype, 1938)" },
"Psychological Functions": { "quote": "The four functions of consciousness are thinking, feeling, sensation, and intuition. (Psychological Types, 1921)" },
"Projection": { "quote": "Projections change the world into the replica of one's own unknown face. (Aion, 1951)" },
"Analytical Psychology": { "quote": "The decisive question for man is: Is he related to something infinite or not? (Memories, Dreams, Reflections, 1962)" },
"Hero's Journey": { "quote": "The hero's journey is a symbol of the psychic process of individuation. (The Psychology of the Child Archetype, 1940)" },
"Psychotherapy": { "quote": "The meeting of two personalities is like the contact of two chemical substances: if there is any reaction, both are transformed. (Problems of Modern Psychotherapy, 1929)" },
"Extroversion/Introversion": { "quote": "Each person seems to be energized more by either the external world (extraversion) or the internal world (introversion). (Psychological Types, 1921)" },
"Collective Psychology": { "quote": "The collective unconscious appears to consist of mythological motifs or primordial images. (The Concept of the Collective Unconscious, 1936)" },
"Personal Growth": { "quote": "Who looks outside, dreams; who looks inside, awakes. (Attributed to Jung)" },
"Psychological Integration": { "quote": "There is no coming to consciousness without pain. (Memories, Dreams, Reflections, 1962)" },
"Modern Man": { "quote": "Modern man is in search of a soul. (Modern Man in Search of a Soul, 1933)" }
}
