{
"Artificial Intelligence: A Modern Approach": { "quote": "The intelligent agent paradigm: An agent is anything that can be viewed as perceiving its environment through sensors and acting upon that environment through actuators. (Russell & Norvig, 1995)" },
"Gödel, Escher, Bach: An Eternal Golden Braid": { "quote": "Consciousness and thinking emerge from patterns and strange loops within symbolic systems. (Hofstadter, 1979)" },
"The Society of Mind": { "quote": "What we call thinking is a society of specialized agents, none of which individually understands the whole. (Minsky, 1986)" },
"Perceptrons": { "quote": "Single-layer neural networks cannot compute certain functions, like XOR, establishing fundamental limitations of early neural networks. (Minsky & Papert, 1969)" },
"Principles of Artificial Intelligence": { "quote": "Problem-solving by search and representation forms the foundation of AI systems. (Nilsson, 1980)" },
"Pattern Recognition and Machine Learning": { "quote": "Bayesian probability theory provides a framework for understanding machine learning as inference under uncertainty. (Bishop, 2006)" },
"Machine Learning": { "quote": "A computer program is said to learn from experience E with respect to some task T and performance measure P, if its performance at task T, as measured by P, improves with experience E. (Mitchell, 1997)" },
"The Elements of Statistical Learning": { "quote": "Statistical learning provides a framework for understanding the complex patterns in high-dimensional data. (Hastie, Tibshirani & Friedman, 2001)" },
"Reinforcement Learning: An Introduction": { "quote": "Learning from interaction is a foundational idea underlying nearly all theories of learning and intelligence. (Sutton & Barto, 1998)" },
"Neural Networks for Pattern Recognition": { "quote": "Neural networks learn distributed representations where knowledge is encoded across many parameters rather than in explicit symbolic rules. (Bishop, 1995)" },
"Computers and Thought": { "quote": "The landmark collection demonstrating how computers can simulate cognitive processes and potentially achieve human-like intelligence. (Feigenbaum & Feldman, 1963)" },
"The Emotion Machine": { "quote": "Emotions are not separate from thinking but are different ways of thinking, activated for different problems. (Minsky, 2006)" },
"Paradigms of Artificial Intelligence Programming": { "quote": "Case studies in Common Lisp demonstrate classical AI techniques through practical implementation. (Norvig, 1991)" },
"Artificial Intelligence: The Very Idea": { "quote": "The philosophical foundations of AI rest on whether mind is fundamentally computational. (Haugeland, 1985)" },
"The Quest for Artificial Intelligence": { "quote": "The history of AI reflects humanity's enduring desire to understand and recreate intelligence. (Nilsson, 2009)" },
"Probabilistic Graphical Models": { "quote": "Complex domains require representing uncertainty and structure through interconnected random variables. (Koller & Friedman, 2009)" },
"The Emperor's New Mind": { "quote": "Human consciousness may rely on quantum mechanical effects that cannot be simulated computationally. (Penrose, 1989)" },
"Logical Foundations of Artificial Intelligence": { "quote": "Formal logic provides a language for representing knowledge and reasoning about the world. (Genesereth & Nilsson, 1987)" },
"Artificial Intelligence: The Basics": { "quote": "The essential tension in AI exists between symbolic approaches focusing on reasoning and connectionist approaches emphasizing learning. (Warwick, 2011)" },
"Introduction to Machine Learning": { "quote": "Machine learning algorithms automatically improve through experience without being explicitly programmed. (Alpaydin, 2004)" },
"Understanding Machine Learning": { "quote": "Learning is the process of converting experience into expertise or knowledge. (Shalev-Shwartz & Ben-David, 2014)" },
"Deep Learning": { "quote": "Representation learning discovers multiple levels of distributed representations, with higher levels representing more abstract concepts. (Goodfellow, Bengio & Courville, 2016)" },
"Foundations of Natural Language Processing": { "quote": "Language processing requires integration of symbolic, statistical, and neural approaches. (Manning & Schütze, 1999)" },
"Speech and Language Processing": { "quote": "Human language technology combines linguistic knowledge with statistical methods to process natural language. (Jurafsky & Martin, 2000)" },
"Artificial Intelligence Engines": { "quote": "The history of AI ideas can be understood as a series of technological frameworks for mimicking intelligence. (Marsland, 2020)" },
"Artificial Intelligence and Expert Systems": { "quote": "Knowledge-based systems encode human expertise to solve complex problems through symbolic reasoning. (Jackson, 1990)" },
"Introduction to Artificial Intelligence": { "quote": "The pursuit of AI reflects humanity's unique capacity to contemplate the nature of its own intelligence. (Charniak & McDermott, 1985)" },
"Artificial Intelligence: Structures and Strategies for Complex Problem Solving": { "quote": "AI requires balancing logical reasoning, statistical learning, and knowledge representation. (Luger, 1989)" },
"Minds, Brains and Programs": { "quote": "The Chinese Room thought experiment challenges whether programs can truly understand, rather than merely simulate understanding. (Searle, 1980)" },
"Computing Machinery and Intelligence": { "quote": "The Turing Test proposes that if a machine can exhibit conversational behavior indistinguishable from a human, it should be considered intelligent. (Turing, 1950)" }
}
