{
  "Classical Philosophy": { "quote": "Know thyself. (Socrates, Delphi Maxim)" },
  "Epic Poetry": { "quote": "Sing, O Muse, of the rage of Achilles. (Homer, *Iliad* 1.1)" },
  "Tragedy": { "quote": "Man is but a shadow of a dream. (Sophocles, *Ajax*)" },
  "Classical Democracy": { "quote": "Our constitution is called a democracy because power is in the hands of the many. (Pericles, *Funeral Oration*)" },
  "Hellenistic Science": { "quote": "Give me a lever long enough and a fulcrum, and I shall move the world. (Archimedes)" },
  "Roman Law": { "quote": "Justice is the constant and perpetual will to render to each their due. (Justinian, *Digest* 1.1.10)" },
  "Classical Architecture": { "quote": "Firmitas, Utilitas, Venustas — Strength, Utility, Beauty. (Vitruvius, *De Architectura*)" },
  "Stoicism": { "quote": "We suffer more in imagination than in reality. (Seneca, *Letters to Lucilius*)" },
  "Epicureanism": { "quote": "Pleasure is the absence of pain. (Epicurus, *Principal Doctrines*)" },
  "Classical Mathematics": { "quote": "There is no royal road to geometry. (Euclid, *Elements*)" },
  "Rhetoric": { "quote": "Speak so that we may see you. (Socrates, in Plato's *Phaedrus*)" },
  "Classical Sculpture": { "quote": "The sculptor must seek to express the soul in the posture of the body. (Phidias)" },
  "Mythology": { "quote": "Chaos was first of all, but then appeared Gaia, broad-breasted. (Hesiod, *Theogony*)" },
  "Classical Music": { "quote": "Music is the harmony of the cosmos. (Pythagoras on the Music of the Spheres)" },
  "Historical Writing": { "quote": "History is the teacher of life. (Cicero, *De Oratore*)" },
  "Classical Drama": { "quote": "The purpose of tragedy is to arouse pity and fear. (Aristotle, *Poetics* 1449b)" },
  "Astronomy": { "quote": "The cosmos is a sphere, with Earth at its center. (Ptolemy, *Almagest*)" },
  "Classical Ethics": { "quote": "Virtue is the mean between excess and deficiency. (Aristotle, *Nicomachean Ethics*)" },
  "Military Strategy": { "quote": "The supreme art of war is to subdue the enemy without fighting. (Sun Tzu, *Art of War*)" },
  "Classical Comedy": { "quote": "Whom the gods would destroy, they first make mad. (Euripides, *Bacchae*)" },
  "Platonic Idealism": { "quote": "The unexamined life is not worth living. (Plato, *Apology*)" },
  "Classical Cosmology": { "quote": "All things are full of gods. (Thales of Miletus)" },
  "Classical Linguistics": { "quote": "Letters are the signs of sounds. (Aristotle, *Poetics*)" },
  "Classical Education": { "quote": "The roots of education are bitter, but the fruit is sweet. (Aristotle)" },
  "Classical Logic": { "quote": "All men are mortal. Socrates is a man. Therefore, Socrates is mortal. (Aristotelian Syllogism)" },
  "Classical Politics": { "quote": "Man is by nature a political animal. (Aristotle, *Politics* 1253a)" },
  "Classical Medicine": { "quote": "Let food be thy medicine. (Hippocrates, *Regimen in Health*)" },
  "Classical Engineering": { "quote": "The aqueducts are Rome's greatest gift to the world. (Frontinus, *De Aquis*)" },
  "Classical Aesthetics": { "quote": "Beauty is truth, truth beauty. (Keats, inspired by Plato's *Symposium*)" },
  "Classical Legacy": { "quote": "We are all Greeks. Our laws, literature, religion, art have roots in Greece. (Shelley)" }
}
