{
"Hitboxes": { "quote": "Invisible collision areas that determine when attacks connect. Fighting games use precise hitboxes where a few pixels can determine if an attack lands or misses." },
"I-Frames": { "quote": "Brief periods of invulnerability during certain animations. Dark Souls dodge rolls provide momentary invincibility, rewarding precise timing." },
"Damage Types": { "quote": "Different categories of harm with various effects. Monster Hunter uses elemental damage types that exploit specific enemy weaknesses." },
"Critical Hits": { "quote": "Attacks that deal increased damage under certain conditions. Fallout's VATS system allows for targeted critical hits on specific body parts." },
"Combo Systems": { "quote": "Sequences of attacks that chain together. Devil May Cry rewards stylish combo variety with higher scores and resources." },
"Stagger/Hitstun": { "quote": "Temporary vulnerability after taking damage. Street Fighter uses hitstun to allow combo opportunities after landing certain attacks." },
"Stamina Management": { "quote": "Resource limiting action frequency. Sekiro's posture system creates a dance of offense and defense leading to devastating deathblows." },
"Blocking/Parrying": { "quote": "Defensive techniques to mitigate or counter attacks. The parry timing in Breath of the Wild creates a slow-motion opening for counterattack." },
"Dodge Mechanics": { "quote": "Evasive maneuvers to avoid damage. Bayonetta's Witch Time rewards perfect dodges with time dilation." },
"Stealth Attacks": { "quote": "Strikes with advantages when undetected. Assassin's Creed's hidden blade allows instant eliminations from concealment." },
"Attack Commitment": { "quote": "Inability to cancel attack animations once initiated. Monster Hunter's weapon attacks have significant commitment, requiring careful timing." },
"Crowd Control": { "quote": "Abilities that limit enemy movements or actions. Overwatch uses stuns, freezes, and knockbacks to disrupt enemy positioning." },
"Resource Management": { "quote": "Balancing limited supplies during combat. Resident Evil's scarce ammunition creates tension in every encounter." },
"Target Locking": { "quote": "Systems to maintain focus on specific enemies. The Z-targeting in Zelda revolutionized 3D combat by maintaining orientation toward enemies." },
"Animation Canceling": { "quote": "Techniques to interrupt recovery frames. League of Legends' auto-attack resets allow for rapid burst damage." },
"Status Effects": { "quote": "Temporary conditions affecting combat capabilities. Final Fantasy's status ailments like Poison, Silence, and Berserk add strategic depth." },
"Area of Effect": { "quote": "Attacks affecting multiple targets in a zone. Diablo's AoE spells allow efficient clearing of enemy groups." },
"Aggro Management": { "quote": "Systems controlling which player enemies target. MMORPGs like World of Warcraft use threat mechanics for tank/DPS/healer roles." },
"Projectile Systems": { "quote": "Ranged attacks with travel time and trajectory. Apex Legends accounts for bullet drop and travel time in long-range engagements." },
"Counter Mechanics": { "quote": "Abilities specifically designed to punish certain enemy actions. Mortal Kombat's breakers allow escape from combos at a resource cost." },
"Super Meters": { "quote": "Resources built through combat that enable powerful techniques. Street Fighter's EX and Super moves provide strategic comeback potential." },
"Weakness Exploitation": { "quote": "Targeting specific enemy vulnerabilities. Shadow of the Colossus requires finding and attacking specific points on each colossus." },
"Weapon Switching": { "quote": "Changing equipment during combat for different advantages. DOOM (2016) encourages frequent weapon swapping for specific enemy types." },
"Friendly Fire": { "quote": "Damage affecting allies and enemies alike. Left 4 Dead's friendly fire on higher difficulties requires careful shot placement." },
"Flinch Mechanics": { "quote": "Minor disruptions to actions when taking damage. Monster Hunter's flinch thresholds can interrupt powerful monster attacks." },
"Cooldown Systems": { "quote": "Time restrictions between ability uses. Overwatch balances powerful abilities with appropriate cooldown periods." },
"Attack Telegraphing": { "quote": "Visual cues signaling incoming attacks. Cuphead's boss animations clearly indicate attack patterns while maintaining challenge." },
"Damage Numbers": { "quote": "Visual feedback showing damage dealt. RPGs like Final Fantasy and Borderlands display numerical damage for player feedback." },
"Proc Effects": { "quote": "Random triggered bonuses on attacks. Diablo's chance-on-hit effects create exciting combat moments." },
"Combat Positioning": { "quote": "Strategic placement for advantage. Final Fantasy Tactics uses height, direction, and placement for attack bonuses." }
}
