{
"Emergence": { "quote": "The whole is greater than the sum of its parts. Complex collective behaviors arise from simple individual rules, as in how bird flocking emerges from three simple steering behaviors." },
"Self-Organization": { "quote": "Order emerges spontaneously from local interactions without centralized control. Termite colonies build elaborate structures without blueprints or leadership." },
"Non-linearity": { "quote": "Small changes can have disproportionately large effects. The butterfly effect illustrates how minute atmospheric variations can theoretically alter hurricane trajectories." },
"Feedback Loops": { "quote": "Systems modify their behavior based on past outcomes. Global warming creates positive feedback as melting ice reduces Earth's reflectivity, causing more warming." },
"Adaptation": { "quote": "Systems adjust to changing environments to maintain functionality. The immune system continuously evolves new responses to novel pathogens." },
"Attractors": { "quote": "States toward which systems tend to evolve. Strange attractors in weather systems create recognizable patterns while never exactly repeating." },
"Phase Transitions": { "quote": "Sudden qualitative changes in system behavior. Water molecules abruptly reorganize when transitioning from liquid to ice at 0°C." },
"Criticality": { "quote": "Systems operating at the boundary between order and chaos. The brain functions at a critical state that optimizes information processing and adaptability." },
"Power Laws": { "quote": "Scale-invariant mathematical relationships. The frequency and magnitude of earthquakes follow a power law distribution where doubling the energy decreases frequency by a constant factor." },
"Network Dynamics": { "quote": "Interactions and relationships between system components. Internet resilience emerges from its scale-free network structure that resists random node failures." },
"Fractal Patterns": { "quote": "Self-similarity across multiple scales. Coastlines maintain similar jaggedness whether viewed from space or up close." },
"Path Dependence": { "quote": "Historical events constrain future possibilities. QWERTY keyboard layout persists despite not being optimal for typing speed due to early typewriter mechanical limitations." },
"Distributed Control": { "quote": "Function emerges without central coordination. Traffic flow self-regulates through individual driver decisions without centralized direction." },
"Stigmergy": { "quote": "Indirect coordination through environmental modification. Ant trails form as individuals respond to pheromones deposited by others, creating efficient routing." },
"Information Processing": { "quote": "Systems encode, transmit, and respond to signals. Genetic regulatory networks process environmental information to trigger appropriate cellular responses." },
"Diversity and Heterogeneity": { "quote": "Varied components enhance system adaptability and resilience. Biodiversity in ecosystems ensures continued functioning despite environmental changes." },
"Modularity": { "quote": "Semi-independent subsystems with specialized functions. The brain's modular organization allows parallel processing while maintaining integration." },
"Robustness": { "quote": "Systems maintain function despite perturbations. The internet routes around damage, originally designed to survive nuclear attacks." },
"Cascading Failures": { "quote": "Local failures propagate throughout interconnected systems. Power grid blackouts can spread across continents as initial failures increase load on remaining components." },
"Bifurcations": { "quote": "Critical points where system behavior qualitatively changes. Population dynamics can shift from stable to chaotic when reproduction rates exceed critical thresholds." },
"Co-evolution": { "quote": "Systems evolve in response to each other. Predator-prey relationships drive mutual adaptation, creating evolutionary arms races." },
"Chaos Theory": { "quote": "Deterministic systems with sensitivity to initial conditions. Double pendulum motion appears random despite following deterministic physical laws." },
"Complexity-Stability Relationship": { "quote": "More complex systems may be more or less stable depending on their structure. Highly connected ecosystems become increasingly fragile beyond certain threshold points." },
"Time Delays": { "quote": "Lags between cause and effect create complex dynamics. Business cycles partially result from delayed reactions to market signals." },
"Bounded Rationality": { "quote": "Decisions under computational and information constraints. Human cognition uses heuristics rather than optimal calculations when navigating complex choices." },
"Scale Issues": { "quote": "Different rules operate at different system levels. Quantum mechanics governs subatomic particles while classical physics suffices for macroscopic objects." },
"Adaptive Capacity": { "quote": "Ability to maintain function through continuous adaptation. Human societies develop new technologies and institutions in response to changing conditions." },
"System Boundaries": { "quote": "Defining what's inside versus outside a system. Cellular membranes regulate material exchange while maintaining internal integrity." },
"Far-From-Equilibrium Dynamics": { "quote": "Systems maintained in active states through energy flow. Living organisms maintain order by continuously processing energy, countering entropy." },
"Collective Intelligence": { "quote": "Groups solving problems better than individuals. Market pricing emerges from distributed knowledge no single participant possesses completely." }
}
