
{
"Nature of Consciousness": { "quote": "Consciousness is that by which the world is revealed. (Yoga Sutras 1.4)" },
"Definitions": { "quote": "Consciousness is what allows the awareness of experience and knowledge. (David Chalmers, The Conscious Mind)" },
"Fundamental Properties": { "quote": "Consciousness is intrinsically unified and self-reflexive. (Edmund Husserl, Logical Investigations)" },
"States of Consciousness": { "quote": "There are four states: waking, dreaming, deep sleep, and pure consciousness. (Mandukya Upanishad)" },
"Scientific Perspectives": { "quote": "Consciousness emerges from the integrated information processing of the brain. (Giulio Tononi, Integrated Information Theory)" },
"Philosophical Views": { "quote": "Consciousness is what makes the mind-body problem really intractable. (Thomas Nagel, What Is It Like to Be a Bat?)" },
"Quantum Consciousness": { "quote": "Consciousness may be deeply connected to quantum processes in the brain. (Roger Penrose, The Emperor's New Mind)" },
"Self-Consciousness": { "quote": "The self is not consciousness; it is consciousness that makes the self possible. (Jean-Paul Sartre)" },
"Collective Consciousness": { "quote": "Individual consciousness is part of a greater universal consciousness. (Carl Jung, Collective Unconscious)" },
"Evolution of Consciousness": { "quote": "Consciousness evolves from simple awareness to self-reflective awareness. (Pierre Teilhard de Chardin)" },
"Neural Correlates": { "quote": "Specific patterns of brain activity correspond to conscious experiences. (Francis Crick, The Astonishing Hypothesis)" },
"Altered States": { "quote": "Different states of consciousness reveal different aspects of reality. (William James, Varieties of Religious Experience)" },
"Phenomenology": { "quote": "Consciousness is always consciousness of something. (Edmund Husserl)" },
"Hard Problem": { "quote": "Why should physical processing give rise to a rich inner life at all? (David Chalmers)" },
"Levels of Consciousness": { "quote": "Consciousness exists on a spectrum from basic awareness to meta-awareness. (Bernard Baars, Global Workspace Theory)" },
"Unity of Consciousness": { "quote": "All conscious experiences are unified in a single field of awareness. (Tim Bayne, The Unity of Consciousness)" },
"Consciousness and Time": { "quote": "Consciousness creates the appearance of continuous time. (Henri Bergson, Time and Free Will)" },
"Artificial Consciousness": { "quote": "Can machines be conscious? This remains one of the deepest questions in AI. (Daniel Dennett)" },
"Panpsychism": { "quote": "Consciousness may be a fundamental feature of physical reality. (David Skrbina, Panpsychism in the West)" },
"Meditation and Consciousness": { "quote": "Through meditation, one can observe the nature of consciousness itself. (Buddha)" },
"Social Consciousness": { "quote": "Individual consciousness is shaped by social interaction and culture. (Lev Vygotsky)" },
"Language and Consciousness": { "quote": "Language shapes conscious experience and thought. (Benjamin Lee Whorf)" },
"Free Will": { "quote": "Consciousness appears to give us free will, but this may be an illusion. (Sam Harris)" },
"Unconscious Processes": { "quote": "Most mental processes occur outside of consciousness. (Sigmund Freud)" },
"Higher Consciousness": { "quote": "Through spiritual practice, consciousness can expand beyond ordinary awareness. (Sri Aurobindo)" },
"Consciousness and Reality": { "quote": "Consciousness may be fundamental to the nature of reality itself. (Bernardo Kastrup)" },
"Future of Consciousness": { "quote": "Understanding consciousness may be key to understanding our place in the universe. (Max Tegmark)" },
"Consciousness Research": { "quote": "The scientific study of consciousness requires both objective and subjective methods. (Francisco Varela)" },
"Consciousness and Ethics": { "quote": "The existence of consciousness gives rise to moral consideration. (Peter Singer)" }
}
