{
"Idle Games": { "quote": "Click to generate resources, spend resources to automate and accelerate resource generation. (Cookie Clicker, Adventure Capitalist)" },
"Match-3 Puzzles": { "quote": "Match tiles, create special combinations, clear objectives. (Candy Crush, Bejeweled)" },
"Battle Royale": { "quote": "Drop, loot, fight, survive, repeat. Each match resets the progression cycle. (Fortnite, PUBG)" },
"Roguelikes": { "quote": "Fight enemies, collect power-ups, die, start over with persistent upgrades. (Hades, The Binding of Isaac)" },
"Farming Sims": { "quote": "Plant crops, tend to them, harvest, sell, buy better equipment, repeat. (Stardew Valley, Harvest Moon)" },
"First-Person Shooters": { "quote": "Engage enemies, manage resources (health/ammo), advance to new areas. (Doom, Half-Life)" },
"Competitive Multiplayer": { "quote": "Select character, compete in matches, improve skills, earn ranking. (Overwatch, League of Legends)" },
"Looter Shooters": { "quote": "Kill enemies, collect better gear, take on tougher challenges for even better gear. (Borderlands, Destiny)" },
"Fighting Games": { "quote": "Select character, learn combos, fight opponents, improve execution and strategy. (Street Fighter, Tekken)" },
"Survival Games": { "quote": "Gather resources, craft tools, build shelter, expand capabilities. (Minecraft, Don't Starve)" },
"RPGs": { "quote": "Accept quests, defeat enemies, gain experience, level up, improve equipment. (Elder Scrolls, Final Fantasy)" },
"Platformers": { "quote": "Navigate obstacles, collect items, reach checkpoints, advance to new levels. (Super Mario Bros., Celeste)" },
"Racing Games": { "quote": "Race opponents, earn rewards, upgrade vehicles, compete in more difficult races. (Forza Horizon, Need for Speed)" },
"Tower Defense": { "quote": "Build defenses, defeat waves of enemies, earn resources, upgrade defenses. (Plants vs. Zombies, Bloons TD)" },
"Collectible Card Games": { "quote": "Build deck, play cards strategically, win matches, collect new cards. (Hearthstone, Magic: The Gathering Arena)" },
"Metroidvanias": { "quote": "Explore, fight enemies, gain new abilities, use abilities to access new areas. (Hollow Knight, Metroid)" },
"Stealth Games": { "quote": "Observe patterns, create distractions, move unseen, accomplish objectives. (Metal Gear Solid, Hitman)" },
"City Builders": { "quote": "Place buildings, manage resources, fulfill population needs, expand city. (SimCity, Cities: Skylines)" },
"MOBAs": { "quote": "Select hero, defeat minions for gold, buy items, destroy enemy structures. (League of Legends, Dota 2)" },
"Social Deduction": { "quote": "Gather information, deduce roles, persuade others, complete objectives. (Among Us, Werewolf)" },
"Open World Adventures": { "quote": "Explore environment, complete marked activities, collect resources, unlock new areas. (Far Cry, Assassin's Creed)" },
"Rhythm Games": { "quote": "Follow on-screen prompts, time actions to music, build score multipliers, achieve high scores. (Guitar Hero, Beat Saber)" },
"Gacha Games": { "quote": "Complete missions, earn currency, summon characters, build teams, tackle harder content. (Genshin Impact, Fire Emblem Heroes)" },
"Souls-like": { "quote": "Fight challenging enemies, collect souls/currency, die and recover resources, learn patterns, overcome bosses. (Dark Souls, Bloodborne)" },
"4X Strategy": { "quote": "Explore map, expand territory, exploit resources, exterminate rivals. (Civilization, Stellaris)" },
"Multiplayer Crafting": { "quote": "Gather resources, craft items, build structures, defend from threats. (Rust, Valheim)" },
"Horror": { "quote": "Manage limited resources, avoid/confront threats, solve puzzles, progress narrative. (Resident Evil, Amnesia)" },
"Walking Simulators": { "quote": "Explore environment, discover narrative elements, piece together story. (Gone Home, Firewatch)" },
"Life Simulators": { "quote": "Create character, build skills, form relationships, pursue goals. (The Sims, Animal Crossing)" },
"Immersive Sims": { "quote": "Approach objectives, use interconnected systems creatively, experience consequences. (Deus Ex, Dishonored)" }
}
