{
"Core Loop": { "quote": "The fundamental repeated activity that drives moment-to-moment gameplay. In Tetris: receive piece, place piece, clear lines, repeat." },
"Compulsion Loop": { "quote": "A cycle of action and reward that drives continued engagement. Diablo's kill monsters, get loot, kill stronger monsters pattern creates addictive progression." },
"Engagement Loop": { "quote": "Action, feedback, and motivation cycle that sustains player interest. Call of Duty's shoot, kill, gain XP, unlock rewards sequence creates persistent engagement." },
"Retention Loop": { "quote": "Systems designed to encourage players to return regularly. Destiny 2's daily and weekly challenges, rotating content, and seasonal rewards schedule player engagement." },
"Progression Loop": { "quote": "The cycle of challenge, mastery, and advancement. Dark Souls' encounter difficult enemy, learn patterns, defeat enemy, gain souls, improve character loop creates satisfaction." },
"Skill Loop": { "quote": "The process of learning, practicing, and mastering game mechanics. Fighting games like Street Fighter center on training, execution, and improving technical proficiency." },
"Social Loop": { "quote": "Interactions that drive continued engagement with other players. Among Us creates cycles of social deduction, discussion, and repeated play with evolving group dynamics." },
"Narrative Loop": { "quote": "Story-based cycles that drive player curiosity and progression. Hades ties narrative development to repeated runs, revealing new story elements after each death." },
"Exploration Loop": { "quote": "Discovery-based cycles that reward curiosity. Subnautica's venture outward, find resources, build new equipment, venture further pattern drives continued exploration." },
"Collection Loop": { "quote": "The cycle of acquiring, organizing, and completing sets. Pokémon's catch, train, battle, catch more powerful Pokémon cycle has sustained the franchise for decades." },
"Competition Loop": { "quote": "Contest-based cycles that drive improvement and status. Multiplayer games like League of Legends use ranking systems and matchmaking to create cycles of competition." },
"Creation Loop": { "quote": "Building and sharing cycles that drive creative expression. Minecraft's gather resources, build structures, share with community, get inspired loop fuels creativity." },
"Fantasy Loop": { "quote": "Cycles that fulfill player power fantasies. Doom's aggressive combat loop reinforces the fantasy of being an unstoppable demon slayer." },
"Challenge Loop": { "quote": "Difficulty-based cycles that create satisfaction through overcoming obstacles. Celeste's precise platforming creates repeated cycles of challenge and achievement." },
"Risk-Reward Loop": { "quote": "Cycles that balance potential gain against potential loss. In roguelikes like The Binding of Isaac, players constantly weigh risk versus potential rewards." },
"Economy Loop": { "quote": "Resource acquisition and spending cycles. Clash of Clans' earn resources, build improvements, earn resources faster pattern drives progression." },
"Investment Loop": { "quote": "Cycles where player effort creates increased commitment. Animal Crossing's daily maintenance of your island creates a sense of investment and ownership." },
"Mastery Loop": { "quote": "The cycle of learning, improvement, and demonstration of skill. Rhythm games like Beat Saber create a clear path from novice to expert through practice." },
"Appointment Loop": { "quote": "Time-based cycles that encourage regular play sessions. Mobile games use daily rewards, limited resources that regenerate over time, and scheduled events." },
"Curiosity Loop": { "quote": "Mystery-driven cycles that leverage player inquisitiveness. Outer Wilds' loop of discovering clues that lead to new questions drives continued exploration." },
"Achievement Loop": { "quote": "Goal-completion cycles that provide satisfaction and recognition. Achievements and trophies create meta-goals beyond the main game objectives." },
"Optimization Loop": { "quote": "Cycles of system refinement and efficiency improvement. Factory building games like Satisfactory create loops of analyzing, redesigning, and optimizing production." },
"Session Loop": { "quote": "The structure of a single play session designed to feel complete yet encourage another. Clash Royale's short matches with rewards and upgrades between sessions creates a 'just one more' feeling." },
"Meta Loop": { "quote": "Higher-level cycles that connect across sessions or game modes. Fortnite's battle pass creates a meta progression that spans across individual matches." },
"Onboarding Loop": { "quote": "Early engagement cycles designed to teach and hook new players. Portal introduces mechanics one at a time, letting players master each before moving forward." },
"Difficulty Loop": { "quote": "Cycles of challenge adjustment based on player performance. Dynamic difficulty in Left 4 Dead adjusts enemy spawns based on how well the team is performing." },
"Feedback Loop": { "quote": "Cycles where outcomes affect future inputs. In strategy games like Civilization, early decisions create advantages or disadvantages that affect later gameplay." },
"Content Loop": { "quote": "Cycles of new material that refresh the experience. Live service games like Fortnite use regular content updates to maintain engagement over time." },
"Novelty Loop": { "quote": "Cycles that introduce new elements to maintain player interest. Roguelikes use procedural generation to ensure each run feels fresh and different." },
"Endgame Loop": { "quote": "Post-completion cycles that maintain engagement for experienced players. MMORPGs like World of Warcraft rely on endgame raids and gear acquisition to retain players." }
}
