{
"Resource Gathering": { "quote": "The collection of raw materials from the game world. Minecraft requires players to mine, chop, and harvest materials before crafting." },
"Recipe Discovery": { "quote": "How players learn to create new items. The Legend of Zelda: Tears of the Kingdom encourages experimentation to discover new combinations." },
"Crafting Interfaces": { "quote": "The UI systems for combining materials. Skyrim's crafting stations (forge, alchemy table, enchanting table) provide specialized interfaces for different crafting types." },
"Material Tiers": { "quote": "Progression of resource quality and rarity. Terraria advances from copper to iron to gold and eventually luminite and celestial materials." },
"Crafting Progression": { "quote": "How crafting abilities advance throughout the game. Monster Hunter World requires crafting basic items before unlocking more powerful gear through monster parts." },
"Component Systems": { "quote": "Using modular parts to customize crafted items. Path of Exile's skill gems and support gems create countless ability combinations." },
"Time Constraints": { "quote": "Production time as a design element. Animal Crossing: New Horizons implements real-time waiting periods for construction projects." },
"Quality Mechanics": { "quote": "Systems affecting the attributes of crafted items. Stardew Valley's quality levels for ingredients affect the potency of crafted products." },
"Risk/Reward Systems": { "quote": "Chance-based outcomes in crafting. Final Fantasy XIV's high-level crafting involves risk management with skills that increase quality but may fail the craft." },
"Specialization": { "quote": "Character skill development focused on crafting. World of Warcraft's profession system allows players to specialize in specific crafting disciplines." },
"Economic Integration": { "quote": "How crafting connects to the game's economy. EVE Online's player-driven economy relies on miners, manufacturers, and traders in an interdependent system." },
"Customization Depth": { "quote": "The degree of personalization available in crafted items. Fallout 4's weapon modification system allows for extensive customization of base weapons." },
"Resource Management": { "quote": "Strategic decisions about limited materials. Don't Starve requires balancing immediate needs against long-term resource sustainability." },
"Social Crafting": { "quote": "Collaborative or interdependent crafting systems. Star Wars Galaxies required multiple player professions to create the best items, encouraging cooperation." },
"Knowledge Systems": { "quote": "Meta-information required for effective crafting. Alchemy in Kingdom Come: Deliverance requires learning recipes through books, experimentation, and training." },
"Crafting Minigames": { "quote": "Interactive gameplay during the crafting process. Fishing minigames in many MMOs determine the quality of caught resources." },
"Location Requirements": { "quote": "Environmental factors affecting crafting. The Forest requires players to build workbenches to access more advanced crafting recipes." },
"Tool Progression": { "quote": "Equipment that enhances crafting abilities. Factorio progressively upgrades assembly machines to increase production speed and capabilities." },
"Repair Systems": { "quote": "Maintenance of crafted items over time. Valheim implements durability and repair mechanics requiring workbenches and resources." },
"Disassembly": { "quote": "Breaking down items into component parts. The Last of Us allows salvaging parts from found items to craft survival tools." },
"Batch Production": { "quote": "Creating multiple items simultaneously. Civilization VI's production queue system allows crafting multiple city improvements in sequence." },
"Automation": { "quote": "Systems that craft without constant player input. Satisfactory focuses on building automated production lines for resource processing." },
"Seasonal/Temporal Availability": { "quote": "Time-limited crafting opportunities. Red Dead Redemption 2 ties certain crafting materials to seasons and wildlife migration patterns." },
"Skill Checks": { "quote": "Success-based crafting requiring player ability. Kingdom Come: Deliverance's lockpicking minigame determines success in creating skeleton keys." },
"Crafting Byproducts": { "quote": "Secondary outputs from crafting processes. No Man's Sky produces byproducts during refining that can be used in other recipes." },
"Consumption Mechanics": { "quote": "How crafted items are used and depleted. Potions in The Witcher 3 provide temporary buffs and require regular renewal." },
"Experimentation": { "quote": "Trial-and-error discovery mechanics. Breath of the Wild's cooking system rewards unexpected ingredient combinations." },
"Chain Production": { "quote": "Multi-stage crafting requiring intermediate products. Factorio requires processing raw ore into plates, then into components, before creating final products." },
"Learning Curves": { "quote": "Complexity progression in crafting systems. Space Engineers begins with basic components before advancing to complex engineering constructs." },
"Documentation Systems": { "quote": "In-game references for crafting information. Subnautica's PDA records discovered blueprints and resource requirements." }
}
