{
"Table Structure": { "quote": "The logical organization of data into rows and columns, forming the foundation of relational databases. (CREATE TABLE users (id INT, name VARCHAR(255), email VARCHAR(255)))." },
"Primary Key": { "quote": "A column or set of columns that uniquely identifies each row in a table. (id INT PRIMARY KEY AUTO_INCREMENT)." },
"Foreign Key": { "quote": "A field that links to the primary key of another table, establishing relationships between tables. (user_id INT, FOREIGN KEY (user_id) REFERENCES users(id))." },
"Index": { "quote": "Database objects that improve the speed of data retrieval operations. (CREATE INDEX idx_lastname ON employees(last_name))." },
"Schema": { "quote": "The logical structure that defines how data is organized within a database. (CREATE SCHEMA inventory)." },
"Normalization": { "quote": "The process of organizing data to reduce redundancy and improve data integrity. (Decomposing tables to eliminate anomalies while preserving relationships)." },
"Denormalization": { "quote": "The process of adding redundant data to speed up complex queries. (Storing calculated values or duplicating data across tables for performance)." },
"Data Types": { "quote": "Specifications that define the kind of data stored in a table column. (INT, VARCHAR, DATETIME, BOOLEAN, DECIMAL, etc.)." },
"Constraints": { "quote": "Rules enforced on data columns to maintain accuracy and reliability. (NOT NULL, UNIQUE, CHECK, DEFAULT)." },
"Query": { "quote": "Requests for data or information from a database table or combination of tables. (SELECT column1, column2 FROM table WHERE condition)." },
"Join": { "quote": "Operations that combine rows from two or more tables based on related columns. (INNER JOIN, LEFT JOIN, RIGHT JOIN, FULL JOIN)." },
"View": { "quote": "Virtual tables based on the result of a SQL statement. (CREATE VIEW active_customers AS SELECT * FROM customers WHERE status = 'active')." },
"Stored Procedure": { "quote": "Prepared SQL code that can be reused. (CREATE PROCEDURE GetEmployees() BEGIN SELECT * FROM employees; END)." },
"Trigger": { "quote": "SQL code that automatically executes in response to certain events on a particular table. (CREATE TRIGGER after_insert AFTER INSERT ON orders FOR EACH ROW BEGIN INSERT INTO audit_log VALUES(...); END)." },
"Transaction": { "quote": "A sequence of operations performed as a single logical unit of work. (BEGIN TRANSACTION; SQL statements; COMMIT;)." },
"ACID Properties": { "quote": "Atomicity, Consistency, Isolation, and Durability - essential properties that guarantee reliable database transactions." },
"Partition": { "quote": "Division of large tables into smaller, more manageable pieces while maintaining a single logical table. (PARTITION BY RANGE (year))." },
"Clustering": { "quote": "Physical ordering of rows based on the cluster key to improve query performance. (CREATE TABLE employees CLUSTER ON (department_id))." },
"Entity-Relationship Model": { "quote": "A data modeling technique that graphically represents entities and their relationships in a database system." },
"Cardinality": { "quote": "The numerical relationship between rows of related tables (one-to-one, one-to-many, many-to-many)." },
"Data Dictionary": { "quote": "A centralized repository of information about data such as meaning, relationships, origin, and format." },
"Aggregate Functions": { "quote": "Functions that perform calculations on a set of values and return a single value. (COUNT(), SUM(), AVG(), MAX(), MIN())." },
"Query Optimization": { "quote": "The process of improving the performance of database queries. (Using indexes, rewriting queries, analyzing execution plans)." },
"Data Warehousing": { "quote": "Repository of integrated data from multiple sources designed for query and analysis rather than transaction processing." },
"Star Schema": { "quote": "A design pattern with a central fact table connected to multiple dimension tables for data warehousing." },
"Materialized View": { "quote": "A database object that contains the results of a query, stored physically rather than calculated on demand." },
"Sharding": { "quote": "Horizontal partitioning of data across multiple database instances to improve scalability." },
"Data Migration": { "quote": "The process of transferring data between storage systems, data formats, or database systems." },
"Database Replication": { "quote": "The process of copying data from one database to another to improve availability and reliability." },
"Time-Series Data": { "quote": "Data points collected and indexed in time order, often used for analyzing trends and patterns over time." }
}
