{
"Data Warehouse Definition": { "quote": "A central repository of integrated data from one or more disparate sources designed for query and analysis rather than transaction processing." },
"ETL Process": { "quote": "Extract, Transform, Load - The process of pulling data from source systems, cleaning and conforming it, and loading it into the data warehouse." },
"ELT Process": { "quote": "Extract, Load, Transform - Modern approach that leverages cloud computing power to load data before transformation, enabling greater flexibility." },
"Dimensional Modeling": { "quote": "Design technique using fact and dimension tables to represent business processes in a query-friendly way optimized for data retrieval." },
"Star Schema": { "quote": "A dimensional model with a central fact table connected to multiple dimension tables, resembling a star pattern." },
"Snowflake Schema": { "quote": "An extension of star schema where dimension tables are normalized into multiple related tables, resembling a snowflake pattern." },
"Fact Table": { "quote": "Central table in dimensional modeling containing business measurements, metrics, and foreign keys to dimension tables." },
"Dimension Table": { "quote": "Contains descriptive attributes used for filtering, grouping, and labeling in analysis and reporting." },
"Slowly Changing Dimensions": { "quote": "Techniques for handling dimension attributes that change over time while preserving historical values." },
"Data Mart": { "quote": "A subset of a data warehouse focused on a specific business line or department." },
"OLAP": { "quote": "Online Analytical Processing - Technology that enables multidimensional analysis of data through operations like drill-down, roll-up, and slice-and-dice." },
"OLTP": { "quote": "Online Transaction Processing - Systems optimized for recording business transactions rather than analysis." },
"Data Lake": { "quote": "A storage repository that holds a vast amount of raw data in its native format until needed, complementing traditional data warehouses." },
"Data Vault": { "quote": "A modeling methodology designed for long-term historical storage of data from multiple operational systems, focusing on auditability and adaptability." },
"Kimball Methodology": { "quote": "Bottom-up approach to data warehouse design focused on delivering business value through dimensional modeling and incremental data marts." },
"Inmon Methodology": { "quote": "Top-down approach advocating for a centralized enterprise data warehouse with normalized data that feeds departmental data marts." },
"MPP Architecture": { "quote": "Massively Parallel Processing - Design that distributes processing across many nodes to enable high-performance querying of large datasets." },
"Columnar Storage": { "quote": "Data organization that stores table columns rather than rows together, optimized for analytical queries that access specific columns." },
"Partitioning": { "quote": "Dividing large tables into smaller, more manageable pieces based on logical divisions like date ranges to improve query performance." },
"Data Lineage": { "quote": "Documentation of data's origins, transformations, and movement through systems, crucial for compliance and troubleshooting." },
"Data Governance": { "quote": "Framework for managing data availability, usability, integrity, and security throughout the data lifecycle." },
"Data Quality": { "quote": "Measures and processes to ensure data is accurate, complete, reliable, and relevant for its intended use." },
"Business Intelligence": { "quote": "Technologies and practices for transforming raw data into meaningful information for business analysis and decision making." },
"Data Modeling": { "quote": "Process of creating a visual representation of data structures and relationships to support business requirements." },
"Data Integration": { "quote": "Combining data from different sources to provide a unified view for analysis and reporting." },
"Metadata Management": { "quote": "Processes and technologies to ensure information about data sources, transformations, and definitions is maintained and accessible." },
"Query Performance": { "quote": "Optimization techniques including indexing, materialized views, and query tuning to improve data retrieval speed." },
"Data Pipeline": { "quote": "Series of processing steps that move data from source systems to the data warehouse, often automated and scheduled." },
"Real-time Data Warehousing": { "quote": "Capabilities that reduce latency between transaction processing and analytical availability, approaching near real-time insights." },
"Self-service Analytics": { "quote": "Tools and platforms that enable business users to access and analyze data without requiring technical assistance." }
}
