{
"Relational Databases": { "quote": "Structured data in tables with relationships: MySQL, PostgreSQL, Oracle, SQL Server. ACID compliant with SQL querying." },
"NoSQL Databases": { "quote": "Non-relational databases: MongoDB (Document), Cassandra (Column), Neo4j (Graph), Redis (Key-Value)." },
"File Systems": { "quote": "Direct file storage: Local disks, Network File Systems (NFS), Distributed File Systems (HDFS)." },
"APIs": { "quote": "Web Services: REST APIs, GraphQL, SOAP, WebSocket for real-time data streaming." },
"Streaming Data": { "quote": "Real-time data flows: Apache Kafka, Amazon Kinesis, RabbitMQ, Apache Pulsar." },
"Data Warehouses": { "quote": "Enterprise storage: Snowflake, Amazon Redshift, Google BigQuery, Teradata." },
"Data Lakes": { "quote": "Raw data storage: Amazon S3, Azure Data Lake, Google Cloud Storage." },
"Time Series Databases": { "quote": "Temporal data: InfluxDB, TimescaleDB, Prometheus for metrics and monitoring." },
"Search Engines": { "quote": "Text and analytics: Elasticsearch, Solr, Algolia for full-text search and analytics." },
"Cache Systems": { "quote": "Fast access storage: Redis, Memcached, Hazelcast for performance optimization." },
"Message Queues": { "quote": "Asynchronous communication: RabbitMQ, Apache ActiveMQ, Amazon SQS." },
"Blockchain": { "quote": "Distributed ledgers: Ethereum, Hyperledger, Bitcoin networks for immutable records." },
"Cloud Storage": { "quote": "Remote storage services: AWS S3, Google Cloud Storage, Azure Blob Storage." },
"Document Stores": { "quote": "Semi-structured data: MongoDB, Couchbase, Amazon DocumentDB." },
"Graph Databases": { "quote": "Relationship-focused: Neo4j, Amazon Neptune, ArangoDB for connected data." },
"Columnar Stores": { "quote": "Column-oriented: Apache Cassandra, Apache HBase, Amazon Redshift." },
"Vector Databases": { "quote": "Similarity search: Milvus, Pinecone, Weaviate for ML embeddings." },
"In-Memory Databases": { "quote": "RAM-based storage: Redis, Apache Ignite, Memcached for speed." },
"Data Marts": { "quote": "Subject-specific: Departmental databases, specialized analytical stores." },
"Flat Files": { "quote": "Simple storage: CSV, JSON, XML, Parquet, ORC file formats." },
"Web Scraping": { "quote": "Internet data: HTML parsing, web crawlers, browser automation tools." },
"IoT Devices": { "quote": "Sensor data: MQTT protocols, IoT hubs, edge computing devices." },
"Event Stores": { "quote": "Event sourcing: EventStoreDB, Apache Kafka for event logging." },
"Data Feeds": { "quote": "Continuous updates: RSS feeds, news APIs, social media streams." },
"Legacy Systems": { "quote": "Historical sources: Mainframes, COBOL databases, older file formats." },
"Open Data": { "quote": "Public datasets: Government portals, research repositories, public APIs." },
"Spatial Databases": { "quote": "Geographic data: PostGIS, MongoDB Geospatial, Oracle Spatial." },
"Multi-Model Databases": { "quote": "Multiple paradigms: ArangoDB, MarkLogic, OrientDB." },
"Data Services": { "quote": "Third-party providers: Weather services, financial data, market feeds." },
"Archive Systems": { "quote": "Long-term storage: Tape drives, cold storage, compliance archives." }
}
