{
"Structured Data": { "quote": "Organized in rows and columns: SQL databases, CSV files, Excel spreadsheets." },
"Unstructured Data": { "quote": "No predefined format: text documents, images, audio files, social media posts." },
"Semi-structured Data": { "quote": "Partial organization: JSON, XML, email messages, log files." },
"Time Series Data": { "quote": "Sequential data points over time: stock prices, weather measurements, sensor readings." },
"Categorical Data": { "quote": "Discrete categories or labels: gender, color, product types, ratings." },
"Numerical Data": { "quote": "Quantitative values: age, income, temperature, measurements." },
"Binary Data": { "quote": "Two possible values: true/false, yes/no, 0/1, success/failure." },
"Text Corpus": { "quote": "Collection of text documents: articles, books, tweets, reviews." },
"Image Dataset": { "quote": "Collection of images: photographs, medical images, satellite imagery." },
"Audio Dataset": { "quote": "Sound recordings: speech, music, environmental sounds." },
"Video Dataset": { "quote": "Moving images with time: surveillance footage, movie clips, sports recordings." },
"Graph Data": { "quote": "Nodes and edges: social networks, knowledge graphs, citation networks." },
"Geospatial Data": { "quote": "Location-based information: GPS coordinates, maps, GIS data." },
"Panel Data": { "quote": "Multi-dimensional data over time: economic indicators, population studies." },
"Cross-sectional Data": { "quote": "Observations at single point in time: surveys, census data." },
"Longitudinal Data": { "quote": "Same sample observed over time: medical studies, growth measurements." },
"Training Dataset": { "quote": "Data used to train models: labeled examples for supervised learning." },
"Validation Dataset": { "quote": "Data for model tuning: prevent overfitting, parameter selection." },
"Test Dataset": { "quote": "Data for final evaluation: assess model performance on unseen data." },
"Balanced Dataset": { "quote": "Equal representation of classes: uniform distribution of categories." },
"Imbalanced Dataset": { "quote": "Unequal class distribution: rare events, anomaly detection." },
"Sparse Dataset": { "quote": "Many missing or zero values: user-item ratings, document-term matrices." },
"Dense Dataset": { "quote": "Few missing values: complete observations, full matrices." },
"Streaming Data": { "quote": "Continuous flow of data: IoT sensors, social media feeds, stock tickers." },
"Batch Data": { "quote": "Processed in groups: daily logs, weekly reports, monthly updates." },
"Labeled Data": { "quote": "Contains target variables: supervised learning inputs with known outputs." },
"Unlabeled Data": { "quote": "No target variables: clustering inputs, pattern discovery." },
"Synthetic Data": { "quote": "Artificially generated: simulations, augmented data, generated samples." },
"Raw Data": { "quote": "Unprocessed original data: direct measurements, unclean observations." },
"Cleaned Data": { "quote": "Preprocessed and validated: removed errors, handled missing values." }
}
