{
"Data Warehouse": { "quote": "A centralized repository that stores integrated data from multiple sources to support business intelligence activities." },
"ETL Process": { "quote": "Extract, Transform, Load: The process of extracting data from source systems, transforming it to fit business needs, and loading it into the data warehouse." },
"ELT Process": { "quote": "Extract, Load, Transform: A modern approach where data is extracted, loaded into the target system, and then transformed using the target system's processing power." },
"Dimensional Modeling": { "quote": "A data structure technique optimized for data warehouse queries, consisting of fact tables and dimension tables." },
"Star Schema": { "quote": "A dimensional model where a central fact table connects to multiple dimension tables, resembling a star pattern." },
"Snowflake Schema": { "quote": "An extension of the star schema where dimension tables are normalized into multiple related tables, creating a snowflake pattern." },
"Fact Table": { "quote": "The central table in dimensional modeling that contains business measurements, metrics, and foreign keys to dimension tables." },
"Dimension Table": { "quote": "A table that contains descriptive attributes used to analyze the numeric data in fact tables." },
"Slowly Changing Dimensions": { "quote": "Dimensions that change over time, requiring strategies to track historical changes (Type 1, Type 2, Type 3)." },
"OLAP": { "quote": "Online Analytical Processing: Technology that enables complex analysis of data across multiple dimensions for decision making." },
"OLTP": { "quote": "Online Transaction Processing: Systems designed to manage transaction-oriented applications with emphasis on fast query processing." },
"Data Mart": { "quote": "A subset of a data warehouse focused on a specific business line or department." },
"Data Lake": { "quote": "A storage repository that holds a vast amount of raw data in its native format until needed." },
"Data Lakehouse": { "quote": "An architecture that combines elements of data lakes and data warehouses, providing structure and governance to raw data." },
"Kimball Methodology": { "quote": "A bottom-up approach to data warehouse design focused on delivering business value through dimensional modeling." },
"Inmon Methodology": { "quote": "A top-down approach to data warehouse design emphasizing a centralized repository with normalized data models." },
"Data Vault": { "quote": "A modeling methodology designed for enterprise data warehouses, focusing on adaptability, auditability, and scalability." },
"Business Intelligence": { "quote": "Technologies, applications, and practices for collecting, integrating, analyzing, and presenting business information." },
"Metadata": { "quote": "Data that provides information about other data, critical for understanding and managing data warehouse content." },
"Data Quality": { "quote": "The measure of data's fitness to serve its purpose in a given context, considering accuracy, completeness, consistency, and timeliness." },
"Data Governance": { "quote": "The overall management of data availability, usability, integrity, and security in enterprise systems." },
"Data Lineage": { "quote": "The data life cycle that traces data's origins, movements, transformations, and impacts across the system." },
"MPP Architecture": { "quote": "Massively Parallel Processing: An architecture where many processors work on different parts of the same task simultaneously." },
"Columnar Storage": { "quote": "A database architecture that stores data by column rather than by row, optimizing analytical query performance." },
"Data Mining": { "quote": "The process of discovering patterns and knowledge from large amounts of data." },
"Aggregation": { "quote": "The process of summarizing data (sum, average, count) to provide high-level insights and improve query performance." },
"Partition": { "quote": "A division of a database table into distinct independent parts to improve manageability and performance." },
"Materialized View": { "quote": "A database object containing the results of a query, providing pre-computed results for complex joins and aggregations." },
"Data Pipeline": { "quote": "A series of data processing steps that move and transform data from various sources to target systems." },
"Master Data Management": { "quote": "A method of enabling an organization to link all critical data to a common point of reference." }
}
