{
"Title": { "quote": "The name given to a resource. 'The Great Gatsby' identifies F. Scott Fitzgerald's novel." },
"Creator": { "quote": "The entity primarily responsible for making the resource. Leonardo da Vinci created 'Mona Lisa'." },
"Subject": { "quote": "The topic of the resource. Library of Congress Subject Headings provide controlled vocabulary for consistent resource description." },
"Description": { "quote": "An account of the resource. An abstract summarizes the key points of a scholarly article." },
"Publisher": { "quote": "The entity responsible for making the resource available. Penguin Random House publishes and distributes books to readers." },
"Contributor": { "quote": "An entity responsible for making contributions to the resource. Editors, translators, and illustrators who enhance the primary work." },
"Date": { "quote": "A point or period of time associated with the resource. ISO 8601 format (YYYY-MM-DD) provides standardized representation of dates." },
"Type": { "quote": "The nature or genre of the resource. DCMI Type Vocabulary includes collection, dataset, event, image, interactive resource, etc." },
"Format": { "quote": "The file format, physical medium, or dimensions. MIME types identify digital formats (application/pdf, image/jpeg)." },
"Identifier": { "quote": "An unambiguous reference to the resource. ISBN-13 uniquely identifies books internationally." },
"Source": { "quote": "A related resource from which the described resource is derived. A digitized image references its original painting." },
"Language": { "quote": "The language of the resource. ISO 639-2 three-letter codes (eng, fra, deu) identify languages consistently." },
"Relation": { "quote": "A related resource. 'IsPartOf' indicates a chapter's relationship to a book." },
"Coverage": { "quote": "The spatial or temporal topic of the resource. Geographical coordinates precisely define the location a photograph depicts." },
"Rights": { "quote": "Information about rights held in and over the resource. Creative Commons licenses specify how content may be used and shared." },
"Abstract": { "quote": "A summary of the content. Journal abstracts condense research findings to aid discoverability." },
"Access Rights": { "quote": "Information about who can access the resource. Archival collections may have embargoes or restricted materials." },
"Accrual Method": { "quote": "How items are added to a collection. Repositories acquire materials through donation, purchase, or deposit." },
"Audience": { "quote": "The class of entity for whom the resource is intended. Children's books target specific age ranges and reading levels." },
"Provenance": { "quote": "A statement of changes in ownership and custody. Art museum records document an artifact's chain of ownership." },
"Classification": { "quote": "A designation applied according to a formal system. Dewey Decimal Classification groups library materials by subject." },
"Location": { "quote": "Where the resource is held. Call numbers direct users to physical items on library shelves." },
"Citation": { "quote": "A bibliographic reference for the resource. APA, MLA, and Chicago styles provide formats for academic citations." },
"Edition": { "quote": "A particular version of a resource. The 'Second Edition, Revised' indicates significant updates to a textbook." },
"Table of Contents": { "quote": "A list of subunits of the resource. Chapter listings help users navigate to specific content." },
"Bibliography": { "quote": "Resources used in preparing the content. Works cited pages document sources of information." },
"Temporal Coverage": { "quote": "The time period covered by the content. A history textbook covering 'Ancient Rome, 753 BCE-476 CE'." },
"Geographic Coverage": { "quote": "The geographical area covered by the content. A map of the 'Mediterranean Region' defines its spatial scope." },
"Technical Requirements": { "quote": "System requirements for using the resource. Software compatibility and hardware specifications for digital resources." },
"Dublin Core": { "quote": "A metadata standard with 15 core elements for resource description. Widely used for cross-domain information resources." }
}
