{
"Design Thinking": { "quote": "A non-linear, iterative process that teams use to understand users, challenge assumptions, redefine problems and create innovative solutions. (Stanford d.school)" },
"User-Centered Design": { "quote": "An iterative design process in which designers focus on the users and their needs in each phase of the design process. (Don Norman)" },
"Visual Design": { "quote": "The use of imagery, color, shapes, typography, and form to enhance usability and improve the user experience. (Paul Rand's IBM logo exemplifies simplicity and memorability)" },
"Industrial Design": { "quote": "The professional practice of designing products used by millions of people worldwide, such as automobiles, home appliances, and mobile devices. (Dieter Rams' Braun products)" },
"Graphic Design": { "quote": "The craft of creating visual content to communicate messages through typography, imagery, color and form. (Milton Glaser's 'I ♥ NY' logo)" },
"Interaction Design": { "quote": "The design of interactive digital products, environments, systems, and services focusing on meaningful communication of behavior. (Bill Moggridge)" },
"Service Design": { "quote": "The activity of planning and organizing people, infrastructure, communication and material components of a service to improve its quality. (IDEO's redesign of patient experience in healthcare)" },
"Experience Design": { "quote": "The practice of designing products, processes, services, events, and environments with a focus on the quality of the user experience. (Disney's immersive theme parks)" },
"Information Design": { "quote": "The practice of presenting information in a way that fosters efficient and effective understanding. (Edward Tufte's data visualization principles)" },
"Design Elements": { "quote": "The basic units of any visual design that form its structure and convey visual messages: line, shape, color, texture, space, form, value. (Kandinsky's compositions)" },
"Design Principles": { "quote": "Guidelines that designers use to create effective, aesthetically pleasing, and functional compositions: balance, contrast, emphasis, proportion, harmony, movement, pattern, unity, variety. (Swiss design movement)" },
"Minimalism": { "quote": "A design philosophy that emphasizes simplicity and the removal of superfluous elements. 'Less is more.' (Ludwig Mies van der Rohe)" },
"Form Follows Function": { "quote": "The principle that the shape of an object should primarily relate to its intended function or purpose. (Louis Sullivan)" },
"Gestalt Principles": { "quote": "Psychological principles of visual perception that describe how humans naturally organize visual elements into groups or unified wholes: proximity, similarity, continuity, closure, figure/ground. (Max Wertheimer)" },
"Typography": { "quote": "The art and technique of arranging type to make written language legible, readable, and appealing when displayed. (Jan Tschichold's 'Die Neue Typographie')" },
"Color Theory": { "quote": "The practical guidance to color mixing and the visual effects of specific color combinations. (Josef Albers' 'Interaction of Color')" },
"Grid Systems": { "quote": "A structure made up of a series of intersecting straight or curved lines used to organize content in a layout. (Josef Müller-Brockmann)" },
"Design Systems": { "quote": "A collection of reusable components, guided by clear standards, that can be assembled to build any number of applications. (Google's Material Design)" },
"Responsive Design": { "quote": "An approach to web design that makes web pages render well on a variety of devices and window or screen sizes. (Ethan Marcotte)" },
"Accessible Design": { "quote": "Design that ensures interfaces can be accessed by everyone, including people with disabilities. (Web Content Accessibility Guidelines)" },
"Sustainable Design": { "quote": "The philosophy of designing physical objects, the built environment, and services to comply with principles of economic, social, and ecological sustainability. (Cradle to Cradle approach by McDonough & Braungart)" },
"Emotional Design": { "quote": "Creating designs that evoke emotions which lead to positive user experiences. (Don Norman's three levels of design: visceral, behavioral, reflective)" },
"Biophilic Design": { "quote": "Incorporating natural elements and patterns into design to increase human connectivity to the natural environment. (Frank Lloyd Wright's Fallingwater)" },
"Inclusive Design": { "quote": "Design that considers the full range of human diversity with respect to ability, language, culture, gender, age and other forms of human difference. (Microsoft's inclusive design toolkit)" },
"Design Ethics": { "quote": "The moral principles that guide the creation of products and systems, considering their impact on users and society. (Mike Monteiro's 'Designer's Code of Ethics')" },
"Design Research": { "quote": "The systematic inquiry that provides information to guide design decisions throughout the process from planning to final product. (IDEO's human-centered research methods)" },
"Iterative Design": { "quote": "A methodology based on a cyclic process of prototyping, testing, analyzing, and refining. (Agile development methodology)" },
"Co-design": { "quote": "A collaborative design approach that actively involves all stakeholders in the design process. (Participatory design methods from Scandinavia)" },
"Design Critique": { "quote": "A form of analysis where design work is presented, examined, and constructive feedback is provided. (Jared Spool's critique techniques)" },
"Design Patterns": { "quote": "Reusable solutions to commonly occurring problems within a given context in design. (Christopher Alexander's 'A Pattern Language')" }
}
