{
"Design Thinking Process": { "quote": "A non-linear, iterative approach to problem-solving that focuses on human needs and experiences. (Stanford d.school, IDEO)" },
"Empathize": { "quote": "Deeply understand users through observation, engagement, and immersion in their experiences. 'To create meaningful innovations, you need to know your users and care about their lives.' (IDEO)" },
"Define": { "quote": "Synthesize observations to frame the right problem. 'A problem well-stated is a problem half-solved.' (Charles Kettering)" },
"Ideate": { "quote": "Generate a range of creative solutions without judgment. 'The best way to have a good idea is to have lots of ideas.' (Linus Pauling)" },
"Prototype": { "quote": "Build representations of potential solutions to explore possibilities. 'If a picture is worth a thousand words, a prototype is worth a thousand meetings.' (IDEO)" },
"Test": { "quote": "Gather feedback from users to refine solutions. 'Fail early to succeed sooner.' (David Kelley)" },
"Human-Centered Design": { "quote": "Putting people at the center of the design process to create solutions that resonate with their needs, desires, and contexts. (Don Norman)" },
"Convergent Thinking": { "quote": "Narrowing down options and focusing on viable solutions. 'Part of being creative is knowing when to converge on a viable solution.' (Tim Brown)" },
"Divergent Thinking": { "quote": "Exploring many possible solutions before narrowing down. 'Thinking outside the box might be facilitated by having a glimpse of the world outside the box.' (Edward de Bono)" },
"Wicked Problems": { "quote": "Complex challenges with incomplete, contradictory, and changing requirements. 'Some problems are so complex that you have to be highly intelligent and well-informed just to be undecided about them.' (Laurence J. Peter)" },
"Collaborative Design": { "quote": "Leveraging diverse perspectives for richer solutions. 'None of us is as smart as all of us.' (Ken Blanchard)" },
"Rapid Prototyping": { "quote": "Creating quick, rough versions to test concepts early. 'The goal is not to be perfect right away, but to be better today than yesterday.' (Simon Sinek)" },
"User Feedback": { "quote": "Continuous integration of user responses to refine designs. 'The customer's perception is your reality.' (Kate Zabriskie)" },
"Bias Toward Action": { "quote": "Prioritizing doing over thinking to learn through experience. 'You can't think your way into a new way of acting, but you can act your way into a new way of thinking.' (Jerry Sternin)" },
"Iteration": { "quote": "Continuous cycles of refinement based on feedback. 'Iterative design is based on a cycle of prototyping, testing, analyzing, and refining.' (Jakob Nielsen)" },
"Design Constraints": { "quote": "Limitations that shape solutions and foster creativity. 'Man built most nobly when limitations were at their greatest.' (Frank Lloyd Wright)" },
"Radical Collaboration": { "quote": "Bringing together diverse disciplines and perspectives. 'Innovation happens at the intersection of disciplines, not within them.' (Frans Johansson)" },
"Visual Thinking": { "quote": "Using drawings, diagrams, and models to explore and communicate ideas. 'The purpose of visualization is insight, not pictures.' (Ben Shneiderman)" },
"Journey Mapping": { "quote": "Visualizing the entire experience a user has with a product or service over time. 'Great design is treating all touchpoints with the same passion and attention to detail.' (Stanley Hainsworth)" },
"Personas": { "quote": "Fictional characters created to represent different user types. 'Personas are a proxy for the real customers and users that clarify who we're designing for.' (Alan Cooper)" },
"Design Sprints": { "quote": "Time-constrained process to rapidly resolve challenges. 'Give me six hours to chop down a tree and I will spend the first four sharpening the axe.' (Abraham Lincoln)" },
"Problem Framing": { "quote": "Defining the right problem to solve is often more important than the solution itself. 'If I had an hour to solve a problem, I'd spend 55 minutes thinking about the problem and 5 minutes thinking about solutions.' (Albert Einstein)" },
"Empathy Maps": { "quote": "Visual tools to capture knowledge about users' behaviors and attitudes. 'Empathy is at the heart of design. Without the understanding of what others see, feel, and experience, design is a pointless task.' (Tim Brown)" },
"Co-Creation": { "quote": "Designing with users rather than for them. 'Design with the user, not for the user.' (Gov.UK Design Principles)" },
"Systems Thinking": { "quote": "Understanding how parts influence one another within a whole. 'You can't understand a system unless you change it.' (Kurt Lewin)" },
"Design Ethics": { "quote": "Consideration of the broader impacts of design decisions. 'Design creates culture. Culture shapes values. Values determine the future.' (Robert L. Peters)" },
"Inclusive Design": { "quote": "Creating products that are accessible to, and usable by, as many people as reasonably possible. 'Design for the extremes, and you'll serve the middle.' (Microsoft Design)" },
"Service Design": { "quote": "Organizing people, infrastructure, communication, and material components to improve service quality. 'Good service is designing the invisible.' (Service Design Network)" },
"Design Leadership": { "quote": "Guiding organizations to use design as a strategic advantage. 'Design is not just what it looks like and feels like. Design is how it works.' (Steve Jobs)" },
"Design Implementation": { "quote": "Translating design solutions into reality. 'Vision without execution is hallucination.' (Thomas Edison)" }
}
