{
"Balance": { "quote": "Distribution of visual weight to create stability and harmony. Symmetrical balance creates formality, while asymmetrical balance creates dynamism." },
"Contrast": { "quote": "Juxtaposition of opposing elements to create visual interest and hierarchy. High contrast between text and background improves readability." },
"Emphasis": { "quote": "Creating a focal point that draws attention to key elements. A red button on a minimalist interface directs users to the primary action." },
"Proportion": { "quote": "The relationship between elements based on size, number, or degree. The golden ratio (1:1.618) creates naturally pleasing proportions found throughout nature and art." },
"Hierarchy": { "quote": "Organizing elements by importance to guide user attention. Headlines, subheadings, and body text use decreasing sizes to establish information structure." },
"Repetition": { "quote": "Reusing visual elements to create patterns and consistency. Consistent button styles throughout an application reduce cognitive load." },
"Rhythm": { "quote": "Creating visual tempo through regular or progressive patterns. Alternating large and small elements creates movement that guides the eye." },
"Unity": { "quote": "Cohesiveness among elements that creates a sense of completeness. Related elements share visual characteristics to show their connection." },
"Simplicity": { "quote": "Removing unnecessary elements to focus on the essential. Google's homepage uses minimal elements to focus on its primary search function." },
"Proximity": { "quote": "Grouping related elements to show their relationship. Related form fields are positioned close together to indicate their connection." },
"Alignment": { "quote": "Arranging elements to create order and organization. Consistent margins and grid systems create visual harmony." },
"White Space": { "quote": "Empty space that provides visual breathing room. Generous margins around text improve readability and focus attention." },
"Form Follows Function": { "quote": "Design should primarily serve its intended purpose. The Bauhaus movement prioritized utility over decoration." },
"Affordance": { "quote": "Visual cues that suggest how an object should be used. Button shadows create a raised appearance that suggests pressing." },
"Accessibility": { "quote": "Ensuring designs can be used by people with diverse abilities. Color combinations with sufficient contrast support users with visual impairments." },
"Consistency": { "quote": "Using similar elements throughout a design to create predictability. Consistent navigation patterns help users build mental models of interfaces." },
"Feedback": { "quote": "Communication that confirms user actions have been recognized. Animation when a button is pressed acknowledges the interaction." },
"Constraints": { "quote": "Limitations that guide users toward appropriate actions. Disabled buttons prevent users from submitting incomplete forms." },
"Progressive Disclosure": { "quote": "Revealing information gradually to prevent overwhelming users. Step-by-step wizards break complex processes into manageable stages." },
"Modularity": { "quote": "Building designs from standardized, interchangeable components. Design systems like Material Design provide consistent building blocks." },
"Gestalt Principles": { "quote": "How visual elements are perceived as organized patterns. Proximity, similarity, continuity, closure, and common fate influence perception." },
"Hick's Law": { "quote": "Decision time increases with the number and complexity of choices. Limited navigation options reduce cognitive load and decision paralysis." },
"Flexibility": { "quote": "Designs that adapt to different contexts and user needs. Responsive layouts adjust to various screen sizes and orientations." },
"Visibility": { "quote": "Making important elements and actions perceivable. Critical functions are prominently displayed rather than hidden in menus." },
"Error Prevention": { "quote": "Designing to minimize mistakes before they occur. Confirmation dialogs prevent accidental deletion of important data." },
"Aesthetic-Usability Effect": { "quote": "Attractive designs are perceived as easier to use. Visual polish increases user tolerance for minor usability issues." },
"Pareto Principle": { "quote": "The 80/20 rule suggesting most outcomes come from a small portion of causes. Focusing design effort on the most common user tasks." },
"Iteration": { "quote": "Cyclical process of designing, testing, and refining. Prototyping and user testing inform progressive design improvements." },
"Storytelling": { "quote": "Using narrative elements to create meaningful experiences. User journeys with clear beginnings, middles, and ends create emotional connection." },
"Sustainability": { "quote": "Creating designs with consideration for environmental and social impact. Designing products for longevity rather than planned obsolescence." }
}
