{
"Divine Nature": { "quote": "Deus est summum bonum - God is the highest good. (Augustine, De Natura Boni)" },
"Divine Essence": { "quote": "Deus est actus purus - God is pure act. (Thomas Aquinas, Summa Theologica I, Q.3)" },
"Divine Being": { "quote": "Ipsum Esse Subsistens - The Self-Subsistent Being Itself. (Thomas Aquinas, Summa Theologica I, Q.4)" },
"Divine Unity": { "quote": "Deus est unus - God is one. (Lateran IV Council, 1215)" },
"Divine Trinity": { "quote": "Una substantia, tres personae - One substance, three persons. (Tertullian, Adversus Praxean)" },
"Divine Perfection": { "quote": "Deus est quo nihil maius cogitari potest - God is that than which nothing greater can be thought. (Anselm, Proslogion)" },
"Divine Wisdom": { "quote": "O altitudo divitiarum sapientiae et scientiae Dei - O the depth of the riches of the wisdom and knowledge of God! (Romans 11:33)" },
"Divine Power": { "quote": "Deus Omnipotens - God Almighty. (Apostles' Creed)" },
"Divine Knowledge": { "quote": "Omnia nuda et aperta sunt oculis eius - All things are naked and open to His eyes. (Hebrews 4:13)" },
"Divine Will": { "quote": "Fiat voluntas tua - Thy will be done. (Matthew 6:10)" },
"Divine Love": { "quote": "Deus caritas est - God is love. (1 John 4:8)" },
"Divine Providence": { "quote": "In omnibus providentia Dei - In all things the providence of God. (Augustine, De Civitate Dei)" },
"Divine Justice": { "quote": "Iustus Dominus in omnibus viis suis - The Lord is just in all His ways. (Psalm 145:17)" },
"Divine Mercy": { "quote": "Misericordias Domini in aeternum cantabo - I will sing of the mercies of the Lord forever. (Psalm 89:1)" },
"Divine Creation": { "quote": "Ex nihilo fit - From nothing it becomes. (Augustine, De Genesi ad litteram)" },
"Divine Governance": { "quote": "Deus gubernat omnia - God governs all things. (Thomas Aquinas, Summa Contra Gentiles III)" },
"Divine Presence": { "quote": "Deus est ubique - God is everywhere. (Augustine, Confessions)" },
"Divine Eternity": { "quote": "Tu autem idem ipse es, et anni tui non deficient - But you are the same, and your years will not fail. (Psalm 102:27)" },
"Divine Immutability": { "quote": "Ego Dominus et non mutor - I am the Lord and I change not. (Malachi 3:6)" },
"Divine Simplicity": { "quote": "Deus est summe simplex - God is supremely simple. (Thomas Aquinas, Summa Theologica I, Q.3)" },
"Divine Beauty": { "quote": "Pulchritudo tam antiqua et tam nova - Beauty so ancient and so new. (Augustine, Confessions X)" },
"Divine Truth": { "quote": "Ego sum via et veritas et vita - I am the way, the truth, and the life. (John 14:6)" },
"Divine Light": { "quote": "Deus lux est - God is light. (1 John 1:5)" },
"Divine Glory": { "quote": "Soli Deo gloria - Glory to God alone. (Reformed tradition)" },
"Divine Sovereignty": { "quote": "Domini est regnum - The kingdom is the Lord's. (Psalm 22:28)" },
"Divine Law": { "quote": "Lex aeterna - Eternal law. (Augustine, De Libero Arbitrio)" },
"Divine Grace": { "quote": "Gratia Dei sum quod sum - By the grace of God I am what I am. (1 Corinthians 15:10)" },
"Divine Order": { "quote": "Ordo est parium dispariumque rerum sua cuique loca tribuens dispositio - Order is the disposition of equal and unequal things, giving to each its proper place. (Augustine, De Civitate Dei)" },
"Divine Infinity": { "quote": "Deus est infinitus - God is infinite. (Thomas Aquinas, Summa Theologica I, Q.7)" },
"Divine Causality": { "quote": "Causa Prima - First Cause. (Aristotelian-Thomistic tradition)" }
}
