{
  "anger": {
    "quote": "Be not angry that you cannot make others as you wish them to be, since you cannot make yourself as you wish to be. ~ Thomas A Kempis"
  },
  "depression": {
    "quote": "A depression is always unreasonable as it leads nowhere. It is the most subtle enemy of the Yoga. ~ The Mother  Words Of The Mother - II,"
  },
  "despair": {
    "quote": "When, in our despair, we cry to the Divine, always He answers to our call. With my blessings. ~ The Mother, Mantras of the Mother"
  },
  "difficulty/difficulties": {
    "quote": "The whole purpose of the Yoga is to gather all the divergent parts together and forge them into an undivided unity. Till then you cannot hope to be without difficulties - difficulties, for example, like doubt or depression or hesitation."
  },
  "distractions": {
    "quote": "If one were truly aware of the value of human life, to waste it blithely on distractions and the pursuit of vulgar ambitions would be the height of confusion. ~ Dilgo Khyentse Rinpoche"
  },
  "dryness": {
    "quote": "Dryness is ordinarily the sign of too great a concern with oneself (whether material or spiritual) and a consequent narrowing of the consciousness, which is no longer sufficiently in communion with the divine forces. The remedy: a completer self-giving to the Divine. With my blessings and all my love."
  },
  "Ego": {
    "quote": "this ego-centrism is our rock of safety against the cosmic and the infinite, our defense."
  },
  "evil": {
    "quote": "Always we must repeat to the doubting intellect the promise of the Master, 'I will deliver thee from all sin and evil; do not grieve.' At the end, the flickerings of faith will cease; for we shall see his face and feel always the Divine Presence."
  },
  "excuse": {
    "quote": "It is no use excusing yourself; you must have the will never to fall back into the faults you have committed."
  },
  "impulses/impulsions": {
    "quote": "1. We never find out the strength of the evil impulse inside us until we try to fight it. 2. Control over the lower impulsions is the first step towards realisation."
  },
  "incapacity": {
    "quote": "A present incapacity, however heavy may seem its pressure, is only a trial of faith and a temporary difficulty. ~ Sri Aurobindo, The Synthesis Of Yoga, Faith and Shakti"
  },
  "mistakes": {
    "quote": "1. If even then we make mistakes, yet God makes none. 2. A mistake recognised is a mistake pardoned. 3. A mistake one denies is a mistake one refuses to set right. 4. Repentance: the first step towards rectifying mistakes."
  },
  "Obstacles": {
    "quote": "One puts veils, obstacles between oneself and the Divine. That is how one punishes oneself. The Divine does not withdraw; one makes oneself incapable of receiving him. The Divine does not distribute in this way rewards and punishments.."
  },
  "Ordeals": {
    "quote": "Be grateful for all ordeals, they are the shortest way to the Divine."
  },
  "overwhelm (incapacity)": {
    "quote": "Suffering is due only to our weakness and imperfection. When external forces affect us, if we have acquired sufficient strength to assimilate them, we derive joy from them, otherwise they produce pain."
  },
  "sadness": {
    "quote": "It is always our weaknesses that make us sad, and we can easily recover by advancing one step more on the way."
  },
  "self-deceit": {
    "quote": "Nothing is easier than self-deceit. For what each man wishes, that he also believes to be true. ~ Demos thenes, Third Olynthiac, sec. 19"
  },
  "shame": {
    "quote": "Life is short and the time of death is uncertain; so apply yourself to meditation. Avoid doing evil, and acquire merit, to the best of your ability, even at the cost of life itself. In short: Act so that you have no cause to be ashamed of yourselves and hold fast to this rule. ~ Jetsun Milarepa"
  },
  "suffering": {
    "quote": "1. Suffering is due only to our weakness and imperfection. When external forces affect us, if we have acquired sufficient strength to assimilate them, we derive joy from them, otherwise they produce pain. 2. Turn towards the Divine, all your sufferings will disappear."
  },
  "Tiredness": {
    "quote": "Tiredness shows lack of will for progress. When you feel tired or fatigued that is lack of will for progress.\tFire is always burning in you."
  },
  "weakness/Weaknesses": {
    "quote": "If you have faults and weaknesses, hold them up before the Divine to be changed or abolished."
  }
}
