{
  "Nature of Delight": {
    "quote": "\"The joy of the Lord is your strength.\" (Nehemiah 8:10)"
  },
  "Divine Bliss": {
    "quote": "\"Ananda is Brahman - Bliss is the Ultimate Reality.\" (Taittiriya Upanishad 3.6.1)"
  },
  "Sacred Joy": {
    "quote": "\"In Your presence there is fullness of joy.\" (Psalm 16:11)"
  },
  "Spiritual Ecstasy": {
    "quote": "\"The drunkenness of the spirit is the sobriety of truth.\" (Rumi)"
  },
  "Divine Happiness": {
    "quote": "\"The Self is peace, the Self is supreme happiness.\" (Chandogya Upanishad 7.23.1)"
  },
  "Celestial Pleasure": {
    "quote": "\"Paradise is the garden of spiritual delights.\" (Hadith Qudsi)"
  },
  "Sacred Rapture": {
    "quote": "\"Those who delight in the law of the Lord prosper in all they do.\" (Psalm 1:2-3)"
  },
  "Divine Entertainment": {
    "quote": "\"The whole universe is the play of the Divine.\" (Sri Aurobindo)"
  },
  "Holy Celebration": {
    "quote": "\"Rejoice in the Lord always. I will say it again: Rejoice!\" (Philippians 4:4)"
  },
  "Divine Recreation": {
    "quote": "\"God rested from all his work which he had created and made.\" (Genesis 2:3)"
  },
  "Sacred Pleasure": {
    "quote": "\"Taste and see that the Lord is good.\" (Psalm 34:8)"
  },
  "Divine Satisfaction": {
    "quote": "\"I shall be satisfied with Your likeness when I awake.\" (Psalm 17:15)"
  },
  "Spiritual Enjoyment": {
    "quote": "\"The fruit of the Spirit is love, joy, peace...\" (Galatians 5:22)"
  },
  "Divine Laughter": {
    "quote": "\"Then our mouth was filled with laughter, and our tongue with singing.\" (Psalm 126:2)"
  },
  "Sacred Sweetness": {
    "quote": "\"How sweet are your words to my taste, sweeter than honey to my mouth!\" (Psalm 119:103)"
  },
  "Divine Play": {
    "quote": "\"Krishna's divine play enchants all beings.\" (Srimad Bhagavatam 10.33.36)"
  },
  "Heavenly Mirth": {
    "quote": "\"A merry heart does good like medicine.\" (Proverbs 17:22)"
  },
  "Divine Dance": {
    "quote": "\"The Lord your God will rejoice over you with dancing.\" (Zephaniah 3:17)"
  },
  "Sacred Festivals": {
    "quote": "\"These are the Lord's appointed festivals, the sacred assemblies.\" (Leviticus 23:4)"
  },
  "Divine Revelry": {
    "quote": "\"Let them praise His name with dancing.\" (Psalm 149:3)"
  },
  "Spiritual Games": {
    "quote": "\"The divine play (lila) is the joy of creation.\" (Vedanta Philosophy)"
  },
  "Holy Gladness": {
    "quote": "\"You have put gladness in my heart.\" (Psalm 4:7)"
  },
  "Divine Merriment": {
    "quote": "\"A time to weep, and a time to laugh.\" (Ecclesiastes 3:4)"
  },
  "Sacred Delight": {
    "quote": "\"I delight to do Your will, O my God.\" (Psalm 40:8)"
  },
  "Divine Celebration": {
    "quote": "\"This is the day the Lord has made; let us rejoice and be glad in it.\" (Psalm 118:24)"
  },
  "Spiritual Jubilation": {
    "quote": "\"Shout for joy to the Lord, all the earth.\" (Psalm 100:1)"
  },
  "Divine Exultation": {
    "quote": "\"My soul shall exult in my God.\" (Isaiah 61:10)"
  },
  "Sacred Happiness": {
    "quote": "\"Happy are the people whose God is the Lord.\" (Psalm 144:15)"
  },
  "Divine Cheer": {
    "quote": "\"Be of good cheer, I have overcome the world.\" (John 16:33)"
  },
  "Eternal Joy": {
    "quote": "\"Your joy no one will take from you.\" (John 16:22)"
  }
}
