{
  "Divine Agency": {
    "quote": "\"For it is God who works in you to will and to act in order to fulfill his good purpose.\" (Philippians 2:13)"
  },
  "Divine Intervention": {
    "quote": "\"Call upon Me in the day of trouble; I shall rescue you.\" (Psalm 50:15)"
  },
  "Divine Will": {
    "quote": "\"Not my will, but Yours be done.\" (Luke 22:42)"
  },
  "Divine Grace": {
    "quote": "\"By grace you have been saved through faith.\" (Ephesians 2:8)"
  },
  "Divine Guidance": {
    "quote": "\"I will instruct you and teach you in the way you should go.\" (Psalm 32:8)"
  },
  "Divine Providence": {
    "quote": "\"In all your ways acknowledge Him, and He will make straight your paths.\" (Proverbs 3:6)"
  },
  "Divine Protection": {
    "quote": "\"He who dwells in the shelter of the Most High will abide in the shadow of the Almighty.\" (Psalm 91:1)"
  },
  "Divine Operation": {
    "quote": "\"The wind blows where it wishes - so it is with everyone born of the Spirit.\" (John 3:8)"
  },
  "Divine Movement": {
    "quote": "\"In him we live and move and have our being.\" (Acts 17:28)"
  },
  "Divine Power": {
    "quote": "\"I can do all things through Him who strengthens me.\" (Philippians 4:13)"
  },
  "Divine Law": {
    "quote": "\"The law of the Lord is perfect, refreshing the soul.\" (Psalm 19:7)"
  },
  "Divine Justice": {
    "quote": "\"Righteousness and justice are the foundation of Your throne.\" (Psalm 89:14)"
  },
  "Divine Mercy": {
    "quote": "\"His mercy endures forever.\" (Psalm 136:1)"
  },
  "Divine Help": {
    "quote": "\"Our help is in the name of the Lord.\" (Psalm 124:8)"
  },
  "Divine Work": {
    "quote": "\"My Father is always at his work to this very day, and I too am working.\" (John 5:17)"
  },
  "Divine Plan": {
    "quote": "\"For I know the plans I have for you.\" (Jeremiah 29:11)"
  },
  "Divine Activity": {
    "quote": "\"Be still, and know that I am God.\" (Psalm 46:10)"
  },
  "Divine Direction": {
    "quote": "\"Your word is a lamp for my feet, a light on my path.\" (Psalm 119:105)"
  },
  "Divine Influence": {
    "quote": "\"The Spirit of God has made me; the breath of the Almighty gives me life.\" (Job 33:4)"
  },
  "Divine Energy": {
    "quote": "\"The power of the Most High will overshadow you.\" (Luke 1:35)"
  },
  "Divine Command": {
    "quote": "\"God said, 'Let there be light,' and there was light.\" (Genesis 1:3)"
  },
  "Divine Response": {
    "quote": "\"Before they call I will answer; while they are still speaking I will hear.\" (Isaiah 65:24)"
  },
  "Divine Care": {
    "quote": "\"Cast your cares on the Lord and he will sustain you.\" (Psalm 55:22)"
  },
  "Divine Healing": {
    "quote": "\"I am the Lord, who heals you.\" (Exodus 15:26)"
  },
  "Divine Blessing": {
    "quote": "\"I will bless you... and you will be a blessing.\" (Genesis 12:2)"
  },
  "Divine Transformation": {
    "quote": "\"We are being transformed into his image with ever-increasing glory.\" (2 Corinthians 3:18)"
  },
  "Divine Presence": {
    "quote": "\"Be strong and courageous. Do not be afraid; the Lord your God goes with you.\" (Deuteronomy 31:6)"
  },
  "Divine Empowerment": {
    "quote": "\"You will receive power when the Holy Spirit comes on you.\" (Acts 1:8)"
  },
  "Divine Support": {
    "quote": "\"The eternal God is your refuge, and underneath are the everlasting arms.\" (Deuteronomy 33:27)"
  },
  "Divine Deliverance": {
    "quote": "\"The Lord is my rock, my fortress and my deliverer.\" (Psalm 18:2)"
  }
}
