{
"Inner Vision": { "quote": "\"Blessed are the pure in heart, for they shall see God.\" (Matthew 5:8)" },
"Third Eye": { "quote": "\"When your eye is single, your whole body will be full of light.\" (Luke 11:34)" },
"Divine Perception": { "quote": "\"The eye of the soul, which is blinded by other things, is made clear by contemplation.\" (Plato, Republic)" },
"Spiritual Vision": { "quote": "\"The Self is to be seen, heard, reflected upon, and meditated upon.\" (Brihadaranyaka Upanishad 2.4.5)" },
"Mystic Sight": { "quote": "\"The eye with which I see God is the same eye with which God sees me.\" (Meister Eckhart)" },
"Illuminated Vision": { "quote": "\"Allah is the Light of the heavens and the earth.\" (Quran 24:35)" },
"Divine Witness": { "quote": "\"I am the Witness, the Pure Consciousness.\" (Ashtavakra Gita 1:12)" },
"Sacred Seeing": { "quote": "\"Open my eyes, that I may behold wondrous things.\" (Psalm 119:18)" },
"Transcendent Vision": { "quote": "\"The eye of wisdom beholds the truth of emptiness.\" (Heart Sutra)" },
"Divine Insight": { "quote": "\"Knowledge is the eye of all.\" (Chandogya Upanishad 7.7.2)" },
"Celestial Vision": { "quote": "\"In thy light shall we see light.\" (Psalm 36:9)" },
"All-Seeing Eye": { "quote": "\"The eyes of the Lord are in every place.\" (Proverbs 15:3)" },
"Eternal Sight": { "quote": "\"That which is never seen but is the Seer.\" (Kena Upanishad 1.6)" },
"Divine Gaze": { "quote": "\"Look to Him and be radiant.\" (Psalm 34:5)" },
"Inner Light": { "quote": "\"If therefore thine eye be single, thy whole body shall be full of light.\" (Matthew 6:22)" },
"Sacred Vision": { "quote": "\"Where there is no vision, the people perish.\" (Proverbs 29:18)" },
"Divine Recognition": { "quote": "\"I was blind, but now I see.\" (John 9:25)" },
"Spiritual Eyes": { "quote": "\"The eye is the lamp of the body.\" (Matthew 6:22)" },
"Divine Discernment": { "quote": "\"The spiritual person judges all things.\" (1 Corinthians 2:15)" },
"Awakened Vision": { "quote": "\"Having eyes, do you not see?\" (Mark 8:18)" },
"Universal Vision": { "quote": "\"In all directions, That alone appears.\" (Ashtavakra Gita 2:2)" },
"Divine Viewpoint": { "quote": "\"See as I see.\" (Revelation 3:18)" },
"Sacred Perception": { "quote": "\"The eyes of your understanding being enlightened.\" (Ephesians 1:18)" },
"Divine Observation": { "quote": "\"Nothing in all creation is hidden from God's sight.\" (Hebrews 4:13)" },
"Spiritual Perception": { "quote": "\"What is seen was not made out of things that are visible.\" (Hebrews 11:3)" },
"Divine Awareness": { "quote": "\"I am the eye in all that sees.\" (Bhagavad Gita 10:20)" },
"Sacred Sight": { "quote": "\"They looked to Him and were radiant.\" (Psalm 34:5)" },
"Divine Understanding": { "quote": "\"Now we see in a mirror dimly, but then face to face.\" (1 Corinthians 13:12)" },
"Eternal Vision": { "quote": "\"The pure in heart see God everywhere.\" (Sri Ramakrishna)" },
"Divine Seeing": { "quote": "\"One who sees all beings in the Self and the Self in all beings.\" (Isha Upanishad 6)" }
}
