{
"Divine Feminine": { "quote": "The Goddess is the power of consciousness itself, and through Her all things are possible. (Devi Mahatmya 1:3)" },
"Names of the Mother": { "quote": "You are called by countless names - Durga, Kali, Bhavani, Rajarajeshwari, each revealing Your infinite aspects. (Lalita Sahasranama)" },
"Divine Power": { "quote": "Without You, O Devi, even the gods are powerless. You are the supreme energy of all creation. (Devi Bhagavatam 1:2:19)" },
"Universal Mother": { "quote": "I am the Divine Mother of all beings. In Me the universe has its origin. (Devi Gita 2:12)" },
"Mother's Protection": { "quote": "As a mother protects her child with her own life, so does the Divine Mother protect Her devotees. (Tara Tantra)" },
"Divine Compassion": { "quote": "Swift to respond to the cries of beings, You are the mother of boundless compassion. (Homage to Tara)" },
"Creative Force": { "quote": "The Divine Mother is the creative force behind all existence, the womb from which all manifest. (Shakta Traditions)" },
"Nurturing Presence": { "quote": "Like a mother nursing her child, the Divine Mother nurtures all creation. (Sri Aurobindo, The Mother)" },
"Divine Wisdom": { "quote": "She is Wisdom itself, the knowledge that liberates, the consciousness that illuminates. (Tripura Rahasya)" },
"Mother's Grace": { "quote": "By the Mother's grace alone do we progress, by Her love alone do we exist. (Ramakrishna)" },
"Divine Nature": { "quote": "Nature herself is the Divine Mother in manifestation. (Sri Aurobindo, The Mother)" },
"Sacred Feminine": { "quote": "In Her is the source of all power, all wisdom, all beauty, and all grace. (Devi Mahatmya)" },
"Mother's Love": { "quote": "The Mother's love knows no bounds, Her mercy knows no limits. (Ramakrishna)" },
"Divine Energy": { "quote": "All energy is the Divine Mother's energy, all force is Her force. (Shakti Upanishad)" },
"Cosmic Matrix": { "quote": "The Divine Mother is the matrix of creation, the source of all phenomena. (Tantric Texts)" },
"Mother's Blessing": { "quote": "The Mother's blessing is the force that transforms, the power that elevates. (Sri Aurobindo)" },
"Divine Play": { "quote": "The universe is the Divine Mother's play of consciousness. (Kashmiri Shaivism)" },
"Spiritual Awakening": { "quote": "Through the Mother's touch, spiritual consciousness awakens. (Ramakrishna)" },
"Divine Protection": { "quote": "Those who take refuge in the Mother are forever protected. (Devi Bhagavatam)" },
"Mother's Guidance": { "quote": "The Mother guides each soul according to its need and capacity. (Sri Aurobindo)" },
"Divine Manifestation": { "quote": "Every form is a manifestation of the Divine Mother. (Shakta Philosophy)" },
"Sacred Power": { "quote": "All power is the Mother's power, all force is Her force. (Tantra)" },
"Divine Nourishment": { "quote": "The Mother nourishes all beings with Her infinite love. (Devi Purana)" },
"Mother's Vision": { "quote": "To see the Divine Mother in all is the highest wisdom. (Ramakrishna)" },
"Divine Transformation": { "quote": "Through the Mother's power, transformation becomes possible. (Sri Aurobindo)" },
"Eternal Mother": { "quote": "Before time began, the Mother was. When time ends, the Mother will be. (Devi Bhagavatam)" },
"Mother's Presence": { "quote": "The Mother's presence is felt in every breath, in every heartbeat. (Spiritual Teachings)" },
"Divine Union": { "quote": "In union with the Divine Mother, all separation ceases. (Tantric Wisdom)" },
"Mother's Embrace": { "quote": "In the Mother's embrace, all fear dissolves, all pain ceases. (Mystical Teachings)" },
"Divine Consciousness": { "quote": "The Mother is pure consciousness, the witness of all that is. (Devi Upanishad)" }
}
