{
"Essential Nature": { "quote": "\"God is spirit, and those who worship him must worship in spirit and truth.\" (John 4:24)" },
  "Divine Matter": { "quote": "The universe is Brahman's body, yet Brahman transcends all matter. (Bhagavata Purana 1.2.11)" },
  "Primordial Substance": { "quote": "\"In the beginning was the Word, and the Word was with God, and the Word was God.\" (John 1:1)" },
  "Divine Energy": { "quote": "All this is Brahman - the universal substance and energy. (Chandogya Upanishad 3.14.1)" },
  "Sacred Essence": { "quote": "\"Allah is the Light of the heavens and the earth.\" (Quran 24:35)" },
  "Spiritual Substance": { "quote": "\"The spirit gives life; the flesh counts for nothing.\" (John 6:63)" },
  "Divine Material": { "quote": "Everything is made of consciousness - Chit Shakti. (Kashmir Shaivism)" },
  "Eternal Substance": { "quote": "That which pervades all, which nothing transcends and which, like the universal space around us, fills everything completely from within and without, that Supreme non-dual Brahman. (Tejobindu Upanishad 1.1)" },
  "Divine Elements": { "quote": "The five elements are His body, while He is their soul. (Shvetashvatara Upanishad 6.2)" },
  "Cosmic Substance": { "quote": "\"In Him we live and move and have our being.\" (Acts 17:28)" },
  "Divine Essence": { "quote": "The essence of Tao is emptiness, yet it gives rise to all forms. (Tao Te Ching 4)" },
  "Universal Substance": { "quote": "All things come from One Substance and to One Substance all returns. (Marcus Aurelius, Meditations)" },
  "Divine Ground": { "quote": "God is the ground of all being. (Paul Tillich)" },
  "Primal Matter": { "quote": "Prakriti is the primordial substance from which all manifests. (Samkhya Philosophy)" },
  "Divine Foundation": { "quote": "The Self is the basis of all that exists. (Brihadaranyaka Upanishad 2.4.6)" },
  "Spiritual Matrix": { "quote": "The divine matrix is the container that holds the universe, the bridge between all things. (Max Planck)" },
  "Sacred Matter": { "quote": "Matter itself is full of divinity. (Teilhard de Chardin)" },
  "Divine Substratum": { "quote": "Consciousness is the substratum of all existence. (Yoga Vasishta)" },
  "Celestial Substance": { "quote": "The heavens declare the glory of God. (Psalm 19:1)" },
  "Divine Medium": { "quote": "Space is filled with divine presence - Ein Sof. (Kabbalah)" }
}

