{
"Essential Nature": { "quote": "\"The Self is pure consciousness, the supreme non-dual reality.\" (Shankara, Vivekachudamani)" },
"Primordial Essence": { "quote": "\"Before Abraham was, I am.\" (John 8:58)" },
"Pure Being": { "quote": "\"Being is. Non-being is not.\" (Parmenides)" },
"Divine Substance": { "quote": "\"God is the substance of all things - the essence of everything that exists.\" (Spinoza, Ethics)" },
"Absolute Reality": { "quote": "\"That which is the subtle essence, in it all that exists has its self.\" (Chandogya Upanishad 6.8.4)" },
"Supreme Identity": { "quote": "\"The essence of the Self is pure consciousness.\" (Yoga Sutras 1.3)" },
"Eternal Presence": { "quote": "\"Allah is the Light of the heavens and the earth.\" (Quran 24:35)" },
"Ultimate Ground": { "quote": "\"The Tao is like the emptiness of a vessel; it is what we start with.\" (Tao Te Ching 4)" },
"Divine Core": { "quote": "\"At the center of the soul is God.\" (Meister Eckhart)" },
"Primal Source": { "quote": "\"From fullness, fullness comes forth.\" (Isha Upanishad)" },
"Essential Unity": { "quote": "\"All differences in this world are of degree, and not of kind.\" (Swami Vivekananda)" },
"Divine Quintessence": { "quote": "\"The essence of all beings is the divine.\" (Bhagavad Gita 7:5)" },
"Fundamental Reality": { "quote": "\"Reality is merely an illusion, albeit a very persistent one.\" (Einstein)" },
"Essential Truth": { "quote": "\"Truth is the essential reality and symbolic of divine wisdom.\" (Pythagoras)" },
"Divine Seed": { "quote": "\"The kingdom of heaven is like a mustard seed.\" (Matthew 13:31)" },
"Cosmic Essence": { "quote": "\"As above, so below.\" (Hermes Trismegistus)" },
"Original Nature": { "quote": "\"Every being's original nature is the Buddha nature.\" (Zen teaching)" },
"Divine Spark": { "quote": "\"Within every human being resides a divine spark.\" (Kabbalah)" },
"Essential Self": { "quote": "\"The Atman is Brahman.\" (Mandukya Upanishad)" },
"Primordial Light": { "quote": "\"Let there be light.\" (Genesis 1:3)" },
"Divine Center": { "quote": "\"The kingdom of God is within you.\" (Luke 17:21)" },
"Essential Mind": { "quote": "\"Mind is Buddha, Buddha is Mind.\" (Zen Master Huang Po)" },
"Divine Presence": { "quote": "\"Wherever you turn, there is the Face of Allah.\" (Quran 2:115)" },
"Ultimate Essence": { "quote": "\"The essence of mind is emptiness.\" (Heart Sutra)" },
"Foundational Being": { "quote": "\"In the beginning was the Word.\" (John 1:1)" },
"Divine Matrix": { "quote": "\"All existence is unified in the divine matrix.\" (Plotinus)" },
"Essential Freedom": { "quote": "\"Truth shall set you free.\" (John 8:32)" },
"Divine Heart": { "quote": "\"The heart is the dwelling place of God.\" (Teresa of Avila)" },
"Primal Awareness": { "quote": "\"Pure awareness is the essence of consciousness.\" (Upanishads)" },
"Essential Love": { "quote": "\"Love is the essence of God.\" (Rumi)" }
}
