{
  "Omnipresence": {
    "quote": "Where can I go from your Spirit? Where can I flee from your presence? (Psalm 139:7)"
  },
  "Omniscience": {
    "quote": "Allah knows what is in every heart. (Quran 67:13)"
  },
  "Omnipotence": {
    "quote": "With God all things are possible. (Matthew 19:26)"
  },
  "Transcendence": {
    "quote": "That which is Above is like that which is Below. (Hermes Trismegistus, Emerald Tablet)"
  },
  "Immanence": {
    "quote": "Brahman is all, and the Self is Brahman. (Mandukya Upanishad)"
  },
  "Eternity": {
    "quote": "Before Abraham was born, I am. (John 8:58)"
  },
  "Infinity": {
    "quote": "The Infinite pervades all space and time. (Chandogya Upanishad 3.14.3)"
  },
  "Unity": {
    "quote": "All is One and One is All. (Hermetic principle of correspondence)"
  },
  "Consciousness": {
    "quote": "Pure consciousness is the fundamental nature of existence. (Yoga Sutras 1.2)"
  },
  "Love": {
    "quote": "God is love, and whoever abides in love abides in God. (1 John 4:16)"
  },
  "Wisdom": {
    "quote": "The Lord by wisdom founded the earth. (Proverbs 3:19)"
  },
  "Truth": {
    "quote": "I am the way, the truth, and the life. (John 14:6)"
  },
  "Beauty": {
    "quote": "Beauty emanates from the Divine source of all being. (Plotinus, Enneads)"
  },
  "Justice": {
    "quote": "Righteousness and justice are the foundation of your throne. (Psalm 89:14)"
  },
  "Mercy": {
    "quote": "Allah is the most Merciful of the merciful. (Quran 12:92)"
  },
  "Freedom": {
    "quote": "Where the Spirit of the Lord is, there is freedom. (2 Corinthians 3:17)"
  },
  "Creativity": {
    "quote": "In the beginning God created the heavens and the earth. (Genesis 1:1)"
  },
  "Bliss": {
    "quote": "Ananda (divine bliss) is the nature of the Self. (Taittiriya Upanishad)"
  },
  "Peace": {
    "quote": "The peace of God, which transcends all understanding. (Philippians 4:7)"
  },
  "Light": {
    "quote": "God is light; in him there is no darkness at all. (1 John 1:5)"
  },
  "Life": {
    "quote": "In Him was life, and that life was the light of all mankind. (John 1:4)"
  },
  "Perfection": {
    "quote": "Be perfect, therefore, as your heavenly Father is perfect. (Matthew 5:48)"
  },
  "Silence": {
    "quote": "Be still, and know that I am God. (Psalm 46:10)"
  },
  "Harmony": {
    "quote": "The Tao brings about harmony in the whole universe. (Tao Te Ching 42)"
  }
}
