{
  "Omnipotence": {
    "quote": "With God all things are possible. (Matthew 19:26)"
  },
  "Omniscience": {
    "quote": "O Lord, you have searched me and known me. (Psalm 139:1)"
  },
  "Omnipresence": {
    "quote": "Where can I go from your Spirit? Where can I flee from your presence? (Psalm 139:7)"
  },
  "Benevolence": {
    "quote": "God is love. (1 John 4:8)"
  },
  "Justice": {
    "quote": "Righteousness and justice are the foundation of your throne. (Psalm 89:14)"
  },
  "Mercy": {
    "quote": "For his mercy endures forever. (Psalm 136:1)"
  },
  "Grace": {
    "quote": "For it is by grace you have been saved, through faith—and this is not from yourselves, it is the gift of God. (Ephesians 2:8)"
  },
  "Creator": {
    "quote": "In the beginning God created the heavens and the earth. (Genesis 1:1)"
  },
  "Sustainer": {
    "quote": "He sustains all things by the word of his power. (Hebrews 1:3)"
  },
  "Redeemer": {
    "quote": "For God so loved the world that he gave his one and only Son. (John 3:16)"
  },
  "Judge": {
    "quote": "For we must all appear before the judgment seat of Christ. (2 Corinthians 5:10)"
  },
  "Immanence": {
    "quote": "Closer to you than your jugular vein. (Hadith Qudsi)"
  },
  "Transcendence": {
    "quote": "Holy, holy, holy is the Lord God Almighty, who was, and is, and is to come. (Revelation 4:8)"
  },
  "Eternity": {
    "quote": "From everlasting to everlasting you are God. (Psalm 90:2)"
  },
  "Immutability": {
    "quote": "I the Lord do not change. (Malachi 3:6)"
  },
  "Holiness": {
    "quote": "Be holy, because I am holy. (Leviticus 11:44)"
  },
  "Truth": {
    "quote": "I am the way and the truth and the life. (John 14:6)"
  },
  "Light": {
    "quote": "God is light; in him there is no darkness at all. (1 John 1:5)"
  },
  "Love": {
    "quote": "And so we know and rely on the love God has for us. God is love. (1 John 4:16)"
  },
  "Wisdom": {
    "quote": "The Lord by wisdom founded the earth; by understanding he established the heavens. (Proverbs 3:19)"
  },
  "Providence": {
    "quote": "And we know that in all things God works for the good of those who love him, who have been called according to his purpose. (Romans 8:28)"
  },
  "Sovereignty": {
    "quote": "The Lord reigns forever; he has established his throne for judgment. (Psalm 9:7)"
  },
  "Forgiveness": {
    "quote": "If we confess our sins, he is faithful and just and will forgive us our sins and purify us from all unrighteousness. (1 John 1:9)"
  },
  "Compassion": {
    "quote": "But you, Lord, are a compassionate and gracious God, slow to anger, abounding in love and faithfulness. (Psalm 86:15)"
  },
  "Wrath": {
    "quote": "For the wrath of God is revealed from heaven against all ungodliness and unrighteousness of men. (Romans 1:18)"
  },
  "Beauty": {
    "quote": "Splendor and majesty are before him; strength and beauty are in his sanctuary. (Psalm 96:6)"
  }
}
