{
"Vision of God": { "quote": "\"Blessed are the pure in heart, for they shall see God.\" (Matthew 5:8)" },
"Inner Vision": { "quote": "\"The eye through which I see God is the same eye through which God sees me.\" (Meister Eckhart)" },
"Spiritual Sight": { "quote": "\"The eyes of your understanding being enlightened.\" (Ephesians 1:18)" },
"Divine Perception": { "quote": "\"What is invisible to the outer eye, becomes visible to the inner eye of wisdom.\" (Upanishads)" },
"Mystical Vision": { "quote": "\"In Your light we see light.\" (Psalm 36:9)" },
"Third Eye": { "quote": "\"When your eye is single, your whole body will be full of light.\" (Luke 11:34)" },
"Sacred Seeing": { "quote": "\"The universe is the opening of a vision.\" (Sri Aurobindo)" },
"Transcendent Vision": { "quote": "\"No vision can grasp Him, but His grasp is over all vision.\" (Quran 6:103)" },
"Prophetic Vision": { "quote": "\"Your young men shall see visions, and your old men shall dream dreams.\" (Acts 2:17)" },
"Divine Revelation": { "quote": "\"Now we see through a glass darkly, but then face to face.\" (1 Corinthians 13:12)" },
"Spiritual Insight": { "quote": "\"The eye with which one sees the Reality has to be inner, subtle and divine.\" (Ibn Arabi)" },
"Universal Vision": { "quote": "\"See the Self in all beings and all beings in the Self.\" (Bhagavad Gita 6:29)" },
"Divine Darshan": { "quote": "\"The vision of the Divine destroys all karmas.\" (Yoga Vasistha)" },
"Enlightened Perception": { "quote": "\"When the eye is untroubled, the result is it sees clearly.\" (Tao Te Ching 35)" },
"Sacred Gaze": { "quote": "\"Look with your heart and not with your eyes.\" (Rumi)" },
"Celestial Vision": { "quote": "\"The pure in heart see the divine in everything.\" (Ramakrishna)" },
"Divine Witness": { "quote": "\"Be still and know that I am God.\" (Psalm 46:10)" },
"Spiritual Eyes": { "quote": "\"The light of the body is the eye.\" (Matthew 6:22)" },
"Divine Perspective": { "quote": "\"See God in all and all in God.\" (Vedanta)" },
"Sacred Sight": { "quote": "\"What you seek is seeking you.\" (Rumi)" },
"Divine Recognition": { "quote": "\"Those who know with their eyes shut are aware of the spiritual light.\" (Kabir)" },
"Mystic Vision": { "quote": "\"Vision is the art of seeing what is invisible to others.\" (Jonathan Swift)" },
"Inner Sight": { "quote": "\"The eyes of the heart see what physical eyes cannot.\" (Sufi saying)" },
"Divine Awareness": { "quote": "\"When the doors of perception are cleansed, everything appears as it is - infinite.\" (William Blake)" },
"Spiritual Vision": { "quote": "\"One who sees everything as divine transforms everything they see.\" (Vedantic teaching)" }
}
