{
  "Divine Relationships": { "quote": "" },
  "Initial Ignorance": {
    "quote": "\"Once I was blind, but now I see.\" (John 9:25)"
  },
  "First Contact": {
    "quote": "\"Before I formed you in the womb I knew you.\" (Jeremiah 1:5)"
  },
  "Divine Recognition": {
    "quote": "\"My sheep hear my voice, and I know them.\" (John 10:27)"
  },
  "Spiritual Awakening": {
    "quote": "\"Awake, O sleeper, and arise from the dead.\" (Ephesians 5:14)"
  },
  "Inner Calling": {
    "quote": "\"Deep calls to deep at the roar of your waterfalls.\" (Psalm 42:7)"
  },
  "Initial Response": {
    "quote": "\"Here I am! I stand at the door and knock.\" (Revelation 3:20)"
  },
  "First Turning": {
    "quote": "\"Return to me, and I will return to you.\" (Malachi 3:7)"
  },
  "Early Aspiration": {
    "quote": "\"As the deer pants for streams of water, so my soul pants for you.\" (Psalm 42:1)"
  },
  "Beginning Trust": {
    "quote": "\"Trust in the LORD with all your heart.\" (Proverbs 3:5)"
  },
  "Initial Dedication": {
    "quote": "\"You will seek me and find me when you seek me with all your heart.\" (Jeremiah 29:13)"
  },
  "Growing Faith": {
    "quote": "\"Faith comes by hearing, and hearing by the word of God.\" (Romans 10:17)"
  },
  "Deepening Connection": {
    "quote": "\"Draw near to God and He will draw near to you.\" (James 4:8)"
  },
  "Progressive Understanding": {
    "quote": "\"Then you will understand the fear of the LORD and find the knowledge of God.\" (Proverbs 2:5)"
  },
  "Inner Purification": {
    "quote": "\"Create in me a pure heart, O God.\" (Psalm 51:10)"
  },
  "Spiritual Testing": {
    "quote": "\"The refining pot is for silver and the furnace for gold.\" (Proverbs 17:3)"
  },
  "Divine Patience": {
    "quote": "\"Be still before the LORD and wait patiently for him.\" (Psalm 37:7)"
  },
  "Growing Intimacy": {
    "quote": "\"The secret of the LORD is with those who fear Him.\" (Psalm 25:14)"
  },
  "Increasing Surrender": {
    "quote": "\"Not my will, but yours be done.\" (Luke 22:42)"
  },
  "Deepening Trust": {
    "quote": "\"Though he slay me, yet will I trust in him.\" (Job 13:15)"
  },
  "Spiritual Maturity": {
    "quote": "\"Let us press on to maturity.\" (Hebrews 6:1)"
  },
  "Divine Partnership": {
    "quote": "\"We are laborers together with God.\" (1 Corinthians 3:9)"
  },
  "Sacred Service": {
    "quote": "\"Serve the LORD with gladness.\" (Psalm 100:2)"
  },
  "Conscious Unity": {
    "quote": "\"I and my Father are one.\" (John 10:30)"
  },
  "Stable Connection": {
    "quote": "\"Abide in me, and I in you.\" (John 15:4)"
  },
  "Divine Friendship": {
    "quote": "\"No longer do I call you servants... but I have called you friends.\" (John 15:15)"
  },
  "Spiritual Integration": {
    "quote": "\"Christ be formed in you.\" (Galatians 4:19)"
  },
  "Complete Trust": {
    "quote": "\"I know whom I have believed.\" (2 Timothy 1:12)"
  },
  "Perfect Alignment": {
    "quote": "\"Let this mind be in you which was also in Christ Jesus.\" (Philippians 2:5)"
  },
  "Divine Communion": {
    "quote": "\"Our fellowship is with the Father and with his Son.\" (1 John 1:3)"
  },
  "Ultimate Oneness": {
    "quote": "\"That they all may be one; as thou, Father, art in me, and I in thee.\" (John 17:21)"
  }
}
