{



	"Levels of Understanding": { "quote": "\"The heart has its reasons which reason knows nothing of.\" (Blaise Pascal, Pensées)" },
"Mystical Knowledge": { "quote": "\"The eye through which I see God is the same eye through which God sees me.\" (Meister Eckhart)" },
"Spiritual Insight": { "quote": "\"The kingdom of God is within you.\" (Luke 17:21)" },
"Divine Wisdom": { "quote": "\"Wisdom comes from the One who is All-Wise.\" (Quran 36:2)" },
"Sacred Knowledge": { "quote": "\"Knowledge is as wings to man's life, and a ladder for his ascent.\" (Bahá'u'lláh)" },
"Intuitive Perception": { "quote": "\"The intellect of the wise is like glass; it admits the light of heaven and reflects it.\" (Augustus Hare)" },
"Transcendent Awareness": { "quote": "\"Be still and know that I am God.\" (Psalm 46:10)" },
"Inner Realization": { "quote": "\"Self-knowledge is the beginning of self-realization.\" (Sri Ramana Maharshi)" },
"Divine Cognition": { "quote": "\"In your light we see light.\" (Psalm 36:9)" },
"Spiritual Discernment": { "quote": "\"The spiritual person judges all things.\" (1 Corinthians 2:15)" },
"Sacred Vision": { "quote": "\"Blessed are the pure in heart, for they shall see God.\" (Matthew 5:8)" },
"Enlightened Mind": { "quote": "\"The mind is everything. What you think you become.\" (Buddha)" },
"Divine Recognition": { "quote": "\"Those who know Brahman become Brahman.\" (Mundaka Upanishad 3.2.9)" },
"Spiritual Intelligence": { "quote": "\"The intelligence of the universe is sacred.\" (Marcus Aurelius, Meditations)" },
"Mystical Experience": { "quote": "\"What the soul knows is not of this world.\" (Rumi)" },
"Divine Perception": { "quote": "\"The eye of the soul is not separate from the soul itself.\" (Plotinus)" },
"Sacred Understanding": { "quote": "\"Understanding is the reward of faith.\" (Augustine of Hippo)" },
"Spiritual Awakening": { "quote": "\"Awake, arise, and stop not till the goal is reached.\" (Swami Vivekananda)" },
"Divine Comprehension": { "quote": "\"To understand all is to forgive all.\" (Buddha)" },
"Mystical Insight": { "quote": "\"The mystic sees with the eyes of the soul.\" (John of the Cross)" },
"Sacred Awareness": { "quote": "\"Awareness is the greatest agent for change.\" (Nisargadatta Maharaj)" },
"Divine Revelation": { "quote": "\"Truth is revealed to those who seek it with their whole heart.\" (Maimonides)" },
"Spiritual Knowledge": { "quote": "\"Knowledge of the self is the mother of all knowledge.\" (Khalil Gibran)" },
"Inner Knowing": { "quote": "\"The kingdom of heaven is like treasure hidden in a field.\" (Matthew 13:44)" },
"Divine Consciousness": { "quote": "\"Consciousness is the lamp through which the Divine illumines all.\" (Sri Aurobindo)" },
"Sacred Insight": { "quote": "\"The heart that breaks open can contain the whole universe.\" (Joanna Macy)" },
"Mystical Understanding": { "quote": "\"The mystical is not how the world is, but that it is.\" (Ludwig Wittgenstein)" },
"Divine Intelligence": { "quote": "\"Divine intelligence speaks in silence to the silent soul.\" (Ramakrishna)" },
"Spiritual Wisdom": { "quote": "\"Wisdom comes from experience, and experience comes from mistakes.\" (Zen Proverb)" },
"Sacred Knowing": { "quote": "\"To know yourself is to know God.\" (Ibn Arabi)" },
"Nature of Understanding": { "quote": "\"The eye with which I see God is the same eye with which God sees me.\" (Meister Eckhart)" },
"Levels of Understanding": { "quote": "\"Knowledge is a light which God casts into the heart of whomsoever He wills.\" (Hadith)" },
"Path to Understanding": { "quote": "\"Be still, and know that I am God.\" (Psalm 46:10)" },
"Mysteries of Understanding": { "quote": "\"The Tao that can be understood is not the eternal Tao.\" (Tao Te Ching)" },
"Depths of Understanding": { "quote": "\"The heart has its reasons which reason knows nothing of.\" (Blaise Pascal)" },
"Barriers to Understanding": { "quote": "\"The mind is its own place, and in itself can make a heaven of hell, a hell of heaven.\" (John Milton)" },
"Gates of Understanding": { "quote": "\"Knock and the door shall be opened unto you.\" (Matthew 7:7)" },
"Lights of Understanding": { "quote": "\"Allah is the Light of the heavens and the earth.\" (Quran 24:35)" },
"Wisdom of Understanding": { "quote": "\"To understand the heart and mind of a person, look not at what he has already achieved, but at what he aspires to.\" (Khalil Gibran)" },
"Ways of Understanding": { "quote": "\"There are as many paths to God as there are souls on Earth.\" (Rumi)" },
"States of Understanding": { "quote": "\"When the student is ready, the teacher appears.\" (Buddhist Proverb)" },
"Forms of Understanding": { "quote": "\"Truth has many aspects. Infinite truth has infinite expressions.\" (Sri Aurobindo)" },
"Process of Understanding": { "quote": "\"Seek and you shall find.\" (Luke 11:9)" },
"Qualities of Understanding": { "quote": "\"The divine light penetrates the entire universe.\" (Zohar)" },
"Degrees of Understanding": { "quote": "\"Knowledge is structured in consciousness.\" (Vedic Teaching)" },
"Elements of Understanding": { "quote": "\"As above, so below.\" (Hermes Trismegistus)" },
"Stages of Understanding": { "quote": "\"First understand yourself, then you will understand everything.\" (Swami Vivekananda)" },
"Dimensions of Understanding": { "quote": "\"In your light we see light.\" (Psalm 36:9)" },
"Essence of Understanding": { "quote": "\"The kingdom of God is within you.\" (Luke 17:21)" },
"Methods of Understanding": { "quote": "\"By three methods we may learn wisdom: by reflection, by imitation, and by experience.\" (Confucius)" },
"Powers of Understanding": { "quote": "\"Understanding is the reward of faith.\" (Saint Augustine)" },
"Types of Understanding": { "quote": "\"There are different kinds of gifts, but the same Spirit.\" (1 Corinthians 12:4)" },
"Sources of Understanding": { "quote": "\"Knowledge comes from the One Source.\" (Bhagavad Gita)" },
"Fruits of Understanding": { "quote": "\"By their fruits you shall know them.\" (Matthew 7:16)" },
"Vehicles of Understanding": { "quote": "\"The body is the temple of the living God.\" (1 Corinthians 6:19)" },
"Keys to Understanding": { "quote": "\"The key to growth is the introduction of higher dimensions of consciousness.\" (Lao Tzu)" },
"Goals of Understanding": { "quote": "\"The supreme goal of life is the knowledge of Truth.\" (Upanishads)" },
"Signs of Understanding": { "quote": "\"Wisdom shows itself in action.\" (Islamic Proverb)" },
"Planes of Understanding": { "quote": "\"In wisdom You made them all.\" (Psalm 104:24)" },
"Cycles of Understanding": { "quote": "\"To everything there is a season.\" (Ecclesiastes 3:1)" }
}
