{
"Celestial Realms": { "quote": "In my Father's house are many mansions. (John 14:2)" },
"Sacred Dwellings": { "quote": "The highest paradise, Vaikuntha, is the abode of Lord Vishnu. (Bhagavata Purana 3.15.14)" },
"Divine Dimensions": { "quote": "Indeed, Paradise is as wide as the heavens and earth. (Quran 3:133)" },
"Eternal Residence": { "quote": "The pure land of Sukhavati is adorned with seven rows of palm trees and seven rows of jeweled nets. (Amitabha Sutra)" },
"Spiritual Planes": { "quote": "There are countless Buddha-fields in all ten directions. (Heart Sutra)" },
"Sacred Geography": { "quote": "Mount Meru stands at the center of the physical and spiritual worlds. (Buddhist Cosmology)" },
"Divine Locations": { "quote": "Goloka Vrindavan is the supreme abode of Lord Krishna. (Brahma Samhita 5.43)" },
"Heavenly Gardens": { "quote": "Gardens beneath which rivers flow, wherein they abide eternally. (Quran 9:72)" },
"Sacred Mountains": { "quote": "Mount Olympus, where the gods dwell in their snowy mansions. (Homer's Iliad)" },
"Divine Cities": { "quote": "And I saw the holy city, new Jerusalem, coming down from God out of heaven. (Revelation 21:2)" },
"Celestial Planes": { "quote": "Above the material planets are the eternal realms of existence. (Bhagavad Gita 8:20)" },
"Sacred Spaces": { "quote": "The Temple is called the House of the Eternal. (1 Kings 8:13)" },
"Divine Regions": { "quote": "In the highest region dwells the Absolute Truth. (Mundaka Upanishad 2.2.1)" },
"Spiritual Centers": { "quote": "The Kaaba is the House of Allah, established for the benefit of humanity. (Quran 3:96)" },
"Heavenly Spheres": { "quote": "Seven are the heavens and seven are the earths. (Islamic Tradition)" },
"Sacred Islands": { "quote": "The White Island, Svetadvipa, where the Lord eternally resides. (Mahabharata)" },
"Divine Temples": { "quote": "Your body is a temple of the Holy Spirit. (1 Corinthians 6:19)" },
"Celestial Kingdoms": { "quote": "The Kingdom of Heaven is within you. (Luke 17:21)" },
"Sacred Forests": { "quote": "Vrindavan forest is the eternal abode of divine love. (Padma Purana)" },
"Divine Territories": { "quote": "The pure land is not far from here. (Thich Nhat Hanh)" },
"Spiritual Sanctuaries": { "quote": "The heart of the believer is the throne of the All-Merciful. (Islamic Tradition)" },
"Heavenly Realms": { "quote": "There are three realms: Desire, Form, and Formless. (Buddhist Cosmology)" },
"Sacred Mountains": { "quote": "Mount Kailash is the abode of Lord Shiva. (Hindu Tradition)" },
"Divine Dimensions": { "quote": "Beyond the material cosmos lies the spiritual sky. (Brahma Samhita)" },
"Eternal Worlds": { "quote": "The world to come is the eternal dwelling of the righteous. (Jewish Tradition)" },
"Sacred Grounds": { "quote": "This is none other than the house of God, and this is the gate of heaven. (Genesis 28:17)" },
"Divine Habitations": { "quote": "The righteous will dwell in the House of the Lord forever. (Psalm 23:6)" },
"Spiritual Domains": { "quote": "The Pure Land is the manifestation of the mind's purity. (Mahayana Buddhism)" },
"Celestial Abodes": { "quote": "In the supreme abode, there is eternal consciousness and bliss. (Vedantic Tradition)" },
"Sacred Dwellings": { "quote": "Paradise has eight gates and Hell has seven gates. (Hadith)" }
}
