{
"Nature of Contemplation": { "quote": "Be still, and know that I am God. (Psalm 46:10)" },
"Contemplative Practice": { "quote": "The thought of God is the food of the soul. (St. Augustine, Confessions)" },
"Inner Reflection": { "quote": "Look within. Within is the fountain of good, and it will ever bubble up, if thou wilt ever dig. (Marcus Aurelius, Meditations)" },
"Divine Presence": { "quote": "Wheresoever you turn, there is the Face of Allah. (Quran 2:115)" },
"Meditative State": { "quote": "When meditation is mastered, the mind is unwavering like the flame of a lamp in a windless place. (Bhagavad Gita 6:19)" },
"Sacred Silence": { "quote": "Silence is the language of God, all else is poor translation. (Rumi)" },
"Spiritual Vision": { "quote": "The eye through which I see God is the same eye through which God sees me. (Meister Eckhart)" },
"Mindful Awareness": { "quote": "Be mindful with diligence. (Buddha, Dhammapada)" },
"Heart's Knowledge": { "quote": "The heart has its reasons which reason knows not. (Blaise Pascal, Pensées)" },
"Divine Union": { "quote": "I have been absorbed in the Lord's Love; I am absorbed in the Lord's Name. (Guru Nanak, Sri Guru Granth Sahib)" },
"Inner Journey": { "quote": "The kingdom of God is within you. (Luke 17:21)" },
"Contemplative Space": { "quote": "Create in me a clean heart, O God, and renew a right spirit within me. (Psalm 51:10)" },
"Sacred Attention": { "quote": "Attention is the natural prayer of the soul. (Nicolas Malebranche)" },
"Divine Insight": { "quote": "Knowledge of the self is the mother of all knowledge. (Khalil Gibran)" },
"Spiritual Stillness": { "quote": "In quietness and confidence shall be your strength. (Isaiah 30:15)" },
"Mystical Experience": { "quote": "The eye of the heart sees more than ten eyes of the head. (Gregory the Great)" },
"Contemplative Wisdom": { "quote": "Wisdom comes from sitting in silence. (Native American Proverb)" },
"Divine Recognition": { "quote": "He who knows himself knows his Lord. (Islamic Tradition)" },
"Sacred Understanding": { "quote": "Understanding is the reward of faith. Therefore, seek not to understand that you may believe, but believe that you may understand. (St. Augustine)" },
"Inner Light": { "quote": "There is a light that shines beyond all things on Earth, beyond the highest, the very highest heavens. This is the light that shines in your heart. (Chandogya Upanishad)" },
"Contemplative Path": { "quote": "The path of the just is as the shining light, that shineth more and more unto the perfect day. (Proverbs 4:18)" },
"Divine Reflection": { "quote": "As water reflects the face, so one's life reflects the heart. (Proverbs 27:19)" },
"Sacred Space": { "quote": "The cave you fear to enter holds the treasure you seek. (Joseph Campbell)" },
"Contemplative State": { "quote": "Those who dwell in the shelter of the Most High will rest in the shadow of the Almighty. (Psalm 91:1)" },
"Divine Connection": { "quote": "Prayer is the key of the morning and the bolt of the evening. (Mahatma Gandhi)" },
"Inner Silence": { "quote": "Let the waters settle and you will see the moon and stars mirrored in your being. (Rumi)" },
"Spiritual Reality": { "quote": "Reality is merely an illusion, albeit a very persistent one. (Albert Einstein)" },
"Divine Awareness": { "quote": "Awareness is the greatest agent for change. (Nisargadatta Maharaj)" },
"Sacred Observation": { "quote": "Look deep into nature, and then you will understand everything better. (Albert Einstein)" },
"Contemplative Being": { "quote": "What you seek is seeking you. (Rumi)" }
}
