{
  "Divine Descent": {
    "quote": "\"The journey begins with a descent into the shadows of existence.\" (Dante's Inferno)"
  },
  "Sacred Crisis": {
    "quote": "\"In the middle of the journey of our life, I found myself in a dark wood.\" (Dante)"
  },
  "Holy Recognition": {
    "quote": "\"And we shall see how serious things are really laughable, and what seems laughable is really serious.\" (Plato)"
  },
  "Divine Reversal": {
    "quote": "\"The last shall be first, and the first last.\" (Matthew 20:16)"
  },
  "Cosmic Perspective": {
    "quote": "\"From the height of cosmic consciousness, all is divine play.\" (Sri Aurobindo)"
  },
  "Sacred Detachment": {
    "quote": "\"Learn to laugh at yourself, and you will never cease to be entertained.\" (Zen teaching)"
  },
  "Divine Lightening": {
    "quote": "\"The burden becomes light when carried with laughter.\" (Sufi saying)"
  },
  "Mystical Inversion": {
    "quote": "\"The fool who persists in his folly will become wise.\" (William Blake)"
  },
  "Holy Transformation": {
    "quote": "\"When the heart weeps for what it has lost, the spirit laughs for what it has found.\" (Sufi proverb)"
  },
  "Sacred Integration": {
    "quote": "\"To play with the infinite is to invite the infinite to play with you.\" (Alan Watts)"
  },
  "Divine Liberation": {
    "quote": "\"When you realize how perfect everything is, you will tilt your head back and laugh at the sky.\" (Buddha)"
  },
  "Cosmic Release": {
    "quote": "\"Let go of seriousness, and the sacred reveals itself in play.\" (Taoist teaching)"
  },
  "Holy Transcendence": {
    "quote": "\"Beyond tragedy and comedy lies the divine smile.\" (Sri Ramakrishna)"
  },
  "Sacred Return": {
    "quote": "\"Coming full circle, the sage laughs at what the seeker took seriously.\" (Zen saying)"
  },
  "Divine Embodiment": {
    "quote": "\"To embody the cosmic joke is to become the divine comedian.\" (Joseph Campbell)"
  },
  "Mystical Service": {
    "quote": "\"The enlightened one returns to the marketplace with gift-bestowing hands.\" (Zen Ten Ox-herding Pictures)"
  },
  "Cosmic Celebration": {
    "quote": "\"The whole universe is a divine celebration, and we are all invited to the party.\" (Rumi)"
  },
  "Sacred Performance": {
    "quote": "\"Life is not a tragedy but a divine comedy, play your part well.\" (Vedantic teaching)"
  },
  "Divine Radiation": {
    "quote": "\"The sage's laughter spreads joy like ripples on a pond.\" (Chinese proverb)"
  },
  "Eternal Play": {
    "quote": "\"In the eternal now, all is divine play unfolding.\" (Meister Eckhart)"
  },

 
  "Journey of the Soul": {
    "quote": "\"Midway upon the journey of our life, I found myself within a forest dark, for the straightforward pathway had been lost.\" (Inferno 1:1-3)"
  },
  "Structure of the Afterlife": {
    "quote": "\"Through me you pass into the city of woe, through me you pass into eternal pain.\" (Inferno 3:1-2)"
  },
  "Sin and Punishment": {
    "quote": "\"Abandon all hope, ye who enter here.\" (Inferno 3:9)"
  },
  "Redemption and Purification": {
    "quote": "\"To run o'er better waters now hoists sail the little bark of my wit.\" (Purgatorio 1:1-2)"
  },
  "Divine Justice": {
    "quote": "\"Justice moved my high maker; divine omnipotence created me.\" (Inferno 3:4-5)"
  },
  "Love and Free Will": {
    "quote": "\"The Love which moves the sun and the other stars.\" (Paradiso 33:145)"
  },
  "Guidance and Wisdom": {
    "quote": "\"I think and judge it best you follow me, and I shall be your guide.\" (Inferno 1:112-113)"
  },
  "The Three Realms": {
    "quote": "\"I saw within Its depth how It conceives all things in a single volume bound by Love.\" (Paradiso 33:85-86)"
  },
  "Symbolism of Light": {
    "quote": "\"The glory of Him who moves all things penetrates the universe, resplendent in one region more, elsewhere less.\" (Paradiso 1:1-3)"
  },
  "Contrapasso": {
    "quote": "\"As they sinned, so are they punished here.\" (Inferno 28:142)"
  },
  "The Dark Wood": {
    "quote": "\"How harsh and bitter it is to tread the thoughts of others' stairs!\" (Paradiso 22:58-59)"
  },
  "The Empyrean": {
    "quote": "\"But already my desire and will were being turned like a wheel, all at one speed, by the Love that moves the heavens.\" (Paradiso 33:143-145)"
  },
  "Human Frailty": {
    "quote": "\"I did not die, and yet I lost life's breath.\" (Inferno 5:141)"
  },
  "Divine Grace": {
    "quote": "\"Here force failed my high fantasy; but already my desire and will were rolled—even as a wheel that moveth equally—by the Love that moves the sun and the other stars.\" (Paradiso 33:142-145)"
  },
  "The Final Vision": {
    "quote": "\"In that abyss I saw how love held bound into one volume all the leaves dispersed through the universe.\" (Paradiso 33:85-87)"
  },
  "The Role of Beatrice": {
    "quote": "\"Gaze fixed upon me, like one who would speak, she then began: 'Look well! I am, I am indeed Beatrice.'\" (Purgatorio 30:73-75)"
  },
  "The Role of Virgil": {
    "quote": "\"Take thou thine own way; I elect thee and crown thee as lord over thyself.\" (Purgatorio 27:142)"
  },
  "Descent into Hell": {
    "quote": "\"Into the hidden things let us descend.\" (Inferno 4:114)"
  },
  "Ascent to Paradise": {
    "quote": "\"I mounted to the circle of the first stair, which, though of marble, was so polished and smooth that in it I mirrored me.\" (Purgatorio 9:94-96)"
  },
  "Divine Mystery": {
    "quote": "\"O grace abounding, wherein I presumed to fix my look on the Eternal Light so deep that in it I discerned all things.\" (Paradiso 33:82-84)"
  }
}
