{
  "Om": {
    "quote": "Om is the primordial sound from which all creation emerged. (Mandukya Upanishad)"
  },
  "Cross": {
    "quote": "For the message of the cross is foolishness to those who are perishing, but to us who are being saved it is the power of God. (1 Corinthians 1:18)"
  },
  "Yin-Yang": {
    "quote": "When the Tao is present in the universe, the horses haul manure. When the Tao is absent from the universe, war horses are bred outside the city. (Tao Te Ching 46)"
  },
  "Star of David": {
    "quote": "Your shield of David protects the chosen people. (Medieval Jewish Prayer)"
  },
  "Crescent Moon": {
    "quote": "The moon has become a sign for people to mark time. (Quran 10:5)"
  },
  "Lotus": {
    "quote": "Just as a lotus flower grows from mud but remains unstained, so too can the mind transcend worldly conditions. (Anguttara Nikaya)"
  },
  "Tree of Life": {
    "quote": "She is a tree of life to those who take hold of her; those who hold her fast will be blessed. (Proverbs 3:18)"
  },
  "Dharma Wheel": {
    "quote": "Just as the wheel of the cart follows the hoof of the ox, the Dharma follows those who sincerely practice it. (Dhammapada)"
  },
  "Pentagram": {
    "quote": "The five points represent the elements of creation: earth, air, fire, water, and spirit. (Pythagorean Tradition)"
  },
  "Sacred Fire": {
    "quote": "The fire on the altar must be kept burning; it must not go out. (Leviticus 6:12)"
  },
  "Spiral": {
    "quote": "From the one comes the many, spiraling outward into manifestation. (Celtic Wisdom)"
  },
  "Kundalini Serpent": {
    "quote": "The divine power lies coiled at the base of the spine, waiting to rise through the chakras. (Yoga Sutras)"
  },
  "Eye of Horus": {
    "quote": "The Eye of Horus sees all and protects the pharaoh in this world and the next. (Egyptian Book of the Dead)"
  },
  "Sacred Geometries": {
    "quote": "God eternally geometrizes. (Plato)"
  },
  "Endless Knot": {
    "quote": "All phenomena are intricately interconnected, with neither beginning nor end. (Tibetan Buddhism)"
  },
  "World Pillar": {
    "quote": "The cosmic pillar supports heaven and earth, connecting all realms of existence. (Vedic Texts)"
  },
  "Sacred Circle": {
    "quote": "God is a circle whose center is everywhere and circumference nowhere. (Hermes Trismegistus)"
  },
  "Triple Spiral": {
    "quote": "The three realms of earth, sea, and sky spiral in eternal dance. (Celtic Mythology)"
  },
  "Phoenix": {
    "quote": "From the ashes of death comes new life, eternal and transformed. (Egyptian Mythology)"
  },
  "Divine Light": {
    "quote": "God is light; in him there is no darkness at all. (1 John 1:5)"
  },
  "Sacred Mountain": {
    "quote": "The mountain is where heaven and earth meet. (Chinese Tradition)"
  },
  "Divine Numbers": {
    "quote": "Numbers are the Universal language offered by the deity to humans as confirmation of the truth. (St. Augustine)"
  },
  "Cosmic Egg": {
    "quote": "In the beginning was the cosmic egg, containing all possibilities. (Upanishads)"
  },
  "Sacred Waters": {
    "quote": "But whoever drinks the water I give them will never thirst. (John 4:14)"
  },
   "Ankh": {
    "quote": "The key of life opens the gates between worlds and bestows eternal life. (Egyptian Texts)"
  },
  "Mandala": {
    "quote": "The mandala is the sacred circle of wholeness, representing the universe itself. (Carl Jung)"
  },
  "Caduceus": {
    "quote": "The twin serpents represent the balance of opposing forces in the universe. (Greek Hermetic Tradition)"
  },
  "Sri Yantra": {
    "quote": "The Sri Yantra is the mother of all geometric forms and the pattern of cosmic evolution. (Tantra Texts)"
  },
  "Triquetra": {
    "quote": "Three interlocked circles represent the eternal trinity of divine power. (Celtic Christian Tradition)"
  },
  "Dragon": {
    "quote": "The celestial dragon guards the pearls of wisdom and cosmic power. (Chinese Mythology)"
  },
  "Labyrinth": {
    "quote": "The sacred path leads to the center, where divine wisdom awaits. (Medieval Christian Mysticism)"
  },
  "Ouroboros": {
    "quote": "The serpent eating its own tail represents the eternal cycle of creation and destruction. (Gnostic Texts)"
  },
  "Thor's Hammer": {
    "quote": "Mjolnir bridges heaven and earth, bringing divine power into manifestation. (Norse Mythology)"
  },
  "Sacred Heart": {
    "quote": "The heart of the divine burns with endless love for creation. (Catholic Mysticism)"
  },
  "Vesica Piscis": {
    "quote": "Where two circles intersect, the divine and human realms meet. (Sacred Geometry)"
  },
  "Medicine Wheel": {
    "quote": "The sacred hoop connects all directions and all beings in the circle of life. (Native American Tradition)"
  }
}
