{
  "Perfect Being": {
    "quote": "Be perfect, therefore, as your heavenly Father is perfect. (Matthew 5:48)"
  },
  "Perfect Nature": {
    "quote": "Allah - there is no deity except Him, the Ever-Living, the Self-Sustaining. (Quran 2:255)"
  },
  "Perfect Knowledge": {
    "quote": "That which is perfect knows all and comprehends all. (Vedanta Sutra 2.1.14)"
  },
  "Perfect Love": {
    "quote": "Perfect love casts out fear. (1 John 4:18)"
  },
  "Perfect Unity": {
    "quote": "In perfect Oneness, there is no separation between knower and known. (Upanishads)"
  },
  "Perfect Will": {
    "quote": "The divine will is supremely and perfectly good. (Thomas Aquinas, Summa Theologica)"
  },
  "Perfect Power": {
    "quote": "With God all things are possible. (Matthew 19:26)"
  },
  "Perfect Wisdom": {
    "quote": "The Tao is perfect, lacking nothing. (Tao Te Ching, Chapter 25)"
  },
  "Perfect Peace": {
    "quote": "The peace of God, which surpasses all understanding. (Philippians 4:7)"
  },
  "Perfect Justice": {
    "quote": "The Rock, His work is perfect, for all His ways are justice. (Deuteronomy 32:4)"
  },
  "Perfect Freedom": {
    "quote": "Where the Spirit of the Lord is, there is perfect freedom. (2 Corinthians 3:17)"
  },
  "Perfect Beauty": {
    "quote": "From Zion, perfect in beauty, God shines forth. (Psalm 50:2)"
  },
  "Perfect Truth": {
    "quote": "That which is perfectly true remains unchanged. (Bhagavad Gita 2:16)"
  },
  "Perfect Bliss": {
    "quote": "In the perfect state of Brahman, there is absolute bliss. (Mandukya Upanishad)"
  },
  "Perfect Harmony": {
    "quote": "Heaven and Earth are in perfect harmony with the Tao. (Tao Te Ching, Chapter 32)"
  },
  "Perfect Light": {
    "quote": "God is light, and in Him there is no darkness at all. (1 John 1:5)"
  },
  "Perfect Law": {
    "quote": "The law of the Lord is perfect, refreshing the soul. (Psalm 19:7)"
  },
  "Perfect Creation": {
    "quote": "And God saw everything that He had made, and behold, it was very good. (Genesis 1:31)"
  },
  "Perfect Grace": {
    "quote": "My grace is sufficient for you, for my power is made perfect in weakness. (2 Corinthians 12:9)"
  },
  "Perfect Presence": {
    "quote": "Where can I go from your Spirit? Where can I flee from your presence? (Psalm 139:7)"
  },
  "Perfect Guidance": {
    "quote": "He guides to Himself those who turn to Him in penitence. (Quran 13:27)"
  },
  "Perfect Mercy": {
    "quote": "The mercy of the Lord is perfect and eternal. (Psalm 136:1)"
  },
  "Perfect Glory": {
    "quote": "The heavens declare the glory of God; the skies proclaim the work of his hands. (Psalm 19:1)"
  },
  "Perfect Existence": {
    "quote": "I am the eternal, perfect, absolute Being. (Bhagavad Gita 10:12)"
  },
  "Perfect Design": {
    "quote": "How perfect are His works! All His ways are just. (Deuteronomy 32:4)"
  }
}
