{

    "Divine Will": {
        "quote": "\"Not my will, but Yours be done.\" (Luke 22:42)"
    },
    "Divine Grace": {
        "quote": "\"By grace you have been saved through faith.\" (Ephesians 2:8)"
    },
    "Divine Justice": {
        "quote": "\"Righteousness and justice are the foundation of Your throne.\" (Psalm 89:14)"
    },
    "Divine Mercy": {
        "quote": "\"Allah is the Most Merciful of the merciful.\" (Quran 12:92)"
    },
    "Divine Protection": {
        "quote": "\"The Lord is my rock, my fortress and my deliverer.\" (Psalm 18:2)"
    },
    "Divine Healing": {
        "quote": "\"I am the Lord, who heals you.\" (Exodus 15:26)"
    },
    "Divine Transformation": {
        "quote": "\"Behold, I make all things new.\" (Revelation 21:5)"
    },
    "Divine Illumination": {
        "quote": "\"I am the light of the world.\" (John 8:12)"
    },
    "Divine Liberation": {
        "quote": "\"Know the truth, and the truth will set you free.\" (John 8:32)"
    },
    "Divine Sustenance": {
        "quote": "\"I am the bread of life.\" (John 6:35)"
    },
    "Divine Wisdom": {
        "quote": "\"The Lord gives wisdom; from his mouth come knowledge and understanding.\" (Proverbs 2:6)"
    },
    "Divine Love": {
        "quote": "\"Nothing can separate us from the love of God.\" (Romans 8:38-39)"
    },
    "Divine Authority": {
        "quote": "\"All authority in heaven and on earth has been given to me.\" (Matthew 28:18)"
    },
    "Divine Providence": {
        "quote": "\"In all things God works for the good of those who love him.\" (Romans 8:28)"
    },
    "Divine Guidance": {
        "quote": "\"Your word is a lamp to my feet and a light to my path.\" (Psalm 119:105)"
    },
    "Divine Order": {
        "quote": "\"God is not a God of disorder but of peace.\" (1 Corinthians 14:33)"
    },
    "Divine Judgment": {
        "quote": "\"The Father has given all judgment to the Son.\" (John 5:22)"
    },
    "Divine Victory": {
        "quote": "\"Thanks be to God, who gives us the victory.\" (1 Corinthians 15:57)"
    },
    "Divine Peace": {
        "quote": "\"Peace I leave with you; my peace I give you.\" (John 14:27)"
    },
    "Divine Unity": {
        "quote": "\"That they all may be one, as You, Father, are in Me, and I in You.\" (John 17:21)"
    },
    "Divine Resurrection": {
        "quote": "\"I am the resurrection and the life.\" (John 11:25)"
    },
    "Divine Purification": {
        "quote": "\"Create in me a clean heart, O God.\" (Psalm 51:10)"
    },
    "Divine Sovereignty": {
        "quote": "\"The Lord has established His throne in heaven, and His kingdom rules over all.\" (Psalm 103:19)"
    },
    "Divine Perfection": {
        "quote": "\"Be perfect, therefore, as your heavenly Father is perfect.\" (Matthew 5:48)"
    },
  "Creation": {
    "quote": "In the beginning, God created the heavens and the earth. (Genesis 1:1)"
  },
  "Omnipotence": {
    "quote": "With God all things are possible. (Matthew 19:26)"
  },
  "Omniscience": {
    "quote": "His understanding is infinite. (Psalm 147:5)"
  },
  "Omnipresence": {
    "quote": "Where can I go from your Spirit? Where can I flee from your presence? (Psalm 139:7)"
  },
  "Transcendence": {
    "quote": "My thoughts are not your thoughts, neither are your ways my ways, declares the Lord. (Isaiah 55:8)"
  },
  "Immanence": {
      "quote": "The Kingdom of God is within you. (Luke 17:21)"
  },
  "Love": {
    "quote": "God is love. (1 John 4:8)"
  },
  "Justice": {
    "quote": "The Lord is a God of justice. (Isaiah 30:18)"
  },
  "Mercy": {
    "quote": "His mercy endures forever. (Psalm 136)"
  },
  "Judgment": {
    "quote": "He will judge the world in righteousness. (Acts 17:31)"
  },
  "Miracles": {
    "quote": "Jesus did many other miraculous signs in the presence of his disciples, which are not recorded in this book. (John 20:30)"
  },
  "Healing": {
    "quote": "He heals the brokenhearted and binds up their wounds. (Psalm 147:3)"
  },
  "Revelation": {
    "quote": "The secret things belong to the Lord our God, but the things revealed belong to us and to our children forever. (Deuteronomy 29:29)"
  },
  "Inspiration": {
    "quote": "All Scripture is God-breathed and is useful for teaching, rebuking, correcting and training in righteousness. (2 Timothy 3:16)"
  },
  "Transformation": {
    "quote": "Be transformed by the renewing of your mind. (Romans 12:2)"
  },
  "Redemption": {
    "quote": "In him we have redemption through his blood, the forgiveness of sins. (Ephesians 1:7)"
  },
  "Salvation": {
    "quote": "For God so loved the world that he gave his one and only Son, that whoever believes in him shall not perish but have eternal life. (John 3:16)"
  },
  "Forgiveness": {
    "quote": "If we confess our sins, he is faithful and just and will forgive us our sins and purify us from all unrighteousness. (1 John 1:9)"
  },
  "Providence": {
    "quote": "And we know that in all things God works for the good of those who love him, who have been called according to his purpose. (Romans 8:28)"
  },
  "Sustenance": {
    "quote": "He gives food to every creature. (Psalm 136:25)"
  },
   "Guidance": {
    "quote": "Trust in the LORD with all your heart and lean not on your own understanding; in all your ways submit to him, and he will make your paths straight. (Proverbs 3:5-6)"
  },
  "Wisdom": {
    "quote": "If any of you lacks wisdom, you should ask God, who gives generously to all without finding fault, and it will be given to you. (James 1:5)"
   },
  "Blessing" : {
      "quote": "\"The Lord bless you and keep you; the Lord make his face shine on you and be gracious to you; the Lord turn his face toward you and give you peace.\" (Numbers 6:24-26)"
    }
}
