{
  "Face of God": {
    "quote": "\"No one can see my face and live.\" (Exodus 33:20)"
  },
  "Divine Countenance": {
    "quote": "\"The Lord make His face shine upon you and be gracious to you.\" (Numbers 6:25)"
  },
  "Divine Appearance": {
    "quote": "\"His face shone like the sun, and his clothes became as white as light.\" (Matthew 17:2)"
  },
  "Divine Vision": {
    "quote": "\"Blessed are the pure in heart, for they shall see God.\" (Matthew 5:8)"
  },
  "Divine Features": {
    "quote": "\"His eyes were like blazing fire, and on his head were many crowns.\" (Revelation 19:12)"
  },
  "Divine Gaze": {
    "quote": "\"The eyes of the Lord are in every place, keeping watch on the evil and the good.\" (Proverbs 15:3)"
  },
  "Divine Presence": {
    "quote": "\"Seek His face continually.\" (1 Chronicles 16:11)"
  },
  "Divine Form": {
    "quote": "\"The form of the Lord is beyond description, yet His face is seen everywhere.\" (Brahma Samhita 5.38)"
  },
  "Divine Beauty": {
    "quote": "\"One thing I ask from the Lord... to gaze upon the beauty of the Lord.\" (Psalm 27:4)"
  },
  "Divine Light": {
    "quote": "\"God is light, and in Him there is no darkness at all.\" (1 John 1:5)"
  },
  "Divine Expression": {
    "quote": "\"The light of Your face has shone upon us, O Lord.\" (Psalm 4:6)"
  },
  "Divine Reflection": {
    "quote": "\"We all, with unveiled face, beholding the glory of the Lord, are being transformed.\" (2 Corinthians 3:18)"
  },
  "Divine Radiance": {
    "quote": "\"His face was like the sun shining in all its brilliance.\" (Revelation 1:16)"
  },
  "Divine Glory": {
    "quote": "\"Show me Your glory.\" (Exodus 33:18)"
  },
  "Divine Veils": {
    "quote": "\"Moses put a veil over his face because its radiance was fading.\" (2 Corinthians 3:13)"
  },
  "Divine Recognition": {
    "quote": "\"Now I know in part; then I shall know fully, even as I am fully known.\" (1 Corinthians 13:12)"
  },
  "Divine Aspects of Face": {
    "quote": "\"Each face will be radiant, looking towards their Lord.\" (Quran 75:22-23)"
  },
  "Divine Manifestation in Face": {
    "quote": "\"In His face all the divine attributes are perfectly displayed.\" (Ibn Arabi)"
  },
  "Divine Facial Features": {
    "quote": "\"His appearance was so marred, beyond human semblance.\" (Isaiah 52:14)"
  },
  "Divine Smile": {
    "quote": "\"May God smile on us and bless us.\" (Psalm 67:1)"
  },
  "Divine Eyes": {
    "quote": "\"The eyes of the Ancient of Days were like flaming torches.\" (Daniel 7:9)"
  },
  "Divine Mouth": {
    "quote": "\"From his mouth came a sharp sword.\" (Revelation 19:15)"
  },
  "Divine Visibility": {
    "quote": "\"Though now you do not see Him, yet believing, you rejoice.\" (1 Peter 1:8)"
  },
  "Divine Face Seeking": {
    "quote": "\"Your face, Lord, I will seek.\" (Psalm 27:8)"
  },
  "Divine Face Hiding": {
    "quote": "\"How long will You hide Your face from me?\" (Psalm 13:1)"
  },
  "Divine Face Blessing": {
    "quote": "\"Make Your face shine upon Your servant.\" (Psalm 31:16)"
  },
  "Divine Face Transformation": {
    "quote": "\"Those who look to Him are radiant.\" (Psalm 34:5)"
  },
  "Divine Face Recognition": {
    "quote": "\"Face to face I have seen God.\" (Genesis 32:30)"
  },
  "Divine Face Revelation": {
    "quote": "\"When He appears, we shall be like Him, for we shall see Him as He is.\" (1 John 3:2)"
  },
  "Divine Face Contemplation": {
    "quote": "\"In Your light we see light.\" (Psalm 36:9)"
  }
}
