{
"Absolute Reality": { "quote": "\"That which is the finest essence - this whole world has that as its soul. That is Reality. That is Truth. That art Thou.\" (Chandogya Upanishad 6.8.7)" },
"Divine Presence": { "quote": "\"Closer is He than breathing, and nearer than hands and feet.\" (Tennyson, inspired by Acts 17:28)" },
"Eternal Now": { "quote": "\"I am the same yesterday, today, and forever.\" (Hebrews 13:8)" },
"Infinite Being": { "quote": "\"There is nothing but the infinite divine Existence.\" (Sri Aurobindo, The Life Divine)" },
"Pure Consciousness": { "quote": "\"Consciousness is Brahman.\" (Aitareya Upanishad 3.1.3)" },
"Divine Immanence": { "quote": "\"Do I not fill heaven and earth?\" declares the Lord. (Jeremiah 23:24)" },
"Divine Transcendence": { "quote": "\"Higher than the highest, vaster than the vastest.\" (Katha Upanishad 2.20)" },
"Ultimate Truth": { "quote": "\"I am the way, the truth, and the life.\" (John 14:6)" },
"Divine Essence": { "quote": "\"God is the essence of all essences.\" (Meister Eckhart)" },
"Absolute Freedom": { "quote": "\"Where the Spirit of the Lord is, there is freedom.\" (2 Corinthians 3:17)" },
"Divine Unity": { "quote": "\"All things are one in Allah's unity.\" (Ibn Arabi)" },
"Eternal Existence": { "quote": "\"Before Abraham was, I am.\" (John 8:58)" },
"Divine Actuality": { "quote": "\"In Him we live and move and have our being.\" (Acts 17:28)" },
"Perfect Being": { "quote": "\"Be perfect, therefore, as your heavenly Father is perfect.\" (Matthew 5:48)" },
"Divine Self": { "quote": "\"Atman is Brahman - The individual self is the universal Self.\" (Mandukya Upanishad)" },
"Absolute Knowledge": { "quote": "\"He knows what lies before them and what lies behind them.\" (Quran 2:255)" },
"Divine Light": { "quote": "\"God is light, and in Him there is no darkness at all.\" (1 John 1:5)" },
"Supreme Reality": { "quote": "\"That supreme Brahman is infinite, and this conditioned Brahman is infinite.\" (Brihadaranyaka Upanishad 5.1)" },
"Divine Completeness": { "quote": "\"I am the fullness that fills all in all.\" (Ephesians 1:23)" },
"Eternal Truth": { "quote": "\"The Real cannot be created or destroyed.\" (Bhagavad Gita 2:16)" },
"Divine Presence": { "quote": "\"Whither shall I go from thy spirit? or whither shall I flee from thy presence?\" (Psalm 139:7)" },
"Absolute Love": { "quote": "\"God is love, and whoever abides in love abides in God.\" (1 John 4:16)" },
"Divine Will": { "quote": "\"Not my will, but Thine be done.\" (Luke 22:42)" },
"Supreme Good": { "quote": "\"None is good save one, that is, God.\" (Mark 10:18)" },
"Divine Beauty": { "quote": "\"One is the Beautiful, in whom all things beautiful are contained.\" (Plotinus, Enneads)" },
"Infinite Power": { "quote": "\"With God all things are possible.\" (Matthew 19:26)" },
"Divine Wisdom": { "quote": "\"The wisdom that comes from above is first pure, then peaceable.\" (James 3:17)" },
"Eternal Life": { "quote": "\"This is eternal life, that they know you, the only true God.\" (John 17:3)" },
"Divine Order": { "quote": "\"He has made everything beautiful in its time.\" (Ecclesiastes 3:11)" },
"Absolute Peace": { "quote": "\"Peace I leave with you; my peace I give you.\" (John 14:27)" }
}
