{
"Nature of Divine Love": { "quote": "\"God is love, and whoever abides in love abides in God, and God abides in him.\" (1 John 4:16)" },
"Universal Love": { "quote": "\"May all beings be happy. May all beings be peaceful. May all beings be liberated.\" (Metta Bhavana)" },
"Love's Essence": { "quote": "\"Love is the essence of all religion.\" (Rumi)" },
"Divine Union": { "quote": "\"The soul in unity with the Divine becomes a flood of pure and perfect Love.\" (Meister Eckhart)" },
"Boundless Love": { "quote": "\"The love of God is broader than the measures of the mind.\" (Frederick William Faber)" },
"Love's Power": { "quote": "\"Love is the strongest force the world possesses.\" (Mahatma Gandhi)" },
"Sacred Love": { "quote": "\"When the power of love overcomes the love of power, the world will know peace.\" (Jimi Hendrix)" },
"Love's Wisdom": { "quote": "\"Where there is love there is life.\" (Mahatma Gandhi)" },
"Cosmic Love": { "quote": "\"Love is the force that transforms and improves the Soul of the World.\" (Paulo Coelho)" },
"Divine Grace": { "quote": "\"Divine love is grace descending upon soul.\" (Sri Aurobindo)" },
"Love's Manifestation": { "quote": "\"The entire universe is held together by the power of divine love.\" (Paramahansa Yogananda)" },
"Love's Expression": { "quote": "\"Love and do what you will.\" (Saint Augustine)" },
"Eternal Love": { "quote": "\"I have loved you with an everlasting love.\" (Jeremiah 31:3)" },
"Love's Sacrifice": { "quote": "\"Greater love has no one than this: to lay down one's life for one's friends.\" (John 15:13)" },
"Love's Practice": { "quote": "\"Love your neighbor as yourself.\" (Mark 12:31)" },
"Transcendent Love": { "quote": "\"Divine love transcends the body, mind, and intellect.\" (Bhagavata Purana)" },
"Love's Presence": { "quote": "\"Wherever there is love, there is God.\" (Mother Teresa)" },
"Love's Mystery": { "quote": "\"The mystery of divine love can only be known through experience.\" (Ramakrishna)" },
"Love's Path": { "quote": "\"The way of love is not a subtle argument. The door there is devastation.\" (Rumi)" },
"Love's Unity": { "quote": "\"In love, all the contradictions of existence merge themselves.\" (Rabindranath Tagore)" },
"Love's Liberation": { "quote": "\"Love liberates the soul from the bondage of ignorance.\" (Swami Vivekananda)" },
"Love's Transformation": { "quote": "\"Divine love transforms the lover into the beloved.\" (Ibn Arabi)" },
"Love's Wisdom": { "quote": "\"To love another person is to see the face of God.\" (Victor Hugo)" },
"Love's Service": { "quote": "\"Service to humanity is service to God.\" (Sathya Sai Baba)" },
"Love's Attributes": { "quote": "\"Love is patient, love is kind... Love never fails.\" (1 Corinthians 13:4,8)" },
"Love's Reality": { "quote": "\"Love is the reality, and love is the manifestation.\" (Thich Nhat Hanh)" },
"Love's Purpose": { "quote": "\"The purpose of life is to be radiantly alive and love.\" (Sri Nisargadatta Maharaj)" },
"Love's Completion": { "quote": "\"In divine love lies the completion of human evolution.\" (Pierre Teilhard de Chardin)" },
"Love's Truth": { "quote": "\"Truth without love is brutality, and love without truth is hypocrisy.\" (Warren W. Wiersbe)" },
"Love's Infinity": { "quote": "\"Divine love is infinite love, knowing no boundaries or limitations.\" (Swami Sivananda)" }
}
