{
"Spiritual Evolution": { "quote": "\"Be perfect, therefore, as your heavenly Father is perfect.\" (Matthew 5:48)" },
"Divine Transformation": { "quote": "\"We are being transformed into his image with ever-increasing glory.\" (2 Corinthians 3:18)" },
"Mystical Ascent": { "quote": "\"The soul progresses from station to station until it reaches the Presence of God.\" (Ibn Arabi)" },
"Sacred Development": { "quote": "\"From the unreal lead me to the real, from darkness lead me to light.\" (Brihadaranyaka Upanishad 1.3.28)" },
"Spiritual Progress": { "quote": "\"Step by step let the mortal arrive at the Divine.\" (Rig Veda 1.4.5)" },
"Divine Unfolding": { "quote": "\"The seed becomes the tree; the soul becomes Divine.\" (Ramakrishna)" },
"Sacred Journey": { "quote": "\"The path of the just is as the shining light, that shineth more and more unto the perfect day.\" (Proverbs 4:18)" },
"Inner Awakening": { "quote": "\"Awake, arise, and stop not till the goal is reached.\" (Katha Upanishad 1.3.14)" },
"Divine Alchemy": { "quote": "\"God and the soul are like the iron and fire in a forge - the fire transforms the iron into itself.\" (Meister Eckhart)" },
"Spiritual Birth": { "quote": "\"Unless one is born again, he cannot see the kingdom of God.\" (John 3:3)" },
"Sacred Evolution": { "quote": "\"Evolution is the additional proof of God.\" (Teilhard de Chardin)" },
"Divine Growth": { "quote": "\"Grow in grace and knowledge of our Lord.\" (2 Peter 3:18)" },
"Mystical Development": { "quote": "\"The soul must pass through seven mansions before reaching perfect union with God.\" (Teresa of Avila)" },
"Sacred Transformation": { "quote": "\"As fire turns iron into itself when it penetrates it, so God transforms the soul into Himself.\" (John of the Cross)" },
"Divine Education": { "quote": "\"Knowledge of Self is knowledge of God.\" (Al-Ghazali)" },
"Spiritual Refinement": { "quote": "\"Polish the mirror of your heart to reflect divine light.\" (Rumi)" },
"Divine Integration": { "quote": "\"You are That which you seek.\" (Sri Nisargadatta Maharaj)" },
"Sacred Process": { "quote": "\"First the blade, then the ear, then the full grain in the ear.\" (Mark 4:28)" },
"Divine Elevation": { "quote": "\"Rise, transcend thyself.\" (Sri Aurobindo)" },
"Spiritual Alchemy": { "quote": "\"Transform the lead of personality into the gold of consciousness.\" (Carl Jung)" },
"Divine Unveiling": { "quote": "\"Gradually, the veil is lifted until the Real is seen.\" (Al-Hujwiri)" },
"Sacred Advancement": { "quote": "\"Moving from multiplicity to Unity.\" (Plotinus)" },
"Divine Flowering": { "quote": "\"Like a lotus flower that grows out of the mud and blossoms above the water.\" (Buddha)" },
"Spiritual Ascension": { "quote": "\"The ascent of the soul to the divine union.\" (Gregory of Nyssa)" },
"Divine Path": { "quote": "\"The path of spiritual progress is a path of growing awakening.\" (Swami Vivekananda)" },
"Sacred Becoming": { "quote": "\"What we are is becoming what we are to be.\" (Sri Aurobindo)" },
"Divine Completion": { "quote": "\"He who began a good work in you will carry it on to completion.\" (Philippians 1:6)" },
"Mystical Union": { "quote": "\"The drop merges into the ocean and becomes the ocean itself.\" (Kabir)" },
"Spiritual Perfection": { "quote": "\"Be ye therefore perfect, even as your Father in heaven is perfect.\" (Matthew 5:48)" },
"Divine Realization": { "quote": "\"That which is within you is that which is within all things.\" (Upanishads)" }
}
