{
"Universal Law": { "quote": "\"Dharma sustains the world order and moral law of the universe.\" (Rig Veda 1.164.50)" },
"Eternal Law": { "quote": "\"The law of the Lord is perfect, refreshing the soul.\" (Psalm 19:7)" },
"Natural Law": { "quote": "\"Heaven and Earth and all things follow Tao. Tao follows what is natural.\" (Tao Te Ching 25)" },
"Divine Command": { "quote": "\"This is My commandment, that you love one another as I have loved you.\" (John 15:12)" },
"Sacred Law": { "quote": "\"We have revealed to you the Book in truth, confirming what came before it of the Scripture.\" (Quran 5:48)" },
"Moral Law": { "quote": "\"The moral law is written in their hearts, their consciences bearing witness.\" (Romans 2:15)" },
"Cosmic Law": { "quote": "\"Rita (cosmic order) is the foundation of all existence.\" (Atharva Veda 4.1.3)" },
"Divine Justice": { "quote": "\"Righteousness and justice are the foundation of Your throne.\" (Psalm 89:14)" },
"Divine Ordinance": { "quote": "\"Follow the way of Dharma as laid down in the scriptures.\" (Bhagavad Gita 16:24)" },
"Divine Precepts": { "quote": "\"Your precepts are my delight, they are my counselors.\" (Psalm 119:24)" },
"Divine Covenant": { "quote": "\"I will put my law within them, and I will write it on their hearts.\" (Jeremiah 31:33)" },
"Divine Guidance": { "quote": "\"This is the path of Allah. Let him who will, take the right path to his Lord.\" (Quran 76:29)" },
"Divine Authority": { "quote": "\"All authority in heaven and on earth has been given to Me.\" (Matthew 28:18)" },
"Divine Order": { "quote": "\"God is not a God of disorder but of peace.\" (1 Corinthians 14:33)" },
"Divine Wisdom": { "quote": "\"The law of the wise is a fountain of life.\" (Proverbs 13:14)" },
"Sacred Rules": { "quote": "\"These are the laws, regulations and instructions.\" (Leviticus 26:46)" },
"Divine Decree": { "quote": "\"What Allah has decreed must come to pass.\" (Quran 33:38)" },
"Divine Statutes": { "quote": "\"Blessed are those who keep His statutes and seek Him with all their heart.\" (Psalm 119:2)" },
"Divine Ethics": { "quote": "\"Practice righteousness, speak the truth, do not harm any living being.\" (Buddha, Dhammapada)" },
"Holy Commandments": { "quote": "\"If you love Me, keep My commandments.\" (John 14:15)" },
"Divine Principles": { "quote": "\"The Tao principle is what happens of itself.\" (Tao Te Ching 51)" },
"Sacred Duties": { "quote": "\"Better is one's own dharma though imperfect, than another's dharma well-performed.\" (Bhagavad Gita 3:35)" },
"Divine Judgment": { "quote": "\"The judgments of the Lord are true and righteous altogether.\" (Psalm 19:9)" },
"Divine Constitution": { "quote": "\"The constitution of the universe is hidden in the Vedas.\" (Upanishads)" },
"Divine Governance": { "quote": "\"The kingdom of God does not come with observation.\" (Luke 17:20)" },
"Sacred Obligations": { "quote": "\"Fulfill your covenant with Me, I shall fulfill My covenant with you.\" (Quran 2:40)" },
"Divine Discipline": { "quote": "\"For whom the Lord loves He disciplines.\" (Hebrews 12:6)" },
"Divine Standards": { "quote": "\"Be holy, for I am holy.\" (1 Peter 1:16)" },
"Divine Path": { "quote": "\"This is the way, walk in it.\" (Isaiah 30:21)" },
"Divine Regulations": { "quote": "\"These are the regulations, laws and decrees.\" (Deuteronomy 6:1)" }
}
