{
"Nature of Potential": { "quote": "Be perfect, therefore, as your heavenly Father is perfect. (Matthew 5:48)" },
"Awakening": { "quote": "The kingdom of heaven is within you. (Luke 17:21)" },
"Inner Divinity": { "quote": "Aham Brahmasmi - I am Brahman. (Brihadaranyaka Upanishad 1.4.10)" },
"Spiritual Evolution": { "quote": "The goal of evolution is self-realization in the Divine. (Sri Aurobindo, The Life Divine)" },
"Divine Spark": { "quote": "The light of the divine dwells within the heart of all beings. (Bhagavad Gita 15:15)" },
"Sacred Development": { "quote": "Until Christ is formed in you. (Galatians 4:19)" },
"Transformation": { "quote": "Be transformed by the renewing of your mind. (Romans 12:2)" },
"Higher Self": { "quote": "Know thyself and thou shalt know the universe and God. (Ancient Egyptian Proverb)" },
"Divine Union": { "quote": "That they all may be one; as thou, Father, art in me, and I in thee. (John 17:21)" },
"Spiritual Growth": { "quote": "The path of the righteous is like the morning sun, shining ever brighter till the full light of day. (Proverbs 4:18)" },
"Soul Evolution": { "quote": "The soul moves from darkness to light, from death to immortality. (Brihadaranyaka Upanishad 1.3.28)" },
"Divine Qualities": { "quote": "By divine qualities one attains liberation. (Bhagavad Gita 16:5)" },
"Sacred Journey": { "quote": "The journey of a thousand miles begins with a single step. (Tao Te Ching, Chapter 64)" },
"Spiritual Alchemy": { "quote": "Transform the base metal of self into the gold of spirit. (Rumi)" },
"Divine Inheritance": { "quote": "We are heirs of God and co-heirs with Christ. (Romans 8:17)" },
"Sacred Purpose": { "quote": "Before I formed you in the womb I knew you. (Jeremiah 1:5)" },
"Divine Essence": { "quote": "Your true nature is pure awareness. (Yoga Sutras 1.3)" },
"Spiritual Capacity": { "quote": "Greater things than these shall you do. (John 14:12)" },
"Divine Reflection": { "quote": "We all reflect the Lord's glory and are being transformed into his image. (2 Corinthians 3:18)" },
"Sacred Power": { "quote": "The kingdom of God comes not with observation but with power. (Luke 17:20)" },
"Inner Light": { "quote": "Let your light shine before others. (Matthew 5:16)" },
"Divine Seeds": { "quote": "The seed of divinity lies dormant in every soul. (Meister Eckhart)" },
"Spiritual Unfoldment": { "quote": "Like a lotus flower that grows out of the mud and blossoms above the water. (Buddhist Teaching)" },
"Divine Becoming": { "quote": "What we are is God's gift to us. What we become is our gift to God. (Eleanor Powell)" },
"Sacred Evolution": { "quote": "Evolution is God's way of creating. (Pierre Teilhard de Chardin)" },
"Divine Integration": { "quote": "As above, so below; as within, so without. (Hermes Trismegistus)" },
"Spiritual Activation": { "quote": "Awake, O sleeper, and arise from the dead, and Christ will shine on you. (Ephesians 5:14)" },
"Divine Expression": { "quote": "Let that mind be in you which was also in Christ Jesus. (Philippians 2:5)" },
"Sacred Destiny": { "quote": "You are gods, children of the Most High. (Psalm 82:6)" },
"Divine Completion": { "quote": "Be ye therefore perfect, even as your Father which is in heaven is perfect. (Matthew 5:48)" }
}
