{
  "Purpose of Creation": {
    "quote": "\"Indeed, I did not create the jinn and mankind except that they should worship Me.\" (Quran 51:56)"
  },
  "Divine Intent": {
    "quote": "\"For I know the plans I have for you, declares the Lord, plans to prosper you and not to harm you.\" (Jeremiah 29:11)"
  },
  "Cosmic Purpose": {
    "quote": "\"The purpose of creation is the mighty task of manifesting the Divine Light, Life and Love in physical form.\" (Sri Aurobindo)"
  },
  "Soul's Purpose": {
    "quote": "\"The soul has been given its own hearing to hear what is hidden.\" (Rumi)"
  },
  "Sacred Mission": {
    "quote": "\"This is the true joy in life, being used for a purpose recognized by yourself as a mighty one.\" (George Bernard Shaw)"
  },
  "Divine Will": {
    "quote": "\"Not my will, but yours be done.\" (Luke 22:42)"
  },
  "Spiritual Evolution": {
    "quote": "\"The goal of evolution is self-realization.\" (Paramahansa Yogananda)"
  },
  "Universal Purpose": {
    "quote": "\"Everything in the universe has a purpose. There are no mistakes, no coincidences.\" (Swami Sivananda)"
  },
  "Life's Meaning": {
    "quote": "\"The meaning of life is to find your gift. The purpose of life is to give it away.\" (Pablo Picasso)"
  },
  "Divine Plan": {
    "quote": "\"In all your ways acknowledge Him, and He shall direct your paths.\" (Proverbs 3:6)"
  },
  "Spiritual Goal": {
    "quote": "\"The goal of spiritual practice is full human potential.\" (Dalai Lama)"
  },
  "Sacred Function": {
    "quote": "\"Each soul has its own particular mission in life.\" (Martin Buber)"
  },
  "Divine Direction": {
    "quote": "\"Your path is illuminated by the light, yet darkness lets the stars shine bright.\" (Rumi)"
  },
  "Higher Calling": {
    "quote": "\"Everyone has been made for some particular work, and the desire for that work has been put in every heart.\" (Rumi)"
  },
  "Eternal Purpose": {
    "quote": "\"From eternity to eternity I am God.\" (Isaiah 43:13)"
  },
  "Sacred Destiny": {
    "quote": "\"Before I formed you in the womb I knew you.\" (Jeremiah 1:5)"
  },
  "Divine Intention": {
    "quote": "\"God moves in a mysterious way, His wonders to perform.\" (William Cowper)"
  },
  "Spiritual Purpose": {
    "quote": "\"The purpose of our lives is to give birth to the best which is within us.\" (Marianne Williamson)"
  },
  "Sacred Journey": {
    "quote": "\"The spiritual journey is the unlearning of fear and the acceptance of love.\" (Marianne Williamson)"
  },
  "Divine Mission": {
    "quote": "\"Your purpose in life is to find your purpose and give your whole heart and soul to it.\" (Buddha)"
  },
  "Ultimate Goal": {
    "quote": "\"The ultimate goal of life is self-realization.\" (Ramana Maharshi)"
  },
  "Sacred Purpose": {
    "quote": "\"Your purpose is not just to do what your parents say, what your teachers say, what society says, but to find your real purpose.\" (Thich Nhat Hanh)"
  },
  "Divine Path": {
    "quote": "\"There are many paths to enlightenment. Be sure to take one with a heart.\" (Lao Tzu)"
  },
  "Spiritual Direction": {
    "quote": "\"Let yourself be silently drawn by the strange pull of what you really love.\" (Rumi)"
  },
  "Sacred Role": {
    "quote": "\"You have a unique message to deliver, a unique song to sing, a unique act of love to bestow.\" (John Powell)"
  },
  "Divine Calling": {
    "quote": "\"Your calling is where your deepest joy meets the world's deepest need.\" (Frederick Buechner)"
  },
  "Life Purpose": {
    "quote": "\"The two most important days in your life are the day you are born and the day you find out why.\" (Mark Twain)"
  },
  "Sacred Work": {
    "quote": "\"Work is love made visible.\" (Kahlil Gibran)"
  },
  "Divine Assignment": {
    "quote": "\"To everything there is a season, and a time to every purpose under heaven.\" (Ecclesiastes 3:1)"
  },
  "Spiritual Mission": {
    "quote": "\"Your vision will become clear only when you can look into your own heart.\" (Carl Jung)"
  }
}
