{
  "Lover": {
    "quote": "\"I am my beloved's and my beloved is mine.\" (Song of Solomon 6:3)"
  },
  "Beloved": {
    "quote": "\"Thou hast ravished my heart, my sister, my spouse.\" (Song of Solomon 4:9)"
  },
  "Divine Romance": {
    "quote": "\"The soul, light as a feather, fluid as water, innocent as a child, responds to every movement of grace like a floating balloon.\" (Rumi)"
  },
  "Sacred Union": {
    "quote": "\"In love, nothing exists between heart and heart.\" (Rumi)"
  },
  "Eternal Beloved": {
    "quote": "\"Krishna alone is the lover of all souls.\" (Chaitanya Charitamrita)"
  },
  "Divine Attraction": {
    "quote": "\"Draw me after you and let us run together!\" (Song of Solomon 1:4)"
  },
  "Mystic Love": {
    "quote": "\"Love is the bridge between you and everything.\" (Rumi)"
  },
  "Divine Intimacy": {
    "quote": "\"Closer is He than breathing, and nearer than hands and feet.\" (Tennyson, drawing from Islamic mysticism)"
  },
  "Sacred Heart": {
    "quote": "\"The heart of the devotee is the temple of the Beloved.\" (Kabir)"
  },
  "Divine Yearning": {
    "quote": "\"As the deer pants for streams of water, so my soul pants for you, my God.\" (Psalm 42:1)"
  },
  "Divine Union": {
    "quote": "\"That which is the finest essence – this whole world has that as its soul. That is Reality. That is Atman. That art thou.\" (Chandogya Upanishad)"
  },
  "Divine Ecstasy": {
    "quote": "\"In a lover's heart burns continuously the fire of ecstasy.\" (Rumi)"
  },
  "Divine Beauty": {
    "quote": "\"I have seen the face of the Beloved in every flower.\" (Hafez)"
  },
  "Divine Separation": {
    "quote": "\"The pain of separation is the school of love.\" (Bayazid Bistami)"
  },
  "Divine Longing": {
    "quote": "\"O Lord, all my longing is before you.\" (Psalm 38:9)"
  },
  "Sacred Passion": {
    "quote": "\"Set me as a seal upon your heart, for love is strong as death.\" (Song of Solomon 8:6)"
  },
  "Divine Embrace": {
    "quote": "\"In His love He wraps me, holds me, and embraces me.\" (Julian of Norwich)"
  },
  "Eternal Love": {
    "quote": "\"I have loved you with an everlasting love.\" (Jeremiah 31:3)"
  },
  "Divine Courtship": {
    "quote": "\"Therefore I am now going to allure her; I will lead her into the wilderness and speak tenderly to her.\" (Hosea 2:14)"
  },
  "Sacred Connection": {
    "quote": "\"The threads of love that connect us cannot be broken by time and distance.\" (Rumi)"
  }
}
