{
  "Preparation": {
    "quote": "\"Prepare ye the way of the Lord, make his paths straight.\" (Matthew 3:3)"
  },
  "Purification": {
    "quote": "\"Blessed are the pure in heart, for they shall see God.\" (Matthew 5:8)"
  },
  "Awakening": {
    "quote": "\"Awake, O sleeper, and arise from the dead, and Christ will shine on you.\" (Ephesians 5:14)"
  },
  "Detachment": {
    "quote": "\"Let go of all things and you will find all things.\" (Meister Eckhart)"
  },
  "Emptying": {
    "quote": "\"Empty yourself of everything. Let the mind rest at peace.\" (Tao Te Ching 16)"
  },
  "Surrender": {
    "quote": "\"Not my will, but yours be done.\" (Luke 22:42)"
  },
  "Dark Night": {
    "quote": "\"The dark night of the soul comes just before revelation.\" (St. John of the Cross)"
  },
  "Illumination": {
    "quote": "\"The light shines in the darkness, and the darkness has not overcome it.\" (John 1:5)"
  },
  "Transformation": {
    "quote": "\"Be transformed by the renewal of your mind.\" (Romans 12:2)"
  },
  "Integration": {
    "quote": "\"As above, so below; as within, so without.\" (Hermes Trismegistus)"
  },
  "Annihilation": {
    "quote": "\"Die before you die.\" (Prophet Muhammad)"
  },
  "Dissolution": {
    "quote": "\"Like salt dissolving in water, the ego dissolves in the Divine.\" (Ramakrishna)"
  },
  "Absorption": {
    "quote": "\"The drop slips into the shining sea.\" (Kabir)"
  },
  "Realization": {
    "quote": "\"I am Brahman - Aham Brahmasmi.\" (Brihadaranyaka Upanishad)"
  },
  "Stabilization": {
    "quote": "\"Established in Being, perform action.\" (Bhagavad Gita 2:48)"
  },
  "Embodiment": {
    "quote": "\"Let this mind be in you which was also in Christ Jesus.\" (Philippians 2:5)"
  },
  "Service": {
    "quote": "\"They serve all beings as expressions of the One.\" (Upanishads)"
  },
  "Radiation": {
    "quote": "\"Let your light so shine before men.\" (Matthew 5:16)"
  },
  "Perpetual Union": {
    "quote": "\"Abide in me, and I in you.\" (John 15:4)"
  },
  "Perfect Union": {
    "quote": "\"I live, yet not I, but Christ lives in me.\" (Galatians 2:20)"
  }
}
