{
    "Cosmic Play": {
        "quote": "The world is Brahman's play (lila), in which the One becomes many and the many return to the One. (Vedanta Sutra)"
    },
    "Playful Creation": {
        "quote": "Like a child at play, the Divine Mother creates, preserves, and dissolves the worlds. (Ramakrishna)"
    },
    "Divine Dance": {
        "quote": "The cosmos is the dance of Shiva, whose endless play creates and destroys universes. (Kularnava Tantra)"
    },
    "Spontaneous Joy": {
        "quote": "The divine play springs from the overflow of God's perfect bliss. (Sri Aurobindo, The Life Divine)"
    },
    "Creative Play": {
        "quote": "Wisdom was daily His delight, rejoicing always before Him, rejoicing in His inhabited world and delighting in the human race. (Proverbs 8:30-31)"
    },
    "Play of Consciousness": {
        "quote": "All existence is the sport of consciousness playing with its own dynamic force. (Kashmir Shaivism)"
    },
    "Divine Sport": {
        "quote": "The universe is the sport (krida) of the Supreme Being, who plays in infinite ways. (Yoga Vasistha)"
    },
    "Playful Wisdom": {
        "quote": "Before creation, primordial wisdom played like a child before the face of God. (Zohar)"
    },
    "Cosmic Game": {
        "quote": "The entire manifestation is a game that consciousness plays with itself. (Vijnana Bhairava Tantra)"
    },
    "Divine Entertainment": {
        "quote": "The world is maintained for the entertainment of the Divine. (Brahma Sutra Commentary)"
    },
    "Play of Forces": {
        "quote": "The universe is the play of divine forces in their cosmic dance of creation. (Abhinavagupta)"
    },
    "Playful Manifestation": {
        "quote": "Through play, the Divine manifests its infinite possibilities. (Baul Tradition)"
    },
    "Sacred Play": {
        "quote": "In sacred play, the divine and human realms intermingle. (Huizinga, Homo Ludens)"
    },
    "Eternal Game": {
        "quote": "Time is the field of the eternal game of the Divine. (Sri Aurobindo)"
    },
    "Divine Drama": {
        "quote": "All the world's a stage, and all creation is the divine drama. (Medieval Mysticism)"
    },
    "Play of Light": {
        "quote": "The cosmos is the play of divine light manifesting as all forms. (Illuminationist Philosophy)"
    },
    "Spontaneous Creation": {
        "quote": "Creation arises spontaneously as the play of divine freedom. (Kashmiri Shaivism)"
    },
    "Divine Delight": {
        "quote": "The world emerges from the overflow of divine delight in play. (Upanishadic Teaching)"
    },
    "Cosmic Dance": {
        "quote": "In his dance of play, Shiva creates and destroys worlds. (Nataraja Tradition)"
    },
    "Play of Maya": {
        "quote": "The world is the play of maya, the divine power of creative illusion. (Advaita Vedanta)"
    }
}
