{
"Nature of Silence": { "quote": "Be still, and know that I am God. (Psalm 46:10)" },
"Sacred Stillness": { "quote": "Silence is the language of God, all else is poor translation. (Rumi)" },
"Inner Quiet": { "quote": "The quieter you become, the more you can hear. (Ram Dass)" },
"Contemplative Space": { "quote": "In silence and hope shall be your strength. (Isaiah 30:15)" },
"Divine Presence": { "quote": "Silence is not an absence but a presence. (Anne D. LeClaire)" },
"Mystical Silence": { "quote": "Words cannot express the joy of the soul in union through silence. (John of the Cross)" },
"Silent Wisdom": { "quote": "There is more wisdom in silence than in all the speech of men. (Thomas Merton)" },
"Empty Fullness": { "quote": "Empty yourself of everything. Let the mind become still. (Tao Te Ching 16)" },
"Sacred Void": { "quote": "God is the silent void where echoes dwell. (Meister Eckhart)" },
"Silent Communion": { "quote": "The heart speaks to God through silence. (Padre Pio)" },
"Depths of Silence": { "quote": "In the depth of silence, the voice of God is heard. (Mother Teresa)" },
"Transformative Silence": { "quote": "Silence is the sleep that nourishes wisdom. (Francis Bacon)" },
"Divine Communication": { "quote": "God speaks in the silence of the heart. (Mother Teresa)" },
"Silent Revelation": { "quote": "The eternal silence of infinite spaces. (Blaise Pascal)" },
"Contemplative Path": { "quote": "The path to divinity leads through the gateway of silence. (Ramana Maharshi)" },
"Silent Knowledge": { "quote": "What we cannot speak about we must pass over in silence. (Ludwig Wittgenstein)" },
"Sacred Space": { "quote": "Silence is the dwelling place of the eternal Word. (John of the Cross)" },
"Inner Peace": { "quote": "Peace comes from within. Do not seek it without. (Buddha)" },
"Silent Witness": { "quote": "In silence, the witness is revealed. (Upanishads)" },
"Divine Expression": { "quote": "Silence is the ultimate expression of power. (Lao Tzu)" },
"Mystical Union": { "quote": "In silence we find union with the Divine. (Teresa of Avila)" },
"Silent Truth": { "quote": "Truth has no language, silence is its speech. (Ramana Maharshi)" },
"Sacred Pause": { "quote": "Between stimulus and response there is a space. In that space is our power. (Viktor Frankl)" },
"Divine Listening": { "quote": "Listen to the silence. It has so much to say. (Rumi)" },
"Contemplative State": { "quote": "Silence is not mere negation of speech. It is fullness, not emptiness. (Sri Aurobindo)" },
"Silent Reality": { "quote": "Reality manifests itself in silence. (Meister Eckhart)" },
"Inner Sanctuary": { "quote": "The kingdom of heaven is within you. (Luke 17:21)" },
"Sacred Emptiness": { "quote": "Empty yourself and let the divine fill you. (Meister Eckhart)" },
"Silent Awareness": { "quote": "In silence there is eloquence. (Rumi)" },
"Divine Stillness": { "quote": "Be still and know. (Psalm 46:10)" }
}
