{
    "Truth Essence": { "quote": "\"Truth is one, paths are many.\" (Mahatma Gandhi)" },
    "Eternal Truth": { "quote": "\"Heaven and earth will pass away, but my words will never pass away.\" (Matthew 24:35)" },
    "Truth Nature": { "quote": "\"Truth is that which doesn't change.\" (Yoga Sutras of Patanjali 1.13)" },
    "Ultimate Reality": { "quote": "\"The Real cannot be new, the Real cannot be destroyed.\" (Bhagavad Gita 2:16)" },
    "Truth Revelation": { "quote": "\"And you shall know the truth, and the truth shall make you free.\" (John 8:32)" },
    "Divine Wisdom": { "quote": "\"Wisdom is radiant and unfading.\" (Wisdom of Solomon 6:12)" },
    "Truth Consciousness": { "quote": "\"Truth is the dwelling place of the Eternal.\" (Upanishads)" },
    "Sacred Knowledge": { "quote": "\"Knowledge is the wing wherewith we fly to Heaven.\" (Shakespeare, Henry VI)" },
    "Truth Path": { "quote": "\"I am the way, the truth, and the life.\" (John 14:6)" },
    "Absolute Truth": { "quote": "\"There is nothing higher than Truth.\" (Mundaka Upanishad 3.1.6)" },
    "Truth Principles": { "quote": "\"The truth of truths is love.\" (Meister Eckhart)" },
    "Truth Manifestation": { "quote": "\"Truth manifests itself in various forms to different seekers.\" (Ramakrishna)" },
    "Divine Understanding": { "quote": "\"Understanding is the reward of faith.\" (Augustine of Hippo)" },
    "Truth Recognition": { "quote": "\"The eye through which I see God is the same eye through which God sees me.\" (Meister Eckhart)" },
    "Eternal Law": { "quote": "\"The Dharma is the eternal law that upholds the universe.\" (Buddha)" },
    "Truth Experience": { "quote": "\"Experience of Truth is beyond mind and speech.\" (Ramana Maharshi)" },
    "Divine Light": { "quote": "\"God is light, and in Him there is no darkness at all.\" (1 John 1:5)" },
    "Truth Realization": { "quote": "\"Self-realization is the knowing in all parts of body, mind, and soul that you are now in possession of the kingdom of God.\" (Paramahansa Yogananda)" },
    "Sacred Truth": { "quote": "\"Every sacred truth is the living power of God.\" (Emanuel Swedenborg)" },
    "Truth Essence": { "quote": "\"Truth is the substance of all existence.\" (Swami Vivekananda)" },
    "Divine Word": { "quote": "\"In the beginning was the Word, and the Word was with God, and the Word was God.\" (John 1:1)" },
    "Truth State": { "quote": "\"Truth is a pathless land.\" (Jiddu Krishnamurti)" },
    "Eternal Wisdom": { "quote": "\"Wisdom was with God from the beginning.\" (Proverbs 8:22)" },
    "Truth Vision": { "quote": "\"When the eye is unobstructed, the result is sight.\" (Lao Tzu)" },
    "Divine Knowledge": { "quote": "\"Knowledge of Truth is knowledge of God.\" (Al-Ghazali)" },
    "Truth Existence": { "quote": "\"Truth alone triumphs, not falsehood.\" (Mundaka Upanishad 3.1.6)" },
    "Sacred Presence": { "quote": "\"The kingdom of God is within you.\" (Luke 17:21)" },
    "Truth Identity": { "quote": "\"Truth is the soul of existence.\" (Sri Aurobindo)" },
    "Divine Revelation": { "quote": "\"Every divine revelation is the unveiling of deep truth.\" (Paul Tillich)" },
    "Truth Reality": { "quote": "\"Reality is merely an illusion, albeit a very persistent one.\" (Albert Einstein)" },
"Purpose of Creation": { "quote": "I did not create the jinn and mankind except to worship Me. (Quran 51:56)" },
"Divine Will": { "quote": "Not my will, but Yours be done. (Luke 22:42)" },
"Cosmic Plan": { "quote": "For I know the plans I have for you, declares the Lord, plans for welfare and not for evil, to give you a future and a hope. (Jeremiah 29:11)" },
"Sacred Design": { "quote": "In the beginning was the Word, and the Word was with God, and the Word was God. (John 1:1)" },
"Divine Purpose": { "quote": "Everything has been created with a purpose. (Bhagavad Gita 3:42)" },
"Universal Order": { "quote": "The Tao gave birth to One, One gave birth to Two, Two gave birth to Three, Three gave birth to all things. (Tao Te Ching 42)" },
"Divine Direction": { "quote": "Allah intends for you ease and does not intend for you hardship. (Quran 2:185)" },
"Sacred Movement": { "quote": "As above, so below; as within, so without. (Hermes Trismegistus, Emerald Tablet)" },
"Eternal Purpose": { "quote": "From Him and through Him and to Him are all things. (Romans 11:36)" },
"Divine Wisdom": { "quote": "But wisdom is justified by all her children. (Luke 7:35)" },
"Sacred Evolution": { "quote": "All things work together for good to those who love God. (Romans 8:28)" },
"Divine Guidance": { "quote": "Guide us to the straight path. (Quran 1:6)" },
"Cosmic Intent": { "quote": "The universe is not only queerer than we suppose, but queerer than we can suppose. (J.B.S. Haldane)" },
"Sacred Flow": { "quote": "The wind blows where it wishes, and you hear its sound, but you do not know where it comes from or where it goes. (John 3:8)" },
"Divine Plan": { "quote": "For everything there is a season, and a time for every matter under heaven. (Ecclesiastes 3:1)" },
"Universal Law": { "quote": "As you sow, so shall you reap. (Galatians 6:7)" },
"Sacred Time": { "quote": "To everything there is a season, and a time to every purpose under heaven. (Ecclesiastes 3:1)" },
"Divine Orchestration": { "quote": "In all your ways acknowledge Him, and He will make straight your paths. (Proverbs 3:6)" },
"Cosmic Purpose": { "quote": "The purpose of life is to investigate things and know them. (Aristotle, Metaphysics)" },
"Divine Harmony": { "quote": "Everything in the universe is within you. Ask all from yourself. (Rumi)" },
"Sacred Pattern": { "quote": "God geometrizes continually. (Plato)" },
"Divine Order": { "quote": "Order is heaven's first law. (Alexander Pope)" },
"Universal Balance": { "quote": "For every action, there is an equal and opposite reaction. (Karma principle)" },
"Sacred Mission": { "quote": "Go therefore and make disciples of all nations. (Matthew 28:19)" },
"Divine Causation": { "quote": "Nothing happens without a cause. (Buddhist principle of Dependent Origination)" },
"Eternal Design": { "quote": "Before I formed you in the womb I knew you. (Jeremiah 1:5)" },
"Sacred Purpose": { "quote": "Let us make mankind in our image, in our likeness. (Genesis 1:26)" },
"Divine Unfoldment": { "quote": "He has made everything beautiful in its time. (Ecclesiastes 3:11)" },
"Cosmic Direction": { "quote": "The path of the just is as the shining light, that shineth more and more unto the perfect day. (Proverbs 4:18)" },
"Divine Blueprint": { "quote": "Your eyes saw my unformed substance; in your book were written, every one of them, the days that were formed for me. (Psalm 139:16)" }

}
