{
"Sacred Geometry": { "quote": "God eternally geometrizes. (Plato, Timaeus)" },
"Golden Ratio": { "quote": "The Divine Proportion is contained in the pentagram, symbol of life and divine harmony. (Leonardo da Vinci)" },
"Cosmic Balance": { "quote": "The universe maintains its balance through perfect symmetry. (Pythagoras)" },
"Universal Harmony": { "quote": "The harmony of the world is made manifest in Form and Number. (Johannes Kepler)" },
"Divine Order": { "quote": "He has created everything in exact measure and proportion. (Quran 54:49)" },
"Mathematical Beauty": { "quote": "Mathematics is the language with which God has written the universe. (Galileo Galilei)" },
"Natural Patterns": { "quote": "Look deep into nature, and then you will understand everything better. (Albert Einstein)" },
"Sacred Proportions": { "quote": "All things are numbers. Number is the ruler of forms and ideas. (Pythagoras)" },
"Geometric Wisdom": { "quote": "Sacred geometry is the blueprint of Creation. (Plato)" },
"Fractal Divinity": { "quote": "As above, so below; as within, so without. (Hermes Trismegistus)" },
"Symmetrical Balance": { "quote": "In perfect symmetry lies the reflection of divine order. (Vitruvius)" },
"Sacred Numbers": { "quote": "Numbers are the highest degree of knowledge. It is knowledge itself. (Plato)" },
"Divine Architecture": { "quote": "The architect must be a prophet... a prophet in the true sense of the term... if he can't see at least ten years ahead don't call him an architect. (Frank Lloyd Wright)" },
"Cosmic Patterns": { "quote": "The universe is built on a plan the profound symmetry of which is somehow present in the inner structure of our intellect. (Paul Valéry)" },
"Sacred Measure": { "quote": "God created everything by number, weight and measure. (Book of Wisdom 11:20)" },
"Divine Mathematics": { "quote": "Where there is number, there is beauty. (Proclus)" },
"Natural Order": { "quote": "Nature geometrizes universally in all her manifestations. (René Descartes)" },
"Sacred Structure": { "quote": "The laws of nature are but the mathematical thoughts of God. (Euclid)" },
"Divine Proportion": { "quote": "Without mathematics there is no art. (Luca Pacioli)" },
"Unified Field": { "quote": "Unity is plural and at minimum two. (Buckminster Fuller)" },
"Sacred Forms": { "quote": "Form follows function - that has been misunderstood. Form and function should be one, joined in a spiritual union. (Frank Lloyd Wright)" },
"Divine Reflection": { "quote": "Every natural pattern is a reflection of a divine archetype. (Plotinus)" },
"Sacred Space": { "quote": "Space is the breath of art. (Frank Lloyd Wright)" },
"Universal Constants": { "quote": "The constants of nature are the fingerprints of a universal creator. (Paul Davies)" },
"Sacred Time": { "quote": "Time itself is a perfect symmetry between past and future. (Arthur Eddington)" },
"Divine Grid": { "quote": "The grid is like the Divine Mind... the invisible made visible. (Rosalind Krauss)" },
"Sacred Resonance": { "quote": "The geometry of harmonic waves reveals the architecture of space and matter. (Hans Jenny)" },
"Divine Blueprint": { "quote": "The universe is written in mathematical language, and the letters are triangles, circles and other geometrical figures. (Galileo Galilei)" },
"Eternal Patterns": { "quote": "In sacred geometry, universal patterns of dimension demonstrate the self-organizing qualities of the universe. (Robert Lawlor)" },
"Sacred Unity": { "quote": "All things are connected by the golden thread of divine symmetry. (Keith Critchlow)" }
}
