{
"Light of Being": { "quote": "God is the Light of the heavens and the earth. (Quran 24:35)" },
"Divine Radiance": { "quote": "In thy light we see light. (Psalm 36:9)" },
"Inner Light": { "quote": "The light of the soul is the lamp of wisdom. (Bhagavad Gita 10:11)" },
"Spiritual Illumination": { "quote": "Enlightenment is the light of wisdom dawning in the darkness of ignorance. (Buddha)" },
"Light Mysticism": { "quote": "I am the light of the world. (John 8:12)" },
"Light of Wisdom": { "quote": "The light of wisdom never goes out. (Tibetan Proverb)" },
"Divine Effulgence": { "quote": "From His light emerged all creation. (Guru Granth Sahib)" },
"Eternal Light": { "quote": "The Lord shall be unto thee an everlasting light. (Isaiah 60:19)" },
"Sacred Flame": { "quote": "The divine fire burns in all things. (Heraclitus)" },
"Light of Truth": { "quote": "Truth is like the sun. You can shut it out for a time, but it ain't going away. (Elvis Presley)" },
"Primordial Light": { "quote": "Let there be light. (Genesis 1:3)" },
"Light of Consciousness": { "quote": "Consciousness is the lamp that dispels all darkness. (Upanishads)" },
"Divine Brilliance": { "quote": "The light shines in the darkness, and the darkness has not overcome it. (John 1:5)" },
"Transcendent Light": { "quote": "Beyond the darkness there is the light supreme. (Chandogya Upanishad)" },
"Light of Grace": { "quote": "By grace we are led from darkness to light. (Augustine)" },
"Illuminating Presence": { "quote": "Where there is light, there is hope. (Desmond Tutu)" },
"Divine Luminosity": { "quote": "In light there is truth, in truth there is freedom. (Rumi)" },
"Light of Knowledge": { "quote": "Knowledge is light, ignorance is darkness. (Islamic Hadith)" },
"Sacred Light": { "quote": "The light of the sacred burns in every star. (Chief Seattle)" },
"Light of Revelation": { "quote": "Divine light reveals what darkness conceals. (Kabir)" },
"Inner Radiance": { "quote": "The kingdom of God is within you. (Luke 17:21)" },
"Light of Liberation": { "quote": "When the mind is illumined, liberation is near. (Patanjali)" },
"Divine Spark": { "quote": "In every human heart there burns a divine spark. (Baal Shem Tov)" },
"Light of Guidance": { "quote": "Let your light shine before others. (Matthew 5:16)" },
"Eternal Flame": { "quote": "The eternal flame of truth cannot be extinguished. (Mahatma Gandhi)" },
"Light of Unity": { "quote": "All lights are reflections of the One Light. (Ibn Arabi)" },
"Spiritual Light": { "quote": "The spirit is the light that guides the soul. (Native American Wisdom)" },
"Light of Dharma": { "quote": "The light of dharma illuminates the path to liberation. (Buddhist Scripture)" },
"Divine Illumination": { "quote": "The divine light illuminates all beings equally. (Bhagavad Gita)" },
"Light of Creation": { "quote": "From divine light all creation springs forth. (Zohar)" }
}
