{
	    "Divine Will": {
        "quote": "\"Not my will, but yours be done.\" (Luke 22:42)"
    },
    "Divine Grace": {
        "quote": "\"By grace you have been saved through faith.\" (Ephesians 2:8)"
    },
    "Divine Law": {
        "quote": "\"Your law is truth.\" (Psalm 119:142)"
    },
    "Divine Order": {
        "quote": "\"God is not a God of confusion but of peace.\" (1 Corinthians 14:33)"
    },
  "Creation": {
    "quote": "\"In the beginning God created the heavens and the earth.\" (Genesis 1:1)"
  },
  "Evolution": {
    "quote": "\"From that, the universe was born.\" (Rig Veda 10.129)"
  },
  "Manifestation": {
    "quote": "\"As a spider produces and withdraws its web, as herbs grow from the earth, as hair grows from the body, so does everything in the universe emerge from the imperishable.\" (Mundaka Upanishad 1.1.7)"
  },
  "Sustenance": {
    "quote": "\"In Him we live and move and have our being.\" (Acts 17:28)"
  },
  "Dissolution": {
    "quote": "\"I am time, the destroyer of all.\" (Bhagavad Gita 11:32)"
  },
  "Transformation": {
    "quote": "\"Behold, I make all things new.\" (Revelation 21:5)"
  },
  "Emanation": {
    "quote": "\"As light from light, knowledge from knowledge.\" (Plotinus, Enneads V.3)"
  },
  "Integration": {
    "quote": "\"All things work together for good.\" (Romans 8:28)"
  },
  "Differentiation": {
    "quote": "\"The One becomes Many, yet remains One.\" (Upanishads)"
  },
  "Unification": {
    "quote": "\"That all of them may be one.\" (John 17:21)"
  },
  "Expansion": {
    "quote": "\"He stretches out the heavens like a canopy.\" (Isaiah 40:22)"
  },
  "Contraction": {
    "quote": "\"The universe returns to the Unmanifest.\" (Bhagavad Gita 8:18)"
  },
  "Circulation": {
    "quote": "\"The wind blows in circles, and returns to its circuits.\" (Ecclesiastes 1:6)"
  },
  "Involution": {
    "quote": "\"The spirit descends into matter.\" (Sri Aurobindo, The Life Divine)"
  },
  "Evolution": {
    "quote": "\"Matter ascending to Spirit.\" (Teilhard de Chardin, The Phenomenon of Man)"
  },
  "Maintenance": {
    "quote": "\"He upholds all things by the word of His power.\" (Hebrews 1:3)"
  },
  "Progression": {
    "quote": "\"From glory to glory.\" (2 Corinthians 3:18)"
  },
  "Cycles": {
    "quote": "\"To everything there is a season.\" (Ecclesiastes 3:1)"
  },
  "Order": {
    "quote": "\"God is not the author of confusion.\" (1 Corinthians 14:33)"
  },
  "Development": {
    "quote": "\"First the blade, then the ear, then the full grain in the ear.\" (Mark 4:28)"
  }
}
