{
  "Creation Force": {
    "quote": "In the beginning God created the heavens and the earth. The earth was formless and void, and darkness was over the surface of the deep. (Genesis 1:1-2)"
  },
  "Prana": {
    "quote": "Prana is the vital force that pervades the whole cosmos; it is the link between matter and energy. (Upanishads)"
  },
  "Holy Spirit": {
    "quote": "And the Spirit of God was hovering over the waters, bringing forth creation. (Genesis 1:2)"
  },
  "Qi": {
    "quote": "Qi is the force that animates all things, flowing between heaven and earth. (Traditional Chinese Medicine)"
  },
  "Kundalini": {
    "quote": "The serpent power rises through the chakras, awakening divine consciousness. (Yoga Sutras)"
  },
  "Divine Love": {
    "quote": "Love is the force that transforms and improves the Soul of the World. (Paulo Coelho, The Alchemist)"
  },
  "Dharma": {
    "quote": "Dharma sustains the universe; it is the cosmic force of righteousness. (Bhagavad Gita)"
  },
  "Logos": {
    "quote": "In the beginning was the Logos, and the Logos was with God, and the Logos was God. (John 1:1)"
  },
  "Karma": {
    "quote": "As you sow, so shall you reap - the cosmic force of cause and effect. (Brihadaranyaka Upanishad)"
  },
  "Shakti": {
    "quote": "Shakti is the primordial cosmic energy and the divine power that moves through all creation. (Devi Mahatmya)"
  },
  "Divine Will": {
    "quote": "Thy will be done, on earth as it is in heaven. (Matthew 6:10)"
  },
  "Tao": {
    "quote": "The Tao is like a great flowing river, moving all things in its current. (Tao Te Ching)"
  },
  "Barakah": {
    "quote": "Divine blessing flows as a continuous force from Allah to creation. (Islamic Tradition)"
  },
  "Mana": {
    "quote": "Mana is the sacred spiritual force flowing through all things. (Polynesian Tradition)"
  },
  "Divine Grace": {
    "quote": "By grace you have been saved through faith, and this is not your own doing. (Ephesians 2:8)"
  },
  "Orenda": {
    "quote": "The spiritual power inherent in all things to affect change in the physical world. (Iroquois Tradition)"
  },
  "Divine Justice": {
    "quote": "Justice rolls down like waters, and righteousness like an ever-flowing stream. (Amos 5:24)"
  },
  "Maya": {
    "quote": "The divine force that creates the illusion of material existence. (Advaita Vedanta)"
  },
  "Ruach": {
    "quote": "The divine breath that gives life to all creation. (Jewish Mysticism)"
  },
  "Asha": {
    "quote": "The force of cosmic order and truth that maintains existence. (Zoroastrianism)"
  },
  "Divine Wisdom": {
    "quote": "Wisdom has built her house, she has set up her seven pillars. (Proverbs 9:1)"
  },
  "Brahman Force": {
    "quote": "That force by which the universe exists and into which it dissolves. (Upanishads)"
  },
  "Wyrd": {
    "quote": "The force that weaves the threads of fate and destiny. (Norse Tradition)"
  },
  "Divine Mercy": {
    "quote": "In the name of Allah, the Most Gracious, the Most Merciful. (Quran 1:1)"
  },
  "Shechinah": {
    "quote": "The divine presence that dwells among the people. (Kabbalah)"
  },
  "Chi": {
    "quote": "The vital force that flows through all living things. (Taoist Philosophy)"
  },
  "Divine Light": {
    "quote": "The light shines in the darkness, and the darkness has not overcome it. (John 1:5)"
  },
  "Axé": {
    "quote": "The sacred force that enables all life to continue and prosper. (Yoruba Tradition)"
  },
  "Manitou": {
    "quote": "The spiritual and fundamental force that flows through all things. (Algonquian Peoples)"
  },
  "Divine Order": {
    "quote": "The force that maintains cosmic harmony and balance. (Egyptian Ma'at)"
  },
  "Pneuma": {
    "quote": "The divine breath that animates all living beings. (Greek Philosophy)"
  },
  "Baraka": {
    "quote": "The blessing force that flows from saints and sacred places. (Sufism)"
  },
  "Numen": {
    "quote": "The divine force present in all natural phenomena. (Roman Religion)"
  },
  "Divine Truth": {
    "quote": "The force of truth ultimately triumphs - Satyameva Jayate. (Sanskrit Tradition)"
  },
  "Lungta": {
    "quote": "The wind horse that carries prayers and blessings through the cosmos. (Tibetan Buddhism)"
  },
  "Divine Harmony": {
    "quote": "The force that maintains balance between heaven and earth. (Confucian Tradition)"
  }
}
