{
"Peace Essence": { "quote": "\"Peace I leave with you; my peace I give you. I do not give to you as the world gives.\" (John 14:27)" },
"Inner Peace": { "quote": "\"The peace of God, which transcends all understanding, will guard your hearts and your minds.\" (Philippians 4:7)" },
"Peace Nature": { "quote": "\"Allah guides to the ways of peace those who seek His pleasure.\" (Quran 5:16)" },
"Peace Process": { "quote": "\"Om Shanti Shanti Shanti - Peace in body, mind, and spirit.\" (Upanishads)" },
"Peace Reality": { "quote": "\"Better than a thousand hollow words is one word that brings peace.\" (Buddha, Dhammapada)" },
"Peace Consciousness": { "quote": "\"Where there is peace, there is God.\" (George Fox)" },
"Divine Tranquility": { "quote": "\"Verily, in the remembrance of Allah do hearts find rest.\" (Quran 13:28)" },
"Peace Path": { "quote": "\"The fruit of righteousness will be peace; its effect will be quietness and confidence forever.\" (Isaiah 32:17)" },
"Peace Presence": { "quote": "\"Be still, and know that I am God.\" (Psalm 46:10)" },
"Peace Power": { "quote": "\"Blessed are the peacemakers, for they will be called children of God.\" (Matthew 5:9)" },
"Peace Wisdom": { "quote": "\"But the wisdom that comes from heaven is first of all pure; then peace-loving.\" (James 3:17)" },
"Peace State": { "quote": "\"The mind absorbed in the Self abides in perfect peace.\" (Bhagavad Gita 6:15)" },
"Peace Practice": { "quote": "\"Let peace begin with me; let this be the moment now.\" (Sy Miller & Jill Jackson)" },
"Universal Peace": { "quote": "\"May all beings everywhere be happy and free.\" (Lokah Samastah Sukhino Bhavantu)" },
"Peace Attributes": { "quote": "\"Peace comes from within. Do not seek it without.\" (Buddha)" },
"Peace Promise": { "quote": "\"The Lord bless you and keep you; the Lord make his face shine on you and be gracious to you; the Lord turn his face toward you and give you peace.\" (Numbers 6:24-26)" },
"Peace Manifestation": { "quote": "\"When the power of love overcomes the love of power, the world will know peace.\" (Jimi Hendrix)" },
"Eternal Peace": { "quote": "\"The eternal peace dwells in the heart of all beings.\" (Upanishads)" },
"Peace Harmony": { "quote": "\"Where there is righteousness in the heart, there is beauty in the character. When there is beauty in the character, there is harmony in the home. When there is harmony in the home, there is order in the nation. When there is order in the nation, there is peace in the world.\" (A.P.J. Abdul Kalam)" },
"Peace Understanding": { "quote": "\"Understanding is the first step to peace.\" (Thich Nhat Hanh)" },
"Divine Stillness": { "quote": "\"In quietness and trust shall be your strength.\" (Isaiah 30:15)" },
"Peace Elements": { "quote": "\"Let there be peace on earth, and let it begin with me.\" (Sy Miller & Jill Jackson)" },
"Peace Foundation": { "quote": "\"Great peace have those who love your law.\" (Psalm 119:165)" },
"Peace Dimensions": { "quote": "\"Peace is every step.\" (Thich Nhat Hanh)" },
"Peace Transformation": { "quote": "\"Transform the world through peace, transform peace through understanding.\" (Daisaku Ikeda)" },
"Peace Revelation": { "quote": "\"The day will come when the wolf will live in peace with the lamb.\" (Isaiah 11:6)" },
"Peace Fulfillment": { "quote": "\"Those who are at peace with themselves are at peace with the world.\" (Lao Tzu)" },
"Peace Realization": { "quote": "\"Peace is the natural state of the mind. It is the mind unconditioned by fear.\" (Jiddu Krishnamurti)" },
"Peace Integration": { "quote": "\"Unity in diversity is the highest possible attainment of a civilization.\" (Sri Aurobindo)" },
"Peace Embodiment": { "quote": "\"To reach peace, teach peace.\" (Pope John Paul II)" }
}
