{
"Nature of Guidance": { "quote": "Your word is a lamp for my feet, a light on my path. (Psalm 119:105)" },
"Divine Direction": { "quote": "Indeed, this Quran guides to that which is most suitable. (Quran 17:9)" },
"Spiritual Path": { "quote": "When dharma declines and adharma increases, I manifest myself to protect the good and destroy evil. (Bhagavad Gita 4:7-8)" },
"Inner Light": { "quote": "The light of consciousness is the lamp that guides the seeker on the path. (Upanishads)" },
"Sacred Signs": { "quote": "We will show them Our signs in the horizons and within themselves until it becomes clear to them that it is the truth. (Quran 41:53)" },
"Divine Wisdom": { "quote": "For the Lord gives wisdom; from his mouth come knowledge and understanding. (Proverbs 2:6)" },
"Spiritual Teachers": { "quote": "When the student is ready, the teacher appears. (Buddhist Proverb)" },
"Sacred Text": { "quote": "All scripture is God-breathed and is useful for teaching, rebuking, correcting and training in righteousness. (2 Timothy 3:16)" },
"Divine Protection": { "quote": "The Lord will guide you always; he will satisfy your needs in a sun-scorched land. (Isaiah 58:11)" },
"Inner Voice": { "quote": "Be still, and know that I am God. (Psalm 46:10)" },
"Spiritual Intuition": { "quote": "The heart has its reasons which reason knows nothing of. (Blaise Pascal)" },
"Divine Messages": { "quote": "Listen to the sound of the ineffable. (Rumi)" },
"Sacred Counsel": { "quote": "Trust in the Lord with all your heart and lean not on your own understanding. (Proverbs 3:5)" },
"Divine Will": { "quote": "Not my will, but yours be done. (Luke 22:42)" },
"Spiritual Discernment": { "quote": "Test everything. Hold on to what is good. (1 Thessalonians 5:21)" },
"Sacred Journey": { "quote": "The journey of a thousand miles begins with a single step. (Tao Te Ching)" },
"Divine Presence": { "quote": "I am with you always, even unto the end of the world. (Matthew 28:20)" },
"Spiritual Vision": { "quote": "Where there is no vision, the people perish. (Proverbs 29:18)" },
"Divine Light": { "quote": "God is the Light of the heavens and the earth. (Quran 24:35)" },
"Sacred Wisdom": { "quote": "Wisdom comes from experience. Experience comes from mistakes. (Ancient Proverb)" },
"Divine Providence": { "quote": "All things work together for good to them that love God. (Romans 8:28)" },
"Spiritual Growth": { "quote": "The spiritual journey is individual, highly personal. Not everyone's path looks the same. (Ram Dass)" },
"Divine Connection": { "quote": "Seek and you shall find, knock and the door will be opened. (Matthew 7:7)" },
"Sacred Knowledge": { "quote": "Knowledge is a light cast into the heart. (Islamic Tradition)" },
"Divine Understanding": { "quote": "Understanding is the reward of faith. Therefore, seek not to understand that you may believe, but believe that you may understand. (Augustine)" },
"Spiritual Direction": { "quote": "Follow your bliss and the universe will open doors where there were only walls. (Joseph Campbell)" },
"Divine Synchronicity": { "quote": "Coincidence is God's way of remaining anonymous. (Albert Einstein)" },
"Sacred Purpose": { "quote": "Everyone has been made for some particular work, and the desire for that work has been put in every heart. (Rumi)" },
"Divine Path": { "quote": "There are many paths to the top of the mountain, but the view is always the same. (Chinese Proverb)" },
"Spiritual Alignment": { "quote": "When you align yourself with the divine will, all of creation conspires to help you. (Vedic Wisdom)" }
}
