{
  "Divine Protection": { "quote": "\"The Lord is my shepherd, I shall not want.\" (Psalm 23:1)" },
  "Divine Providence": { "quote": "\"And We will surely test you with something of fear and hunger and a loss of wealth and lives and fruits, but give good tidings to the patient.\" (Quran 2:155)" },
  "Divine Healing": { "quote": "\"I am the Lord who heals you.\" (Exodus 15:26)" },
  "Divine Guidance": { "quote": "\"I will instruct you and teach you in the way you should go; I will counsel you with my eye upon you.\" (Psalm 32:8)" },
  "Divine Compassion": { "quote": "\"The Lord is gracious and merciful, slow to anger and abounding in steadfast love.\" (Psalm 145:8)" },
  "Divine Nurturing": { "quote": "\"As a mother comforts her child, so will I comfort you.\" (Isaiah 66:13)" },
  "Divine Support": { "quote": "\"Cast your burden on the Lord, and he will sustain you.\" (Psalm 55:22)" },
  "Divine Attention": { "quote": "\"Are not five sparrows sold for two pennies? Yet not one of them is forgotten by God.\" (Luke 12:6)" },
  "Divine Grace": { "quote": "\"My grace is sufficient for you, for my power is made perfect in weakness.\" (2 Corinthians 12:9)" },
  "Divine Presence": { "quote": "\"I am with you always, to the end of the age.\" (Matthew 28:20)" },
  "Divine Safety": { "quote": "\"He who dwells in the shelter of the Most High will abide in the shadow of the Almighty.\" (Psalm 91:1)" },
  "Divine Watchfulness": { "quote": "\"Behold, he who keeps Israel will neither slumber nor sleep.\" (Psalm 121:4)" },
  "Divine Assistance": { "quote": "\"God is our refuge and strength, a very present help in trouble.\" (Psalm 46:1)" },
  "Divine Shelter": { "quote": "\"Under His wings you will find refuge.\" (Psalm 91:4)" },
  "Divine Comfort": { "quote": "\"Blessed are those who mourn, for they shall be comforted.\" (Matthew 5:4)" },
  "Divine Love": { "quote": "\"I have loved you with an everlasting love.\" (Jeremiah 31:3)" },
  "Divine Sustenance": { "quote": "\"Look at the birds of the air: they neither sow nor reap nor gather into barns, and yet your heavenly Father feeds them.\" (Matthew 6:26)" },
  "Divine Mercy": { "quote": "\"The steadfast love of the Lord never ceases; his mercies never come to an end.\" (Lamentations 3:22)" },
  "Divine Defense": { "quote": "\"The Lord is my rock and my fortress and my deliverer.\" (Psalm 18:2)" },
  "Divine Preservation": { "quote": "\"The Lord will keep you from all evil; he will keep your life.\" (Psalm 121:7)" },
  "Divine Restoration": { "quote": "\"I will restore to you the years that the swarming locust has eaten.\" (Joel 2:25)" },
  "Divine Aid": { "quote": "\"Fear not, for I am with you; be not dismayed, for I am your God; I will strengthen you, I will help you.\" (Isaiah 41:10)" },
  "Divine Blessing": { "quote": "\"The Lord bless you and keep you; the Lord make his face to shine upon you and be gracious to you.\" (Numbers 6:24-25)" },
  "Divine Guardianship": { "quote": "\"For he will command his angels concerning you to guard you in all your ways.\" (Psalm 91:11)" },
  "Divine Response": { "quote": "\"Before they call I will answer; while they are yet speaking I will hear.\" (Isaiah 65:24)" }
}
