{
"Divine Beloved": { "quote": "\"I am my beloved's and my beloved is mine.\" (Song of Solomon 6:3)"
  },
  "Allah": {
    "quote": "He is Allah, other than whom there is no deity, the Sovereign, the Pure, the Perfection, the Bestower of Faith, the Overseer, the Exalted in Might, the Compeller, the Superior. (Quran 59:23)"
  },
  "YHWH": {
    "quote": "This is my name forever, and this is my memorial unto all generations. (Exodus 3:15)"
  },
  "Krishna": {
    "quote": "Krishna is the source of all that exists, whether spiritual or material. (Brahma Samhita 5.1)"
  },
  "Brahman": {
    "quote": "That which is the finest essence - this whole world has that as its soul. That is Reality. That is Atman. That art thou. (Chandogya Upanishad 6.8.7)"
  },
  "Elohim": {
    "quote": "In the beginning Elohim created the heavens and the earth. (Genesis 1:1)"
  },
  "Adonai": {
    "quote": "Adonai is my shepherd; I shall not want. (Psalm 23:1)"
  },
  "Tao": {
    "quote": "The Tao that can be named is not the eternal Tao. (Tao Te Ching 1)"
  },
  "Buddha": {
    "quote": "Thus shall you think of all this fleeting world: A star at dawn, a bubble in a stream; A flash of lightning in a summer cloud; A flickering lamp, a phantom, and a dream. (Diamond Sutra)"
  },
  "Ahura Mazda": {
    "quote": "We worship Ahura Mazda, the righteous, the master of righteousness. (Yasna 1:1)"
  },
  "El Shaddai": {
    "quote": "I appeared to Abraham, to Isaac, and to Jacob, as El Shaddai. (Exodus 6:3)"
  },
  "Vishnu": {
    "quote": "In every age I come back to deliver the holy, to destroy the sin of the sinner, to establish righteousness. (Bhagavad Gita 4:8)"
  },
  "Jehovah": {
    "quote": "I, even I, am Jehovah; and beside me there is no savior. (Isaiah 43:11)"
  },
  "Om": {
    "quote": "Om is the bow, the arrow is the soul, Brahman is the target. (Mundaka Upanishad 2.2.4)"
  },
  "El Elyon": {
    "quote": "Blessed be Abram by El Elyon, Creator of heaven and earth. (Genesis 14:19)"
  },
  "Shiva": {
    "quote": "When Shiva dances, the universe dances with him. (Thiruvasagam)"
  },
  "Waheguru": {
    "quote": "There is but One God, His name is Truth, He is the Creator, He fears none, He is without hate, He never dies, He is beyond the cycle of births and death, He is self illuminated, He is realized by the kindness of the True Guru. (Japji Sahib)"
  },
  "El Roi": {
    "quote": "She gave this name to the LORD who spoke to her: 'You are the God who sees me.' (Genesis 16:13)"
  },
  "Amaterasu": {
    "quote": "From whose bright body flows the primal glory. (Kojiki)"
  },
  "Shangdi": {
    "quote": "The great God has conferred on the people a moral sense. (Book of Documents)"
  },
  "El Olam": {
    "quote": "Abraham planted a tamarisk tree in Beersheba, and there he called on the name of the LORD, the Eternal God. (Genesis 21:33)"
  },
  "Yahweh Nissi": {
    "quote": "Moses built an altar and called it The LORD is my Banner. (Exodus 17:15)"
  },
  "Paramatma": {
    "quote": "The Supreme Soul dwells in the heart of all beings. (Bhagavad Gita 13:17)"
  },
  "Ein Sof": {
    "quote": "Before there was any beginning, Ein Sof was alone, Name-less and Form-less. (Zohar)"
  },
  "Al-Rahman": {
    "quote": "Call upon Allah or call upon Al-Rahman; whichever name you call, to Him belong the most beautiful names. (Quran 17:110)" 
  },
   "Ishvara": {
    "quote": "\"The Supreme Controller.\" (Bhagavad Gita)"
  },
"Tian": {
    "quote": "\"Heaven, the Supreme Deity.\" (Chinese Classics)"
  },
  "Deus": {
    "quote": "\"The Divine Being.\" (Latin Vulgate)"
  },
  "Haqq": {
    "quote": "\"The Ultimate Truth.\" (Sufi Teachings)"
  },
  "Sat-Chit-Ananda": {
    "quote": "\"Existence-Consciousness-Bliss.\" (Vedanta)"
  },
  "Theos": {
    "quote": "\"The Divine.\" (New Testament Greek)"
  }
  
}
