{
"Sacred Shelter": { "quote": "\"God is our refuge and strength, an ever-present help in trouble.\" (Psalm 46:1)" },
"Divine Protection": { "quote": "\"The name of the Lord is a strong tower; the righteous run into it and are safe.\" (Proverbs 18:10)" },
"Spiritual Sanctuary": { "quote": "\"Take refuge in the Three Jewels - the Buddha, the Dharma, and the Sangha.\" (Buddhist Triple Gem)" },
"Eternal Haven": { "quote": "\"Those who take refuge in Me alone cross over this illusion.\" (Bhagavad Gita 7:14)" },
"Celestial Asylum": { "quote": "\"Allah! There is no deity except Him, so let the believers put their trust in Allah.\" (Quran 64:13)" },
"Divine Dwelling": { "quote": "\"He who dwells in the shelter of the Most High will rest in the shadow of the Almighty.\" (Psalm 91:1)" },
"Sacred Space": { "quote": "\"In returning and rest you shall be saved; in quietness and trust shall be your strength.\" (Isaiah 30:15)" },
"Holy Ground": { "quote": "\"Remove your sandals, for the place where you are standing is holy ground.\" (Exodus 3:5)" },
"Divine Embrace": { "quote": "\"Under His wings you will find refuge.\" (Psalm 91:4)" },
"Spiritual Harbor": { "quote": "\"Come to Me, all you who are weary and burdened, and I will give you rest.\" (Matthew 11:28)" },
"Sacred Fortress": { "quote": "\"The Lord is my rock, my fortress and my deliverer.\" (Psalm 18:2)" },
"Divine Shield": { "quote": "\"You are my hiding place; you will protect me from trouble.\" (Psalm 32:7)" },
"Eternal Sanctuary": { "quote": "\"In peace I will lie down and sleep, for you alone, Lord, make me dwell in safety.\" (Psalm 4:8)" },
"Sacred Asylum": { "quote": "\"The eternal God is your refuge, and underneath are the everlasting arms.\" (Deuteronomy 33:27)" },
"Divine Haven": { "quote": "\"He will cover you with his feathers, and under his wings you will find refuge.\" (Psalm 91:4)" },
"Spiritual Shelter": { "quote": "\"Be for me a rock of refuge, to which I can always go.\" (Psalm 71:3)" },
"Holy Sanctuary": { "quote": "\"Let us then approach God's throne of grace with confidence.\" (Hebrews 4:16)" },
"Divine Abode": { "quote": "\"One thing I ask from the Lord: to dwell in the house of the Lord all the days of my life.\" (Psalm 27:4)" },
"Sacred Haven": { "quote": "\"In the shadow of your wings I will take refuge.\" (Psalm 57:1)" },
"Eternal Refuge": { "quote": "\"My refuge is in God.\" (Psalm 62:7)" },
"Divine Sanctuary": { "quote": "\"The Lord is good, a refuge in times of trouble.\" (Nahum 1:7)" },
"Spiritual Fortress": { "quote": "\"The name of the Lord is a fortified tower; the righteous run to it and are safe.\" (Proverbs 18:10)" },
"Holy Refuge": { "quote": "\"He who takes refuge in the Perfect Buddha shall pass beyond all grief.\" (Dhammapada 190)" },
"Sacred Protection": { "quote": "\"The Lord will keep you from all harm— he will watch over your life.\" (Psalm 121:7)" },
"Divine Security": { "quote": "\"You are my refuge and my shield; I have put my hope in your word.\" (Psalm 119:114)" },
"Eternal Shelter": { "quote": "\"For in the day of trouble he will keep me safe in his dwelling.\" (Psalm 27:5)" },
"Spiritual Home": { "quote": "\"Lord, you have been our dwelling place throughout all generations.\" (Psalm 90:1)" },
"Divine Peace": { "quote": "\"Peace I leave with you; my peace I give you.\" (John 14:27)" },
"Sacred Rest": { "quote": "\"Come with me by yourselves to a quiet place and get some rest.\" (Mark 6:31)" },
"Eternal Protection": { "quote": "\"The Lord will watch over your coming and going both now and forevermore.\" (Psalm 121:8)" }
}
