{
  "Existence Essence": {
    "quote": "\"Being is. Non-being is not.\" (Parmenides)"
  },
  "Eternal Being": {
    "quote": "\"I am the unborn, the eternal, the imperishable.\" (Bhagavad Gita 4:6)"
  },
  "Pure Existence": {
    "quote": "\"Existence is pure consciousness, pure bliss.\" (Brihadaranyaka Upanishad 3.9.28)"
  },
  "Ground of Being": {
    "quote": "\"In Him we live and move and have our being.\" (Acts 17:28)"
  },
  "Nature of Existence": {
    "quote": "\"All existence is one unified field of consciousness.\" (Vedanta Sutra 1.1.1)"
  },
  "Levels of Existence": {
    "quote": "\"From matter to mind to spirit, existence ascends.\" (Sri Aurobindo, The Life Divine)"
  },
  "Source of Existence": {
    "quote": "\"From fullness, fullness comes. From existence, existence manifests.\" (Isha Upanishad)"
  },
  "Existential Reality": {
    "quote": "\"The Real is one without a second.\" (Chandogya Upanishad 6.2.1)"
  },
  "Divine Presence": {
    "quote": "\"Wheresoever you turn, there is the Face of Allah.\" (Quran 2:115)"
  },
  "Cosmic Existence": {
    "quote": "\"The universe is pervaded by Me in My unmanifest form.\" (Bhagavad Gita 9:4)"
  },
  "Transcendent Being": {
    "quote": "\"Beyond being and non-being, He alone is.\" (Mundaka Upanishad 2.2.1)"
  },
  "Manifest Existence": {
    "quote": "\"All that exists is but a manifestation of the One.\" (Plotinus, Enneads)"
  },
  "Existential Truth": {
    "quote": "\"Truth is existence, existence is truth.\" (Zen saying)"
  },
  "Universal Being": {
    "quote": "\"The Self is all this universe.\" (Chandogya Upanishad 7.25.2)"
  },
  "Essential Nature": {
    "quote": "\"The nature of existence is emptiness, emptiness itself is existence.\" (Heart Sutra)"
  },
  "Eternal Present": {
    "quote": "\"I am the eternal now.\" (Meister Eckhart)"
  },
  "Divine Substance": {
    "quote": "\"God is the only substance that can exist or be conceived.\" (Spinoza, Ethics)"
  },
  "Existential Unity": {
    "quote": "\"All existence is one seamless whole.\" (Advaita Vedanta)"
  },
  "Being and Becoming": {
    "quote": "\"Everything flows, nothing stands still.\" (Heraclitus)"
  },
  "Absolute Reality": {
    "quote": "\"That which is, was, and ever shall be.\" (Egyptian Book of the Dead)"
  },
  "Divine Consciousness": {
    "quote": "\"Consciousness is the foundation of all existence.\" (Upanishads)"
  },
  "Eternal Existence": {
    "quote": "\"Before Abraham was, I am.\" (John 8:58)"
  },
  "Ultimate Being": {
    "quote": "\"Beyond name and form is the Absolute.\" (Ramana Maharshi)"
  },
  "Divine Essence": {
    "quote": "\"The essence of existence is consciousness itself.\" (Kashmir Shaivism)"
  },
  "Primordial Being": {
    "quote": "\"In the beginning was the Word.\" (John 1:1)"
  },
  "Existential Purpose": {
    "quote": "\"The purpose of existence is to realize the Divine.\" (Swami Vivekananda)"
  },
  "Being-Itself": {
    "quote": "\"God is Being-Itself, not a being.\" (Paul Tillich)"
  },
  "Divine Life": {
    "quote": "\"The divine life manifests in all existence.\" (Sri Aurobindo)"
  },
  "Eternal Now": {
    "quote": "\"There is only the eternal present.\" (Eckhart Tolle)"
  },
  "Supreme Reality": {
    "quote": "\"The Supreme Reality is one without a second.\" (Upanishads)"
  }
}
