{
  "Universal Mind": {
    "quote": "\"The divine mind is the universal intelligence that pervades all creation.\" (Plotinus, Enneads)"
  },
  "Cosmic Intelligence": {
    "quote": "\"That which is the finest essence – this whole world has that as its soul. That is Reality. That is Truth. That art thou.\" (Chandogya Upanishad 6.8.7)"
  },
  "Divine Intelligence": {
    "quote": "\"The Logos was with God, and the Logos was God.\" (John 1:1)"
  },
  "Supreme Consciousness": {
    "quote": "\"Pure consciousness is the supreme reality that underlies all existence.\" (Shankara, Vivekachudamani)"
  },
  "Infinite Wisdom": {
    "quote": "\"O the depth of the riches both of the wisdom and knowledge of God!\" (Romans 11:33)"
  },
  "Divine Knowledge": {
    "quote": "\"Knowledge is the wing wherewith we fly to heaven.\" (Shakespeare, Henry VI)"
  },
  "Cosmic Consciousness": {
    "quote": "\"The universe is not only queerer than we suppose, but queerer than we can suppose.\" (J.B.S. Haldane)"
  },
  "Divine Thought": {
    "quote": "\"In the beginning was thought, and the thought was with God.\" (Meister Eckhart)"
  },
  "Universal Intelligence": {
    "quote": "\"Intelligence is the source of all becoming.\" (Sri Aurobindo, The Life Divine)"
  },
  "Divine Understanding": {
    "quote": "\"Understanding is the reward of faith.\" (Augustine of Hippo)"
  },
  "Cosmic Mind": {
    "quote": "\"The cosmic mind contains all possibilities.\" (Carl Jung, Collected Works)"
  },
  "Divine Reason": {
    "quote": "\"Divine reason is the sovereign of the universe.\" (Marcus Aurelius, Meditations)"
  },
  "Supreme Intellect": {
    "quote": "\"The supreme intellect is the source of all knowledge.\" (Al-Farabi)"
  },
  "Divine Wisdom": {
    "quote": "\"Wisdom has built her house.\" (Proverbs 9:1)"
  },
  "Universal Consciousness": {
    "quote": "\"All consciousness is one.\" (Vedanta Sutra)"
  },
  "Divine Insight": {
    "quote": "\"The eye with which I see God is the same eye with which God sees me.\" (Meister Eckhart)"
  },
  "Cosmic Order": {
    "quote": "\"The Tao is the way of Heaven and Earth.\" (Tao Te Ching)"
  },
  "Divine Pattern": {
    "quote": "\"As above, so below.\" (Hermes Trismegistus)"
  },
  "Universal Law": {
    "quote": "\"The divine law moves through all things.\" (Heraclitus)"
  },
  "Divine Truth": {
    "quote": "\"Truth is one, paths are many.\" (Ramakrishna)"
  },
  "Supreme Understanding": {
    "quote": "\"The supreme understanding transcends all dualities.\" (Nagarjuna)"
  },
  "Divine Cognition": {
    "quote": "\"In divine cognition, knower and known are one.\" (Nicholas of Cusa)"
  },
  "Cosmic Intellect": {
    "quote": "\"The cosmic intellect is the source of all forms.\" (Ibn Sina)"
  },
  "Divine Light": {
    "quote": "\"God is light, and in him is no darkness at all.\" (1 John 1:5)"
  },
  "Universal Wisdom": {
    "quote": "\"Wisdom reaches from end to end mightily.\" (Wisdom 8:1)"
  },
  "Divine Science": {
    "quote": "\"The divine science is the knowledge of unity in multiplicity.\" (Leibniz)"
  },
  "Cosmic Understanding": {
    "quote": "\"To understand all is to forgive all.\" (Buddha)"
  },
  "Divine Consciousness": {
    "quote": "\"Consciousness is the fundamental thing in existence.\" (Sri Aurobindo)"
  },
  "Universal Truth": {
    "quote": "\"Truth is universal but our expressions of it are relative.\" (Swami Vivekananda)"
  },
  "Divine Perception": {
    "quote": "\"In pure perception, the seer and seen become one.\" (Patanjali, Yoga Sutras)"
  }
}
