{
  "Lila": {  "quote": "\"The universe is the play of the Divine.\" (Vaishnava Texts)" },
  "Divine Romance": {  "quote": "\"The soul and Divine engage in an eternal love play.\" (Rumi)" },
  "Cosmic Dance": {  "quote": "\"The Lord of Dance performs His eternal dance of creation and dissolution.\" (Tirumular, Tirumantiram)" },
  "Divine Sport": {  "quote": "\"Like a child at play, the Divine delights in creation.\" (Brahma Sutras)" },
  "Divine Drama": {  "quote": "\"All the world's a stage, and all beings merely players.\" (Vedantic interpretation)" },
  "Divine Comedy": {  "quote": "\"In the grand theatre of existence, every soul plays its part.\" (Ibn Arabi)" },
  "Sacred Play": {  "quote": "\"Through play, the Divine expresses infinite possibilities.\" (Kashmir Shaivism)" },
  "Cosmic Hide-and-Seek": {  "quote": "\"The One hides in the Many, waiting to be found.\" (Ramakrishna)" },
  "Divine Entertainment": {  "quote": "\"Creation exists for the delight of the Divine.\" (Upanishads)" },
  "Cosmic Festival": {  "quote": "\"The universe is a celebration of divine joy.\" (Sri Aurobindo)" },
  "Divine Performance": {  "quote": "\"Each being performs its role in the cosmic play.\" (Natyashastra)" },
  "Sacred Dance": {  "quote": "\"In the rhythm of existence, every movement is a divine gesture.\" (Abhinavagupta)" },
  "Cosmic Chess": {  "quote": "\"The Divine plays both sides of the game.\" (Sufi Teaching)" },
  "Divine Masquerade": {  "quote": "\"Behind every mask is the same divine face.\" (Vedantic Texts)" },
  "Sacred Theatre": {  "quote": "\"Life is a divine drama written, directed, and performed by the One.\" (Shankaracharya)" },
  "Cosmic Recreation": {  "quote": "\"In pure joy does the Divine create and sustain.\" (Chandogya Upanishad)" },
  "Sacred Competition": {  "quote": "\"Victory and defeat are both aspects of the divine game.\" (Bhagavata Purana)" },
  "Cosmic Playground": {  "quote": "\"The universe is the Divine's field of play.\" (Yoga Vasishtha)" },
  "Divine Orchestra": {  "quote": "\"Each being plays its note in the cosmic symphony.\" (Hazrat Inayat Khan)" },
  "Sacred Storytelling": {  "quote": "\"The Divine narrates itself through all of existence.\" (Meister Eckhart)"
  }
}
