{
  "Wisdom": {
    "quote": "\"The fear of the Lord is the beginning of wisdom.\" (Proverbs 9:10)"
  },
  "Understanding": {
    "quote": "\"Knowledge is structured in consciousness.\" (Vedic Science)"
  },
  "Illumination": {
    "quote": "\"I am the light of the world.\" (John 8:12)"
  },
  "Gnosis": {
    "quote": "\"Know thyself and thou shalt know the universe and God.\" (Temple of Delphi)"
  },
  "Revelation": {
    "quote": "\"He reveals deep and hidden things; he knows what lies in darkness.\" (Daniel 2:22)"
  },
  "Insight": {
    "quote": "\"The eye with which I see God is the same eye with which God sees me.\" (Meister Eckhart)"
  },
  "Awareness": {
    "quote": "\"Pure awareness is beyond mind, beyond being and non-being.\" (Ashtavakra Gita 1:12)"
  },
  "Comprehension": {
    "quote": "\"The intellect is a clear mirror reflecting the divine light.\" (Al-Ghazali)"
  },
  "Realization": {
    "quote": "\"When the mind is still, the truth reveals itself.\" (Buddha)"
  },
  "Cognition": {
    "quote": "\"In your light we see light.\" (Psalm 36:9)"
  },
  "Perception": {
    "quote": "\"The eye of the soul is not separate from the soul's substance.\" (Plotinus)"
  },
  "Intelligence": {
    "quote": "\"The intelligence of the universe is sacred.\" (Marcus Aurelius, Meditations)"
  },
  "Discernment": {
    "quote": "\"Test everything; hold fast what is good.\" (1 Thessalonians 5:21)"
  },
  "Consciousness": {
    "quote": "\"Consciousness is the lamp through which the Divine Light shines.\" (Ramana Maharshi)"
  },
  "Recognition": {
    "quote": "\"To know That by which all else is known.\" (Kena Upanishad)"
  },
  "Knowing": {
    "quote": "\"Knowledge of the self is the mother of all knowledge.\" (Khalil Gibran)"
  },
  "Apprehension": {
    "quote": "\"The divine is knowable through direct apprehension.\" (Plotinus, Enneads)"
  },
  "Understanding": {
    "quote": "\"Understanding is the reward of faith.\" (Augustine of Hippo)"
  },
  "Enlightenment": {
    "quote": "\"When delusion ends, the light of wisdom shines forth.\" (Patanjali)"
  },
  "Clarity": {
    "quote": "\"Clear seeing leads to liberation.\" (Buddhist Scripture)"
  },
  "Omniscience": {
    "quote": "\"Nothing in all creation is hidden from God's sight.\" (Hebrews 4:13)"
  },
  "Intuition": {
    "quote": "\"Divine knowledge comes through intuitive flash.\" (Sri Aurobindo)"
  },
  "Realization": {
    "quote": "\"Self-knowledge is the beginning of wisdom.\" (Krishnamurti)"
  },
  "Awakening": {
    "quote": "\"Awake, arise, and stop not till the goal is reached.\" (Vivekananda)"
  }
}
