{
  "Divine Parent": {
    "quote": "As a father has compassion on his children, so the LORD has compassion on those who fear him. (Psalm 103:13)"
  },
  "Divine Beloved": {
    "quote": "I am my beloved's and my beloved is mine. (Song of Solomon 6:3)"
  },
  "Divine Teacher": {
    "quote": "But the Helper, the Holy Spirit, whom the Father will send in my name, will teach you all things. (John 14:26)"
  },
  "Divine Friend": {
    "quote": "I no longer call you servants... Instead, I have called you friends. (John 15:15)"
  },
  "Divine Guide": {
    "quote": "Your word is a lamp for my feet, a light on my path. (Psalm 119:105)"
  },
  "Divine Protector": {
    "quote": "The LORD is my shepherd, I lack nothing. (Psalm 23:1)"
  },
  "Divine Master": {
    "quote": "No one can serve two masters. Either you will hate the one and love the other. (Matthew 6:24)"
  },
  "Divine Companion": {
    "quote": "And surely I am with you always, to the very end of the age. (Matthew 28:20)"
  },
  "Divine Healer": {
    "quote": "I am the LORD, who heals you. (Exodus 15:26)"
  },
  "Divine Creator": {
    "quote": "For you created my inmost being; you knit me together in my mother's womb. (Psalm 139:13)"
  },
  "Divine Mother": {
    "quote": "As a mother comforts her child, so will I comfort you. (Isaiah 66:13)"
  },
  "Divine Lover": {
    "quote": "Many waters cannot quench love; rivers cannot sweep it away. (Song of Solomon 8:7)"
  },
  "Divine Guru": {
    "quote": "By the Guru's grace, divine knowledge is revealed. (Guru Granth Sahib)"
  },
  "Divine Partner": {
    "quote": "For we are co-workers in God's service. (1 Corinthians 3:9)"
  },
  "Divine Witness": {
    "quote": "The eyes of the LORD are everywhere, keeping watch on the wicked and the good. (Proverbs 15:3)"
  },
  "Divine Sustainer": {
    "quote": "In him we live and move and have our being. (Acts 17:28)"
  },
  "Divine Confidant": {
    "quote": "Pour out your heart before Him; God is a refuge for us. (Psalm 62:8)"
  },
  "Divine Bridegroom": {
    "quote": "As the bridegroom rejoices over the bride, so shall your God rejoice over you. (Isaiah 62:5)"
  },
  "Divine Provider": {
    "quote": "And my God will meet all your needs according to the riches of his glory. (Philippians 4:19)"
  },
  "Divine Refuge": {
    "quote": "God is our refuge and strength, an ever-present help in trouble. (Psalm 46:1)"
  },
  "Divine Liberator": {
    "quote": "So if the Son sets you free, you will be free indeed. (John 8:36)"
  },
  "Divine Counselor": {
    "quote": "I will instruct you and teach you in the way you should go; I will counsel you with my loving eye on you. (Psalm 32:8)"
  },
  "Divine Partner in Dialogue": {
    "quote": "Come now, let us reason together, says the LORD. (Isaiah 1:18)"
  },
  "Divine Co-Creator": {
    "quote": "For we are God's handiwork, created in Christ Jesus to do good works. (Ephesians 2:10)"
  },
  "Divine Mirror": {
    "quote": "For now we see only a reflection as in a mirror; then we shall see face to face. (1 Corinthians 13:12)"
  },
  "Divine Advocate": {
    "quote": "My dear children, I write this to you so that you will not sin. But if anybody does sin, we have an advocate. (1 John 2:1)"
  },
  "Divine Gardener": {
    "quote": "I am the true vine, and my Father is the gardener. (John 15:1)"
  },
  "Divine Host": {
    "quote": "You prepare a table before me in the presence of my enemies. (Psalm 23:5)"
  },
  "Divine Artist": {
    "quote": "For we are God's masterpiece, created in Christ Jesus for good works. (Ephesians 2:10)"
  },
  "Divine Physician": {
    "quote": "It is not the healthy who need a doctor, but the sick. (Matthew 9:12)"
  },
  "Divine Judge": {
    "quote": "For the LORD is our judge, the LORD is our lawgiver, the LORD is our king. (Isaiah 33:22)"
  },
  "Divine Transformer": {
    "quote": "And we all, who with unveiled faces contemplate the Lord's glory, are being transformed into his image. (2 Corinthians 3:18)"
  },
  "Divine Shepherd": {
    "quote": "He tends his flock like a shepherd: He gathers the lambs in his arms. (Isaiah 40:11)"
  },
  "Divine Light": {
    "quote": "The LORD is my light and my salvation—whom shall I fear? (Psalm 27:1)"
  },
  "Divine Potter": {
    "quote": "Yet you, LORD, are our Father. We are the clay, you are the potter; we are all the work of your hand. (Isaiah 64:8)"
  },
  "Divine Dance Partner": {
    "quote": "Then maidens will dance and be glad, young men and old as well. I will turn their mourning into gladness. (Jeremiah 31:13)"
  }
}
