{
  "Primary Definition": {
    "quote": "\"Whenever righteousness declines, I manifest Myself.\" (Bhagavad Gita 4:7)"
  },
  "Forms": {
    "quote": "\"I am manifest in various forms, yet remain the unchanging One.\" (Bhagavad Gita 4:6)"
  },
  "Purpose": {
    "quote": "\"For the protection of the good, for the destruction of evil, and for the establishment of righteousness.\" (Bhagavad Gita 4:8)"
  },
  "Cycles": {
    "quote": "\"In every age I come back to deliver the holy, to destroy the sin of the sinner.\" (Bhagavad Gita 4:8)"
  },
  "Recognition": {
    "quote": "\"The pure in heart see God.\" (Matthew 5:8)"
  },
  "Levels": {
    "quote": "\"From the partial to the complete, from the finite to the infinite.\" (Sri Aurobindo, The Life Divine)"
  },
  "Signs": {
    "quote": "\"There will be signs in the sun, moon and stars.\" (Luke 21:25)"
  },
  "Methods": {
    "quote": "\"Through dreams, visions, and direct revelation.\" (Numbers 12:6)"
  },
  "Presence": {
    "quote": "\"I am with you always, even unto the end of the world.\" (Matthew 28:20)"
  },
  "Vehicles": {
    "quote": "\"The Word became flesh and dwelt among us.\" (John 1:14)"
  },
  "Times": {
    "quote": "\"There is an appointed time for everything.\" (Ecclesiastes 3:1)"
  },
  "Places": {
    "quote": "\"The whole earth is full of His glory.\" (Isaiah 6:3)"
  },
  "Effects": {
    "quote": "\"They were transformed by the renewing of their minds.\" (Romans 12:2)"
  },
  "Conditions": {
    "quote": "\"Blessed are the pure in heart, for they shall see God.\" (Matthew 5:8)"
  },
  "Degrees": {
    "quote": "\"From glory to glory.\" (2 Corinthians 3:18)"
  },
  "Patterns": {
    "quote": "\"As above, so below.\" (Hermes Trismegistus, Emerald Tablet)"
  },
  "Channels": {
    "quote": "\"Through prophets, saints, and sages.\" (Hebrews 1:1)"
  },
  "Stages": {
    "quote": "\"First the blade, then the ear, then the full grain in the ear.\" (Mark 4:28)"
  },
  "Response": {
    "quote": "\"Here I am! I stand at the door and knock.\" (Revelation 3:20)"
  },
  "Impact": {
    "quote": "\"The light shines in the darkness.\" (John 1:5)"
  },
  "Nature": {
    "quote": "\"The invisible things of him are clearly seen, being understood by the things that are made.\" (Romans 1:20)"
  },
  "Process": {
    "quote": "\"Line upon line, precept upon precept.\" (Isaiah 28:10)"
  },
  "Quality": {
    "quote": "\"Perfect is the word of God.\" (Psalm 18:30)"
  },
  "Experience": {
    "quote": "\"Taste and see that the Lord is good.\" (Psalm 34:8)"
  },
  "Results": {
    "quote": "\"Old things are passed away; behold, all things are become new.\" (2 Corinthians 5:17)"
  }
}
