{
  "Creation Story": {
    "quote": "\"In the beginning God created the heavens and the earth.\" (Genesis 1:1)"
  },
  "Divine Word": {
    "quote": "\"And God said, 'Let there be light,' and there was light.\" (Genesis 1:3)"
  },
  "Creative Power": {
    "quote": "\"By the word of the Lord the heavens were made.\" (Psalm 33:6)"
  },
  "Creation Process": {
    "quote": "\"First there was the void, then desire arose, which was the primal seed of mind.\" (Rig Veda 10.129)"
  },
  "Creation Purpose": {
    "quote": "\"I have created the jinn and humankind only to worship Me.\" (Quran 51:56)"
  },
  "Creative Force": {
    "quote": "\"Brahman is that from which the origin, sustenance, and dissolution of this universe arise.\" (Vedanta Sutra 1.1.2)"
  },
  "Creation Stages": {
    "quote": "\"For in six days the Lord made heaven and earth, the sea, and all that is in them.\" (Exodus 20:11)"
  },
  "Creation Order": {
    "quote": "\"The Tao gave birth to One, One gave birth to Two, Two gave birth to Three, Three gave birth to all things.\" (Tao Te Ching 42)"
  },
  "Creative Act": {
    "quote": "\"When He decrees a matter, He only says to it, 'Be,' and it is.\" (Quran 2:117)"
  },
  "Creation Beauty": {
    "quote": "\"He has made everything beautiful in its time.\" (Ecclesiastes 3:11)"
  },
  "Creation Wisdom": {
    "quote": "\"The Lord by wisdom founded the earth; by understanding he established the heavens.\" (Proverbs 3:19)"
  },
  "Creation Nature": {
    "quote": "\"Nature is the art of God.\" (Dante Alighieri)"
  },
  "Creation Harmony": {
    "quote": "\"The whole universe exists in perfect harmony according to natural law.\" (Bhagavad Gita 3:14)"
  },
  "Creation Energy": {
    "quote": "\"All creation springs from the two basic forces of Yin and Yang.\" (I Ching)"
  },
  "Creation Time": {
    "quote": "\"With the Lord one day is as a thousand years, and a thousand years as one day.\" (2 Peter 3:8)"
  },
  "Creation Cycles": {
    "quote": "\"The universe is created, maintained, and dissolved in endless cycles.\" (Bhagavata Purana 12.4)"
  },
  "Creation Purpose": {
    "quote": "\"For by him all things were created, in heaven and on earth, visible and invisible.\" (Colossians 1:16)"
  },
  "Creation Design": {
    "quote": "\"How many are your works, Lord! In wisdom you made them all.\" (Psalm 104:24)"
  },
  "Creation Elements": {
    "quote": "\"From water We made every living thing.\" (Quran 21:30)"
  },
  "Creation Life": {
    "quote": "\"Then the Lord God formed man from the dust of the ground and breathed into his nostrils the breath of life.\" (Genesis 2:7)"
  },
  "Creation Consciousness": {
    "quote": "\"The Universe is not only governed by consciousness but is consciousness.\" (Sri Aurobindo)"
  },
  "Creation Evolution": {
    "quote": "\"The whole creation has been groaning as in the pains of childbirth right up to the present time.\" (Romans 8:22)"
  },
  "Creation Unity": {
    "quote": "\"All things are unified in the One.\" (Plotinus, Enneads)"
  },
  "Creation Renewal": {
    "quote": "\"Behold, I make all things new.\" (Revelation 21:5)"
  },
  "Creation Care": {
    "quote": "\"The Lord God took the man and put him in the Garden of Eden to work it and take care of it.\" (Genesis 2:15)"
  }
}
