{
"Nature of Being": { "quote": "Being is beyond all becoming. (Meister Eckhart)" },
"Divine Essence": { "quote": "The essence of the Divine Being is unmanifest, yet manifests in all. (Upanishads)" },
"Transcendent Being": { "quote": "That which is beyond being and non-being we call the transcendent. (Nagarjuna)" },
"Immanent Being": { "quote": "The Divine Being dwells in the heart of all creatures. (Bhagavad Gita 18:61)" },
"Eternal Being": { "quote": "Before Abraham was, I am. (John 8:58)" },
"Absolute Being": { "quote": "The Absolute Being is that from which proceed the creation, sustenance and dissolution of the universe. (Vedanta Sutra 1.1.2)" },
"Universal Being": { "quote": "The universe is the body of the Divine Being. (Spinoza, Ethics)" },
"Supreme Being": { "quote": "The Supreme Being is one without a second. (Chandogya Upanishad 6.2.1)" },
"Infinite Being": { "quote": "The Infinite Being is without beginning and without end. (Plotinus, Enneads)" },
"Pure Being": { "quote": "Pure Being is the ground of all existence. (Hegel, Science of Logic)" },
"Divine Consciousness": { "quote": "The Divine Being is pure consciousness, eternal and infinite. (Yoga Sutras 1.51)" },
"Being of Light": { "quote": "God is light, and in Him there is no darkness at all. (1 John 1:5)" },
"Being of Love": { "quote": "The Divine Being is the source of all love and compassion. (Rumi)" },
"Being of Wisdom": { "quote": "In Divine Being dwells all the fullness of wisdom. (Colossians 2:3)" },
"Being of Power": { "quote": "All power belongs to the Divine Being. (Psalm 62:11)" },
"Being of Peace": { "quote": "The peace of the Divine Being surpasses all understanding. (Philippians 4:7)" },
"Being of Bliss": { "quote": "The Divine Being is existence, consciousness, and bliss. (Satchitananda)" },
"Being Beyond Form": { "quote": "The formless is the source of all forms. (Tao Te Ching 14)" },
"Being Within": { "quote": "The kingdom of the Divine Being is within you. (Luke 17:21)" },
"Being Without": { "quote": "The Divine Being encompasses all that is. (Ibn Arabi)" },
"Being as Truth": { "quote": "Truth is the very being of the Divine. (Augustine, Confessions)" },
"Being as Beauty": { "quote": "Divine Being manifests as the beauty in all things. (Plotinus)" },
"Being as Freedom": { "quote": "In Divine Being is perfect freedom. (Book of Common Prayer)" },
"Being as Unity": { "quote": "All beings are united in the One Divine Being. (Sufi teaching)" },
"Being as Reality": { "quote": "The Divine Being alone is real. (Sankara)" },
"Being as Life": { "quote": "In the Divine Being we live and move and have our being. (Acts 17:28)" },
"Being as Energy": { "quote": "All energy flows from the Divine Being. (Sri Aurobindo)" },
"Being as Source": { "quote": "From Divine Being all things proceed and to Divine Being all return. (Neoplatonic teaching)" },
"Being as Presence": { "quote": "The Divine Being is ever-present, here and now. (Zen teaching)" },
"Being as Silence": { "quote": "In silence dwells the Divine Being. (Ramana Maharshi)" }
}
