{
  "Cosmic Order": {
    "quote": "\"The universe is not a chaos, but a harmony of ordered movements.\" (Pythagoras)"
  },
  "Natural Law": {
    "quote": "\"Rita - the cosmic order and moral law that governs all existence.\" (Rig Veda 1.164)"
  },
  "Divine Hierarchy": {
    "quote": "\"There are celestial bodies and earthly bodies, but the glory of the celestial is one, and the glory of the terrestrial is another.\" (1 Corinthians 15:40)"
  },
  "Sacred Structure": {
    "quote": "\"As above, so below; as below, so above.\" (Hermes Trismegistus, The Emerald Tablet)"
  },
  "Celestial Order": {
    "quote": "\"The heavens declare the glory of God; the skies proclaim the work of his hands.\" (Psalm 19:1)"
  },
  "Divine Law": {
    "quote": "\"Dharma sustains the world.\" (Bhagavad Gita 3:24)"
  },
  "Universal Pattern": {
    "quote": "\"The Tao follows what is natural.\" (Tao Te Ching, Chapter 25)"
  },
  "Divine Harmony": {
    "quote": "\"Everything in the universe follows order and harmony.\" (Confucius, Analects)"
  },
  "Sacred Balance": {
    "quote": "\"In perfect equilibrium, heaven and earth are aligned.\" (I Ching)"
  },
  "Spiritual Hierarchy": {
    "quote": "\"From angels to archangels, from seraphim to cherubim, all serve in divine order.\" (Pseudo-Dionysius, Celestial Hierarchy)"
  },
  "Cosmic Structure": {
    "quote": "\"The cosmos is structured in ascending levels of consciousness.\" (Plotinus, Enneads)"
  },
  "Divine Architecture": {
    "quote": "\"God has arranged all things by measure and number and weight.\" (Wisdom 11:20)"
  },
  "Sacred Geometry": {
    "quote": "\"God geometrizes continually.\" (Plato)"
  },
  "Divine System": {
    "quote": "\"Everything proceeds according to the law of cause and effect.\" (Buddha)"
  },
  "Universal Order": {
    "quote": "\"The whole universe is strung on Me, as pearls are strung on a thread.\" (Bhagavad Gita 7:7)"
  },
  "Metaphysical Structure": {
    "quote": "\"All things are arranged hierarchically, from the First Cause through all gradations of creation.\" (Thomas Aquinas)"
  },
  "Divine Organization": {
    "quote": "\"Let all things be done decently and in order.\" (1 Corinthians 14:40)"
  },
  "Sacred Order": {
    "quote": "\"The order of the sacred manifests in all dimensions of existence.\" (Mircea Eliade)"
  },
  "Cosmic Harmony": {
    "quote": "\"Heaven and Earth unite in perfect order to make all things manifest.\" (I Ching, Hexagram 11)"
  },
  "Divine Plan": {
    "quote": "\"In all things God works for the good of those who love him.\" (Romans 8:28)"
  },
  "Sacred Pattern": {
    "quote": "\"The patterns of the divine are woven through all of creation.\" (Ibn Arabi)"
  },
  "Divine Arrangement": {
    "quote": "\"Everything has been created according to a measure.\" (Quran 54:49)"
  },
  "Celestial Hierarchy": {
    "quote": "\"The celestial orders mirror the divine intelligence.\" (Maimonides, Guide for the Perplexed)"
  },
  "Sacred Mathematics": {
    "quote": "\"Numbers are the highest degree of knowledge. It is knowledge itself.\" (Plato)"
  },
  "Divine Sequence": {
    "quote": "\"From the One proceeds the many in perfect sequence.\" (Plotinus)"
  },
  "Cosmic Design": {
    "quote": "\"The universe shows evidence of a calculating creator.\" (Sir Isaac Newton)"
  },
  "Sacred Science": {
    "quote": "\"The laws of nature are but the mathematical thoughts of God.\" (Euclid)"
  },
  "Divine Symmetry": {
    "quote": "\"Symmetry is what we see at a glance.\" (Blaise Pascal)"
  },
  "Universal Law": {
    "quote": "\"The same patterns move through all things.\" (Marcus Aurelius, Meditations)"
  },
  "Sacred Logic": {
    "quote": "\"Divine reason orders all things.\" (Heraclitus)"
  }
}
