{
  "Cosmic Formation": {
    "quote": "In the beginning God created the heavens and the earth. (Genesis 1:1)"
  },
  "Emanation": {
    "quote": "From the One flows all existence, like light from the sun. (Plotinus, Enneads V.1)"
  },
  "Divine Architecture": {
    "quote": "The universe is built on foundations of wisdom. (Proverbs 3:19)"
  },
  "Sacred Geometry": {
    "quote": "God geometrizes continually. (Plato, attributed)"
  },
  "Primordial Pattern": {
    "quote": "As above, so below. (Hermes Trismegistus, Emerald Tablet)"
  },
  "Creative Word": {
    "quote": "Through the Word all things were made. (John 1:3)"
  },
  "Divine Blueprint": {
    "quote": "According to the pattern shown you on the mountain. (Exodus 25:40)"
  },
  "Manifest Forms": {
    "quote": "The visible world is but a symbol of the invisible. (Upanishads)"
  },
  "Sacred Structure": {
    "quote": "The temple is built according to divine measure. (Ezekiel 43:10)"
  },
  "Divine Order": {
    "quote": "Rita is the cosmic order that governs all existence. (Rig Veda)"
  },
  "Celestial Hierarchy": {
    "quote": "From the highest to the lowest, all beings are interconnected. (Dionysus the Areopagite)"
  },
  "Divine Matrix": {
    "quote": "In Him all things hold together. (Colossians 1:17)"
  },
  "Sacred Numbers": {
    "quote": "All is number. (Pythagoras)"
  },
  "Divine Proportion": {
    "quote": "The harmony of the world is made manifest in Form and Number. (Kepler)"
  },
  "Cosmic Web": {
    "quote": "Indra's net reflects the interconnected nature of all phenomena. (Avatamsaka Sutra)"
  },
  "Sacred Space": {
    "quote": "This is none other than the house of God, and this is the gate of heaven. (Genesis 28:17)"
  },
  "Divine Symmetry": {
    "quote": "The beauty of creation reflects the harmony of its Creator. (Augustine, City of God)"
  },
  "Archetypal Forms": {
    "quote": "The eternal patterns from which all things are formed. (Plato, Republic)"
  },
  "Sacred Measure": {
    "quote": "He has measured the waters in the hollow of his hand. (Isaiah 40:12)"
  },
  "Divine Framework": {
    "quote": "The firmament shows his handiwork. (Psalm 19:1)"
  }
}
