{
"Wisdom Source": { "quote": "The fear of the Lord is the beginning of wisdom, and knowledge of the Holy One is understanding. (Proverbs 9:10)" },
"Eternal Wisdom": { "quote": "Before the mountains were settled in place, before the hills, I was given birth. (Proverbs 8:25)" },
"Universal Wisdom": { "quote": "Wisdom has built her house; she has set up its seven pillars. (Proverbs 9:1)" },
"Wisdom Nature": { "quote": "But the wisdom from above is first pure, then peaceable, gentle, open to reason, full of mercy and good fruits. (James 3:17)" },
"Divine Understanding": { "quote": "He gives wisdom to whom He wills, and whoever has been given wisdom has certainly been given much good. (Quran 2:269)" },
"Wisdom Path": { "quote": "By wisdom a house is built, and through understanding it is established. (Proverbs 24:3)" },
"Sacred Knowledge": { "quote": "Knowledge is a divine light which Allah casts into the heart of whomever He wishes. (Al-Ghazali)" },
"Wisdom Teaching": { "quote": "When the student is ready, the teacher will appear. (Buddhist Proverb)" },
"Inner Wisdom": { "quote": "The kingdom of God is within you. (Luke 17:21)" },
"Wisdom Practice": { "quote": "Wisdom ceases to be wisdom when it becomes too proud to weep, too grave to laugh. (Kahlil Gibran)" },
"Divine Intelligence": { "quote": "The intellect is the finest and most precious gift of creation. (Imam Ali)" },
"Cosmic Wisdom": { "quote": "As above, so below; as below, so above. (Hermes Trismegistus)" },
"Wisdom Manifestation": { "quote": "Wisdom is radiant and unfading. (Wisdom of Solomon 6:12)" },
"Living Wisdom": { "quote": "Let the wise hear and increase in learning, and the one who understands obtain guidance. (Proverbs 1:5)" },
"Wisdom Light": { "quote": "In your light we see light. (Psalm 36:9)" },
"Sacred Understanding": { "quote": "Understanding is the reward of faith. Therefore, seek not to understand that you may believe, but believe that you may understand. (Augustine of Hippo)" },
"Wisdom Integration": { "quote": "Where there is righteousness in the heart, there is beauty in the character. (Buddhist Teaching)" },
"Divine Knowledge": { "quote": "Knowledge without practice is like a tree without fruit. (Al-Ghazali)" },
"Wisdom Transmission": { "quote": "Acquire knowledge and impart it to the people. (Prophet Muhammad)" },
"Eternal Truth": { "quote": "Truth is one, paths are many. (Mahatma Gandhi)" },
"Wisdom Application": { "quote": "Knowledge speaks, but wisdom listens. (Jimi Hendrix)" },
"Sacred Science": { "quote": "The book of nature is written in the language of mathematics. (Galileo Galilei)" },
"Divine Guidance": { "quote": "Your word is a lamp for my feet, a light on my path. (Psalm 119:105)" },
"Wisdom Mystery": { "quote": "The more I learn, the more I realize how much I don't know. (Socrates)" },
"Universal Knowledge": { "quote": "All wisdom comes from the Divine. (Wisdom of Sirach 1:1)" },
"Wisdom Service": { "quote": "The fruit of wisdom is service to humanity. (Sathya Sai Baba)" },
"Divine Philosophy": { "quote": "Philosophy is the love of wisdom. (Pythagoras)" },
"Wisdom Evolution": { "quote": "Yesterday I was clever, so I wanted to change the world. Today I am wise, so I am changing myself. (Rumi)" },
"Sacred Wisdom": { "quote": "The wise person has the wisdom of life. (Lao Tzu)" },
"Divine Understanding": { "quote": "Understanding is a wellspring of life unto him that hath it. (Proverbs 16:22)" }
}
