{
  "Divine Beloved": {
    "quote": "\"I am my beloved's and my beloved is mine.\" (Song of Solomon 6:3)"
  },
  "Mystical Union": {
    "quote": "\"The soul has been united with God like a bride with her bridegroom.\" (St. John of the Cross, Spiritual Canticle)"
  },
  "Sacred Marriage": {
    "quote": "\"As bridegroom to bride, so God rejoices over you.\" (Isaiah 62:5)"
  },
  "Divine Longing": {
    "quote": "\"As the deer pants for streams of water, so my soul pants for you, O God.\" (Psalm 42:1)"
  },
  "Spiritual Intimacy": {
    "quote": "\"Those who love Me will be loved by My Father.\" (John 14:21)"
  },
  "Divine Courtship": {
    "quote": "\"I will allure her and lead her into the wilderness and speak tenderly to her.\" (Hosea 2:14)"
  },
  "Sacred Passion": {
    "quote": "\"Set me as a seal upon your heart, for love is as strong as death.\" (Song of Solomon 8:6)"
  },
  "Divine Embrace": {
    "quote": "\"His left arm is under my head, and his right arm embraces me.\" (Song of Solomon 2:6)"
  },
  "Mystical Love": {
    "quote": "\"The soul in union with God flows with the divine milk.\" (Rumi)"
  },
  "Sacred Unity": {
    "quote": "\"The lover and the Beloved are one.\" (Ibn Arabi)"
  },
  "Divine Yearning": {
    "quote": "\"My heart has no peace without You.\" (Mirabai)"
  },
  "Spiritual Marriage": {
    "quote": "\"The marriage of the soul to Christ.\" (Teresa of Avila, Interior Castle)"
  },
  "Divine Attraction": {
    "quote": "\"Draw me after you and let us run together.\" (Song of Solomon 1:4)"
  },
  "Sacred Connection": {
    "quote": "\"Neither death nor life can separate us from the love of God.\" (Romans 8:38)"
  },
  "Divine Dance": {
    "quote": "\"In your light we see light itself.\" (Psalm 36:9)"
  },
  "Mystical Rapture": {
    "quote": "\"Drowned in the ocean of divine love.\" (Ramakrishna)"
  },
  "Sacred Heart": {
    "quote": "\"God has poured out his love into our hearts.\" (Romans 5:5)"
  },
  "Divine Devotion": {
    "quote": "\"My beloved is radiant and beautiful.\" (Song of Solomon 5:10)"
  },
  "Spiritual Ecstasy": {
    "quote": "\"Lost in the divine intoxication.\" (Hafiz)"
  },
  "Divine Union": {
    "quote": "\"Two hearts beating as one in divine harmony.\" (Kabir)"
  },
  "Sacred Bliss": {
    "quote": "\"In His presence is fullness of joy.\" (Psalm 16:11)"
  },
  "Divine Consummation": {
    "quote": "\"The soul has found its eternal resting place.\" (Catherine of Siena)"
  },
  "Mystical Marriage": {
    "quote": "\"The bridegroom has come for his bride.\" (Matthew 25:6)"
  },
  "Sacred Love": {
    "quote": "\"Love is the bridge between you and everything.\" (Rumi)"
  },
  "Divine Communion": {
    "quote": "\"Deep calls to deep in the roar of your waterfalls.\" (Psalm 42:7)"
  },
   "Initial Awakening": {
    "quote": "\"Awake, O sleeper, and arise from the dead, and Christ will shine on you.\" (Ephesians 5:14)"
  },
  "Divine Call": {
    "quote": "\"My beloved speaks and says to me: 'Arise, my love, my beautiful one, and come away.'\" (Song of Solomon 2:10)"
  },
  "First Stirring": {
    "quote": "\"Draw me after you; let us run.\" (Song of Solomon 1:4)"
  },
  "Sacred Recognition": {
    "quote": "\"I have found the one whom my soul loves.\" (Song of Solomon 3:4)"
  },
  "Initial Longing": {
    "quote": "\"As the deer pants for streams of water, so my soul pants for you, O God.\" (Psalm 42:1)"
  },
  "Divine Attraction": {
    "quote": "\"With loving kindness I have drawn you.\" (Jeremiah 31:3)"
  },
  "Spiritual Pursuit": {
    "quote": "\"I sought him whom my soul loves; I sought him but found him not.\" (Song of Solomon 3:1)"
  },
  "Sacred Courtship": {
    "quote": "\"I will allure her and bring her into the wilderness and speak tenderly to her.\" (Hosea 2:14)"
  },
  "Divine Wooing": {
    "quote": "\"Your love is better than wine.\" (Song of Solomon 1:2)"
  },
  "First Separation": {
    "quote": "\"My beloved had turned and gone... I sought him, but found him not.\" (Song of Solomon 5:6)"
  },
  "Divine Testing": {
    "quote": "\"You have tested my heart; you have visited me by night.\" (Psalm 17:3)"
  },
  "Sacred Purification": {
    "quote": "\"I am black but lovely, O daughters of Jerusalem.\" (Song of Solomon 1:5)"
  },
  "Divine Preparation": {
    "quote": "\"Prepare the way of the Lord.\" (Isaiah 40:3)"
  },
  "Spiritual Surrender": {
    "quote": "\"I sleep, but my heart waketh.\" (Song of Solomon 5:2)"
  },
  "Sacred Betrothal": {
    "quote": "\"I will betroth you to me forever.\" (Hosea 2:19)"
  },
  "Divine Intimacy": {
    "quote": "\"The secret of the Lord is with them that fear him.\" (Psalm 25:14)"
  },
  "Mystical Marriage": {
    "quote": "\"For your Maker is your husband.\" (Isaiah 54:5)"
  },
  "Sacred Consummation": {
    "quote": "\"My beloved is mine, and I am his.\" (Song of Solomon 2:16)"
  },
  "Divine Union": {
    "quote": "\"He who is joined to the Lord becomes one spirit with him.\" (1 Corinthians 6:17)"
  },
  "Spiritual Transformation": {
    "quote": "\"Changed into his likeness from one degree of glory to another.\" (2 Corinthians 3:18)"
  },
  "Divine Absorption": {
    "quote": "\"That they may all be one, just as you, Father, are in me, and I in you.\" (John 17:21)"
  },
  "Sacred Service": {
    "quote": "\"I am my beloved's and his desire is for me.\" (Song of Solomon 7:10)"
  },
  "Divine Cooperation": {
    "quote": "\"We are God's fellow workers.\" (1 Corinthians 3:9)"
  },
  "Eternal Partnership": {
    "quote": "\"Neither death nor life... will be able to separate us from the love of God.\" (Romans 8:38-39)"
  },
  "Complete Fulfillment": {
    "quote": "\"In your presence there is fullness of joy.\" (Psalm 16:11)"
  },
  "Divine Perfection": {
    "quote": "\"When the perfect comes, the partial will pass away.\" (1 Corinthians 13:10)"
  },
  "Sacred Unity": {
    "quote": "\"I in them and you in me, that they may become perfectly one.\" (John 17:23)"
  },
  "Eternal Romance": {
    "quote": "\"I have loved you with an everlasting love.\" (Jeremiah 31:3)"
  },
  "Divine Ecstasy": {
    "quote": "\"You will fill me with joy in your presence.\" (Acts 2:28)"
  },
  "Ultimate Union": {
    "quote": "\"Now we see in a mirror dimly, but then face to face.\" (1 Corinthians 13:12)"
  }
}
