{
"Divine Protection": { "quote": "\"The Lord is my rock, my fortress and my deliverer.\" (Psalm 18:2)" },
"Sacred Refuge": { "quote": "\"Allah is the best protector, and He is the most merciful of the merciful.\" (Quran 12:64)" },
"Spiritual Shield": { "quote": "\"The name of the Lord is a strong tower; the righteous run into it and are safe.\" (Proverbs 18:10)" },
"Divine Shelter": { "quote": "\"Under His wings you will find refuge.\" (Psalm 91:4)" },
"Celestial Guard": { "quote": "\"For he will command his angels concerning you to guard you in all your ways.\" (Psalm 91:11)" },
"Sacred Defense": { "quote": "\"I will say of the Lord, He is my refuge and my fortress, my God, in whom I trust.\" (Psalm 91:2)" },
"Divine Preservation": { "quote": "\"The Lord will keep you from all harm - he will watch over your life.\" (Psalm 121:7)" },
"Eternal Security": { "quote": "\"No one can snatch them out of my Father's hand.\" (John 10:29)" },
"Sacred Sanctuary": { "quote": "\"In the shadow of your wings I will take refuge.\" (Psalm 57:1)" },
"Divine Armor": { "quote": "\"Put on the full armor of God.\" (Ephesians 6:11)" },
"Spiritual Fortress": { "quote": "\"The Lord is good, a stronghold in the day of trouble.\" (Nahum 1:7)" },
"Divine Guardian": { "quote": "\"I am with you and will watch over you wherever you go.\" (Genesis 28:15)" },
"Sacred Shield": { "quote": "\"You are my hiding place; you will protect me from trouble.\" (Psalm 32:7)" },
"Divine Covering": { "quote": "\"He will cover you with his feathers, and under his wings you will find refuge.\" (Psalm 91:4)" },
"Eternal Watch": { "quote": "\"The Lord watches over you—the Lord is your shade at your right hand.\" (Psalm 121:5)" },
"Divine Defense": { "quote": "\"The Lord will fight for you; you need only to be still.\" (Exodus 14:14)" },
"Sacred Protection": { "quote": "\"But you, Lord, are a shield around me.\" (Psalm 3:3)" },
"Divine Safety": { "quote": "\"Safety comes from the Lord.\" (Proverbs 21:31)" },
"Spiritual Security": { "quote": "\"The eternal God is your refuge, and underneath are the everlasting arms.\" (Deuteronomy 33:27)" },
"Divine Care": { "quote": "\"Cast your cares on the Lord and he will sustain you.\" (Psalm 55:22)" },
"Sacred Guardianship": { "quote": "\"I will never leave you nor forsake you.\" (Hebrews 13:5)" },
"Divine Watch": { "quote": "\"The eyes of the Lord are on the righteous.\" (Psalm 34:15)" },
"Eternal Protection": { "quote": "\"The Lord himself goes before you and will be with you.\" (Deuteronomy 31:8)" },
"Sacred Cover": { "quote": "\"He is my shield and the horn of my salvation, my stronghold.\" (Psalm 18:2)" },
"Divine Safeguard": { "quote": "\"The Lord will keep your going out and your coming in.\" (Psalm 121:8)" },
"Spiritual Protection": { "quote": "\"God is our refuge and strength, an ever-present help in trouble.\" (Psalm 46:1)" },
"Divine Haven": { "quote": "\"In God I trust and am not afraid.\" (Psalm 56:11)" },
"Sacred Refuge": { "quote": "\"The Lord's name is a strong tower; the righteous run to it and are safe.\" (Proverbs 18:10)" },
"Divine Shelter": { "quote": "\"He who dwells in the shelter of the Most High will rest in the shadow of the Almighty.\" (Psalm 91:1)" }
}
