{
"Divine Protection": { "quote": "The Lord is my shepherd, I shall not want. (Psalm 23:1)" },
"Divine Assistance": { "quote": "Allah is the best of helpers. (Quran 3:150)" },
"Divine Grace": { "quote": "By grace alone. Thy grace is enough for me. (Guru Granth Sahib)" },
"Divine Intervention": { "quote": "When dharma declines, I manifest myself. (Bhagavad Gita 4:7)" },
"Divine Support": { "quote": "Cast your burden on the Lord, and he will sustain you. (Psalm 55:22)" },
"Divine Guidance": { "quote": "Guide us to the straight path. (Quran 1:6)" },
"Divine Help": { "quote": "Our help is in the name of the Lord, who made heaven and earth. (Psalm 124:8)" },
"Divine Mercy": { "quote": "My mercy embraces all things. (Quran 7:156)" },
"Divine Blessing": { "quote": "May the Lord bless you and keep you. (Numbers 6:24)" },
"Divine Providence": { "quote": "The Lord will provide. (Genesis 22:14)" },
"Divine Strength": { "quote": "I can do all things through Him who strengthens me. (Philippians 4:13)" },
"Divine Deliverance": { "quote": "Call upon Me in the day of trouble; I will deliver you. (Psalm 50:15)" },
"Divine Comfort": { "quote": "Blessed are those who mourn, for they shall be comforted. (Matthew 5:4)" },
"Divine Rescue": { "quote": "He is our refuge and strength, an ever-present help in trouble. (Psalm 46:1)" },
"Divine Shield": { "quote": "You, O Lord, are a shield around me. (Psalm 3:3)" },
"Divine Care": { "quote": "Cast all your anxiety on him because he cares for you. (1 Peter 5:7)" },
"Divine Victory": { "quote": "Victory comes only from Allah, the Mighty, the Wise. (Quran 3:126)" },
"Divine Healing": { "quote": "I am the Lord who heals you. (Exodus 15:26)" },
"Divine Light": { "quote": "The Lord is my light and my salvation. (Psalm 27:1)" },
"Divine Power": { "quote": "Power belongs to Allah. (Quran 2:165)" },
"Divine Presence": { "quote": "I will never leave you nor forsake you. (Hebrews 13:5)" },
"Divine Solutions": { "quote": "With every difficulty there is relief. (Quran 94:5-6)" },
"Divine Answer": { "quote": "Before they call I will answer. (Isaiah 65:24)" },
"Divine Security": { "quote": "The eternal God is your refuge, and underneath are the everlasting arms. (Deuteronomy 33:27)" },
"Divine Defense": { "quote": "The Lord will fight for you; you need only to be still. (Exodus 14:14)" },
"Divine Help": { "quote": "Our help comes from the Lord, the Maker of heaven and earth. (Psalm 121:2)" },
"Divine Support": { "quote": "Fear not, for I am with you. (Isaiah 41:10)" },
"Divine Sustenance": { "quote": "The Lord sustains all who fall. (Psalm 145:14)" },
"Divine Assistance": { "quote": "Surely with hardship comes ease. (Quran 94:6)" },
"Divine Protection": { "quote": "He who dwells in the shelter of the Most High will rest in the shadow of the Almighty. (Psalm 91:1)" }
}
