{
    "Divine Intelligence": { "quote": "\"The divine mind is the supreme intelligence that pervades all existence.\" (Plotinus, Enneads V.1)" },
    "Cosmic Consciousness": { "quote": "\"In the beginning was the Word, and the Word was with God, and the Word was God.\" (John 1:1)" },
    "Divine Wisdom": { "quote": "\"Wisdom has built her house, she has hewn out her seven pillars.\" (Proverbs 9:1)" },
    "Universal Mind": { "quote": "\"The universe is a thought of the deity.\" (Friedrich Schelling)" },
    "Divine Understanding": { "quote": "\"Understanding is the reward of faith. Therefore, seek not to understand that you may believe, but believe that you may understand.\" (Augustine of Hippo)" },
    "Eternal Thought": { "quote": "\"That which is never born and never dies, that is pure consciousness.\" (Upanishads)" },
    "Divine Knowledge": { "quote": "\"Knowledge is as infinite as the stars in the sky.\" (Ramakrishna)" },
    "Supreme Intellect": { "quote": "\"The Active Intellect is the cause of existence.\" (Maimonides, Guide for the Perplexed)" },
    "Divine Contemplation": { "quote": "\"Contemplation is the highest form of activity.\" (Aristotle, Nicomachean Ethics)" },
    "Infinite Mind": { "quote": "\"The infinite mind contains all possibility.\" (Giordano Bruno)" },
    "Divine Reflection": { "quote": "\"As above, so below; as below, so above.\" (Hermes Trismegistus)" },
    "Cosmic Mind": { "quote": "\"The cosmos is within us. We are made of star-stuff. We are a way for the cosmos to know itself.\" (Carl Sagan)" },
    "Divine Cognition": { "quote": "\"In Him we live and move and have our being.\" (Acts 17:28)" },
    "Transcendent Thought": { "quote": "\"Beyond thought, beyond mind, beyond consciousness lies the ultimate truth.\" (Ramana Maharshi)" },
    "Divine Reason": { "quote": "\"The Logos (Divine Reason) pervades everything.\" (Heraclitus)" },
    "Sacred Knowledge": { "quote": "\"Knowledge is light in the heart.\" (Ali ibn Abi Talib)" },
    "Divine Ideas": { "quote": "\"The world of ideas lies within the divine mind.\" (Plato)" },
    "Eternal Wisdom": { "quote": "\"Wisdom was created before all things.\" (Ecclesiasticus 1:4)" },
    "Divine Consciousness": { "quote": "\"Consciousness is the foundation of all being.\" (Vedanta)" },
    "Supreme Understanding": { "quote": "\"Understanding is the beginning of wisdom.\" (Socrates)" },
    "Divine Insight": { "quote": "\"The eye through which I see God is the same eye through which God sees me.\" (Meister Eckhart)" },
    "Cosmic Intelligence": { "quote": "\"The universe is not only queerer than we suppose, but queerer than we can suppose.\" (J.B.S. Haldane)" },
    "Divine Memory": { "quote": "\"Remember Me, and I will remember you.\" (Quran 2:152)" },
    "Eternal Mind": { "quote": "\"Mind is the builder.\" (Edgar Cayce)" },
    "Divine Awareness": { "quote": "\"Awareness is the power that is concealed within the present moment.\" (Eckhart Tolle)" },
    "Supreme Thought": { "quote": "\"As a man thinketh in his heart, so is he.\" (Proverbs 23:7)" },
    "Divine Philosophy": { "quote": "\"Philosophy is the science of the divine.\" (Aristotle)" },
    "Sacred Intelligence": { "quote": "\"The intelligence of the universe is sacred.\" (Native American wisdom)" },
    "Divine Truth": { "quote": "\"Truth is one, paths are many.\" (Mahatma Gandhi)" },
    "Cosmic Understanding": { "quote": "\"To understand all is to forgive all.\" (Buddha)" }
}
