{
  "Nature of Consciousness": {
    "quote": "\"Consciousness is the foundation of all existence.\" (Brihadaranyaka Upanishad 3.8.11)"
  },
  "Levels of Consciousness": {
    "quote": "\"From matter to mind to supermind, consciousness evolves.\" (Sri Aurobindo, The Life Divine)"
  },
  "Universal Consciousness": {
    "quote": "\"All this is Brahman.\" (Chandogya Upanishad 3.14.1)"
  },
  "Pure Consciousness": {
    "quote": "\"That which is the witness of all states is pure consciousness.\" (Yoga Vasistha 5.76)"
  },
  "Divine Awareness": {
    "quote": "\"I know what is past, and what is yet to come.\" (Bhagavad Gita 7:26)"
  },
  "Cosmic Mind": {
    "quote": "\"The universe exists as idea in the cosmic mind.\" (Yoga Sutras 4.24)"
  },
  "Supreme Knowledge": {
    "quote": "\"In that supreme knowledge is contained all knowledge.\" (Mundaka Upanishad 1.1.3)"
  },
  "Transcendental Consciousness": {
    "quote": "\"Beyond thought, beyond form, beyond all qualities.\" (Mandukya Upanishad)"
  },
  "Divine Intelligence": {
    "quote": "\"The divine intelligence permeates all existence.\" (Plotinus, Enneads V.1)"
  },
  "Omniscience": {
    "quote": "\"Nothing in all creation is hidden from God's sight.\" (Hebrews 4:13)"
  },
  "Eternal Witness": {
    "quote": "\"The Self is the eternal witness.\" (Katha Upanishad 2.2.12)"
  },
  "Divine Light": {
    "quote": "\"God is light, and in him is no darkness at all.\" (1 John 1:5)"
  },
  "Infinite Awareness": {
    "quote": "\"The infinite consciousness alone exists.\" (Yoga Vasistha 3.1)"
  },
  "Divine Recognition": {
    "quote": "\"To know thyself is to know God.\" (Clement of Alexandria)"
  },
  "Conscious Force": {
    "quote": "\"Consciousness-Force is the creator of the worlds.\" (Sri Aurobindo, The Life Divine)"
  },
  "Divine Perception": {
    "quote": "\"With divine eyes, I see all.\" (Bhagavad Gita 11:8)"
  },
  "Supreme Understanding": {
    "quote": "\"Understanding of the supreme is supreme understanding.\" (Kena Upanishad)"
  },
  "Divine Wisdom": {
    "quote": "\"The wisdom that comes from above.\" (James 3:17)"
  },
  "Absolute Knowledge": {
    "quote": "\"Knowledge of the Absolute is absolute knowledge.\" (Hegel, Phenomenology of Spirit)"
  },
  "Unity Consciousness": {
    "quote": "\"All is one in divine consciousness.\" (Plotinus, Enneads VI.9)"
  },
  "Divine Mind": {
    "quote": "\"The divine mind contains all possibilities.\" (Nicholas of Cusa)"
  },
  "Spiritual Awareness": {
    "quote": "\"The spirit searches all things, even the deep things of God.\" (1 Corinthians 2:10)"
  },
  "Cosmic Consciousness": {
    "quote": "\"The universe is conscious through and through.\" (Alfred North Whitehead)"
  },
  "Divine Reflection": {
    "quote": "\"As above, so below.\" (Hermes Trismegistus, Emerald Tablet)"
  },
  "Supreme Consciousness": {
    "quote": "\"That supreme consciousness which is one without a second.\" (Chandogya Upanishad)"
  },
  "Divine Knowing": {
    "quote": "\"In knowing the Self, all is known.\" (Upanishads)"
  },
  "Eternal Awareness": {
    "quote": "\"The awareness that never sleeps.\" (Zen teaching)"
  },
  "Divine Understanding": {
    "quote": "\"Understanding dwells in the divine mind.\" (Thomas Aquinas)"
  },
  "Consciousness Force": {
    "quote": "\"Consciousness is force, force is consciousness.\" (Sri Aurobindo)"
  },
  "Divine Presence": {
    "quote": "\"The divine is present as pure consciousness.\" (Kashmir Shaivism)"
  }
}
