{
  "Eternal Condition": {
    "quote": "\"That which never was not, will never not be. That which is, always was and always will be.\" (Bhagavad Gita 2:12)"
  },
  "Divine State": {
    "quote": "\"Be still, and know that I am God.\" (Psalm 46:10)"
  },
  "Sacred Presence": {
    "quote": "\"Wherever two or three gather in my name, there am I with them.\" (Matthew 18:20)"
  },
  "Spiritual Atmosphere": {
    "quote": "\"The wind blows wherever it pleases. You hear its sound, but you cannot tell where it comes from or where it is going.\" (John 3:8)"
  },
  "Divine Consciousness": {
    "quote": "\"The Self is everywhere. Bright is the Self, indivisible, untouched by sin, wise, immanent and transcendent.\" (Isha Upanishad 8)"
  },
  "Sacred Environment": {
    "quote": "\"Holy, holy, holy is the Lord Almighty; the whole earth is full of his glory.\" (Isaiah 6:3)"
  },
  "Divine Harmony": {
    "quote": "\"When all things return to the One, even the One returns to the Source.\" (Zen saying)"
  },
  "Spiritual Climate": {
    "quote": "\"As above, so below; as within, so without.\" (Hermes Trismegistus)"
  },
  "Sacred Space": {
    "quote": "\"This is none other than the house of God; this is the gate of heaven.\" (Genesis 28:17)"
  },
  "Divine Order": {
    "quote": "\"Everything has been created according to a measure.\" (Quran 54:49)"
  },
  "Eternal Now": {
    "quote": "\"There is only the eternal present, in which all times are contained.\" (Meister Eckhart)"
  },
  "Sacred Time": {
    "quote": "\"To everything there is a season, and a time to every purpose under heaven.\" (Ecclesiastes 3:1)"
  },
  "Divine Light": {
    "quote": "\"God is light; in him there is no darkness at all.\" (1 John 1:5)"
  },
  "Spiritual Atmosphere": {
    "quote": "\"Where there is dharma, there is victory.\" (Mahabharata)"
  },
  "Sacred Ground": {
    "quote": "\"Remove your sandals, for the place where you are standing is holy ground.\" (Exodus 3:5)"
  },
  "Divine Peace": {
    "quote": "\"Peace I leave with you; my peace I give you.\" (John 14:27)"
  },
  "Eternal Balance": {
    "quote": "\"The Tao produces one, one produces two, two produces three, three produces all things.\" (Tao Te Ching 42)"
  },
  "Sacred Union": {
    "quote": "\"That which is Below corresponds to that which is Above, and that which is Above corresponds to that which is Below.\" (Emerald Tablet)"
  },
  "Divine Silence": {
    "quote": "\"Silence is the language of God, all else is poor translation.\" (Rumi)"
  },
  "Spiritual State": {
    "quote": "\"The kingdom of God is within you.\" (Luke 17:21)"
  },
  "Sacred Moment": {
    "quote": "\"Every moment and every event of every man's life plants something in his soul.\" (Thomas Merton)"
  },
  "Divine Grace": {
    "quote": "\"By grace are ye saved through faith.\" (Ephesians 2:8)"
  },
  "Eternal Truth": {
    "quote": "\"Truth is one, paths are many.\" (Ramakrishna)"
  },
  "Sacred Path": {
    "quote": "\"There are as many paths to God as there are souls on Earth.\" (Ramakrishna)"
  },
  "Divine Presence": {
    "quote": "\"I am with you always, even unto the end of the world.\" (Matthew 28:20)"
  },
  "Spiritual Reality": {
    "quote": "\"What is real is beyond all reach; what is at hand cannot be real.\" (Chuang Tzu)"
  },
  "Sacred Vision": {
    "quote": "\"Blessed are the pure in heart, for they shall see God.\" (Matthew 5:8)"
  },
  "Divine Unity": {
    "quote": "\"All differences in this world are of degree, and not of kind, because oneness is the secret of everything.\" (Swami Vivekananda)"
  },
  "Eternal Wisdom": {
    "quote": "\"Before Abraham was, I am.\" (John 8:58)"
  },
  "Sacred Knowledge": {
    "quote": "\"Knowledge of the self is the mother of all knowledge.\" (Khalil Gibran)"
  }
}
