{
"Divine Vision": { "quote": "\"Blessed are the pure in heart, for they shall see God.\" (Matthew 5:8)" },
"Inner Sight": { "quote": "\"The eye through which I see God is the same eye through which God sees me.\" (Meister Eckhart)" },
"Spiritual Perception": { "quote": "\"Knowledge is different from perception, as light from reflection.\" (Upanishads)" },
"Divine Awareness": { "quote": "\"Awareness is the nature of Being.\" (Ramana Maharshi)" },
"Sacred Seeing": { "quote": "\"Open thou mine eyes, that I may behold wondrous things.\" (Psalm 119:18)" },
"Mystical Vision": { "quote": "\"In contemplation's font, I saw light-beams in-gathered.\" (Dante, Paradise, XXXIII)" },
"Divine Recognition": { "quote": "\"Who sees all beings in his own Self and his own Self in all beings, loses all fear.\" (Isha Upanishad)" },
"Spiritual Insight": { "quote": "\"The light of the body is the eye: if therefore thine eye be single, thy whole body shall be full of light.\" (Matthew 6:22)" },
"Divine Witnessing": { "quote": "\"Be still and know that I am God.\" (Psalm 46:10)" },
"Sacred Observation": { "quote": "\"Everything in the universe is within you. Ask all from yourself.\" (Rumi)" },
"Divine Discernment": { "quote": "\"The eye of the heart sees more truly than the eye of the head.\" (Islamic tradition)" },
"Spiritual Eyes": { "quote": "\"When the eye is untroubled, the result is sight.\" (Chuang Tzu)" },
"Divine Understanding": { "quote": "\"Understanding is the reward of faith. Therefore, seek not to understand that you may believe, but believe that you may understand.\" (Augustine of Hippo)" },
"Sacred Wisdom": { "quote": "\"Wisdom comes from seeing the Self in all.\" (Bhagavad Gita 13:28)" },
"Divine Knowing": { "quote": "\"That which is the finest essence – this whole world has that as its soul. That is Reality. That is Atman. That art thou.\" (Chandogya Upanishad)" },
"Spiritual Perception Modes": { "quote": "\"There are three ways of seeing: with the eye of flesh, with the eye of reason, and with the eye of contemplation.\" (Bonaventure)" },
"Divine Illumination": { "quote": "\"God is light, and in him is no darkness at all.\" (1 John 1:5)" },
"Sacred Gaze": { "quote": "\"Look with your understanding, find out what you already know, and you'll see the way to fly.\" (Jonathan Livingston Seagull)" },
"Divine Reflection": { "quote": "\"As in a mirror, dimly, but then face to face.\" (1 Corinthians 13:12)" },
"Spiritual Cognition": { "quote": "\"The knower and the known are one.\" (Parmenides)" },
"Divine Revelation": { "quote": "\"Unveil my eyes that I may see the wonders of Your law.\" (Psalm 119:18)" },
"Sacred Knowledge": { "quote": "\"Knowledge of the Self is the mother of all knowledge.\" (Khalil Gibran)" },
"Divine Perception States": { "quote": "\"In your light we see light.\" (Psalm 36:9)" },
"Spiritual Sensation": { "quote": "\"The kingdom of God is within you.\" (Luke 17:21)" },
"Divine Recognition Levels": { "quote": "\"Step by step, let the dead letters form living words.\" (Sufi saying)" },
"Sacred Understanding": { "quote": "\"To see a world in a grain of sand and heaven in a wild flower.\" (William Blake)" },
"Divine Consciousness": { "quote": "\"Consciousness is the screen on which all the pictures come and go.\" (Nisargadatta Maharaj)" },
"Spiritual Vision Modes": { "quote": "\"The eye with which you see God is the same eye with which God sees you.\" (Ibn Arabi)" },
"Divine Perspectives": { "quote": "\"There are as many paths to God as there are souls on Earth.\" (Ramakrishna)" },
"Sacred Insight Methods": { "quote": "\"The heart has its reasons which reason knows not.\" (Blaise Pascal)" }
}
