{
"States of Awareness": { "quote": "\"Pure awareness transcends thinking. It allows you to step outside the chattering negative self-talk and experience peace.\" (Deepak Chopra)" },
"Cosmic Consciousness": { "quote": "\"The cosmic consciousness is not an accident but an inevitability.\" (Sri Aurobindo, The Life Divine)" },
"Universal Awareness": { "quote": "\"As above, so below; as within, so without.\" (Hermes Trismegistus)" },
"Divine Perception": { "quote": "\"The eye through which I see God is the same eye through which God sees me.\" (Meister Eckhart)" },
"Spiritual Awakening": { "quote": "\"Awakening is not changing who you are, but discarding who you are not.\" (Deepak Chopra)" },
"Higher Consciousness": { "quote": "\"The kingdom of heaven is within you.\" (Luke 17:21)" },
"Self-Realization": { "quote": "\"When I know who I am, I know who all is.\" (Ramana Maharshi)" },
"Divine Recognition": { "quote": "\"He who knows himself knows his Lord.\" (Islamic Hadith)" },
"Absolute Awareness": { "quote": "\"That which permeates all, which nothing transcends and which, like the universal space around us, fills everything completely from within and without, that Supreme non-dual Brahman — that thou art.\" (Sankaracharya)" },
"Pure Consciousness": { "quote": "\"Consciousness is the only reality.\" (Nisargadatta Maharaj)" },
"Enlightened Mind": { "quote": "\"The mind is everything. What you think you become.\" (Buddha)" },
"Divine Insight": { "quote": "\"Knowledge is structured in consciousness.\" (Vedic Science)" },
"Unified Awareness": { "quote": "\"All things are united in the One Mind.\" (Zen teaching)" },
"Transcendental Consciousness": { "quote": "\"Beyond the changing and the unchanging, beyond existence and non-existence, is the infinite consciousness.\" (Ashtavakra Gita)" },
"Spiritual Vision": { "quote": "\"Blessed are the pure in heart, for they shall see God.\" (Matthew 5:8)" },
"Divine Knowing": { "quote": "\"Knowledge of the self is the mother of all knowledge.\" (Khalil Gibran)" },
"Expanded Awareness": { "quote": "\"The entire universe is within you. Ask all from yourself.\" (Rumi)" },
"Sacred Understanding": { "quote": "\"Understanding is the beginning of approval.\" (Spinoza)" },
"Divine Presence": { "quote": "\"Be still and know that I am God.\" (Psalm 46:10)" },
"Eternal Witness": { "quote": "\"I am the witness, the eternal pure consciousness.\" (Yoga Sutras)" },
"Divine Reflection": { "quote": "\"As in a mirror, dimly, but then face to face.\" (1 Corinthians 13:12)" },
"Infinite Mind": { "quote": "\"The divine mind is infinitely more extensive than our finite understanding.\" (Leibniz)" },
"Supreme Knowledge": { "quote": "\"The supreme knowledge is to know that God is.\" (Ramakrishna)" },
"Divine Intelligence": { "quote": "\"Intelligence is the mirror of divine intelligence.\" (Islamic Philosophy)" },
"Sacred Awareness": { "quote": "\"In awareness is all manifestation.\" (Kashmir Shaivism)" },
"Divine Wisdom": { "quote": "\"Wisdom comes from communion with God.\" (Augustine)" },
"Cosmic Mind": { "quote": "\"All minds are joined.\" (A Course in Miracles)" },
"Divine Gnosis": { "quote": "\"True knowledge exists in knowing that you know nothing.\" (Socrates)" },
"Universal Mind": { "quote": "\"One consciousness pervades all existence.\" (Upanishads)" },
"Divine Consciousness": { "quote": "\"Consciousness is not in the body; the body is in consciousness.\" (Nisargadatta Maharaj)" }
}
