{
"Types of Discrimination": { "quote": "The Lord looks on the heart, while humans look on outward appearance. (1 Samuel 16:7)" },
"Divine Judgment": { "quote": "With righteousness He shall judge the poor, and decide with equity. (Isaiah 11:4)" },
"Sacred Discernment": { "quote": "Test the spirits to see whether they are from God. (1 John 4:1)" },
"Spiritual Selection": { "quote": "Many are called, but few are chosen. (Matthew 22:14)" },
"Divine Wisdom": { "quote": "The wisdom from above is first pure, then peaceable, gentle, willing to yield. (James 3:17)" },
"Holy Recognition": { "quote": "My sheep hear my voice, and I know them, and they follow me. (John 10:27)" },
"Divine Choice": { "quote": "I have chosen you out of the world. (John 15:19)" },
"Sacred Division": { "quote": "He will separate people one from another as a shepherd separates sheep from goats. (Matthew 25:32)" },
"Divine Testing": { "quote": "The Lord tests the righteous, but his soul hates the wicked. (Psalm 11:5)" },
"Spiritual Differentiation": { "quote": "To distinguish between the holy and the common. (Leviticus 10:10)" },
"Divine Standards": { "quote": "Be holy, for I am holy. (1 Peter 1:16)" },
"Sacred Evaluation": { "quote": "Each one's work will become manifest, for the Day will disclose it. (1 Corinthians 3:13)" },
"Divine Assessment": { "quote": "God will judge the secrets of men. (Romans 2:16)" },
"Holy Distinction": { "quote": "Put a difference between the unclean and the clean. (Leviticus 11:47)" },
"Divine Sorting": { "quote": "The angels will come out and separate the evil from the righteous. (Matthew 13:49)" },
"Sacred Classification": { "quote": "Who may ascend the mountain of the Lord? Those who have clean hands and pure hearts. (Psalm 24:3-4)" },
"Divine Examination": { "quote": "I the Lord search the heart and test the mind. (Jeremiah 17:10)" },
"Holy Separation": { "quote": "Come out from among them and be separate, says the Lord. (2 Corinthians 6:17)" },
"Divine Perception": { "quote": "The Lord knows those who are his. (2 Timothy 2:19)" },
"Sacred Judgment": { "quote": "The judgments of the Lord are true and righteous altogether. (Psalm 19:9)" },
"Divine Distinction": { "quote": "God shows no partiality, but in every nation anyone who fears him is acceptable. (Acts 10:34-35)" },
"Holy Discernment": { "quote": "Solid food is for the mature, who have their powers of discernment trained. (Hebrews 5:14)" },
"Divine Selection": { "quote": "You did not choose me, but I chose you. (John 15:16)" },
"Sacred Refinement": { "quote": "He will sit as a refiner and purifier of silver. (Malachi 3:3)" },
"Divine Validation": { "quote": "The Lord weighs the spirits. (Proverbs 16:2)" },
"Holy Classification": { "quote": "The Lord knows how to rescue the godly from trials. (2 Peter 2:9)" },
"Divine Recognition": { "quote": "I never knew you; depart from me. (Matthew 7:23)" },
"Sacred Differentiation": { "quote": "A time to gather stones together, and a time to cast away stones. (Ecclesiastes 3:5)" },
"Divine Filtering": { "quote": "His winnowing fork is in his hand, to clear his threshing floor. (Matthew 3:12)" },
"Holy Analysis": { "quote": "Let a person examine himself, then. (1 Corinthians 11:28)" }
}
