{
"Glory Manifestation": { "quote": "The heavens declare the glory of God; the skies proclaim the work of his hands. (Psalm 19:1)" },
"Divine Radiance": { "quote": "His glory covered the heavens and his praise filled the earth. His splendor was like the sunrise. (Habakkuk 3:3-4)" },
"Eternal Glory": { "quote": "To Him be glory in the church and in Christ Jesus throughout all generations, forever and ever. (Ephesians 3:21)" },
"Glory Vision": { "quote": "Holy, holy, holy is the Lord Almighty; the whole earth is full of his glory. (Isaiah 6:3)" },
"Divine Majesty": { "quote": "Yours, Lord, is the greatness and the power and the glory and the majesty and the splendor. (1 Chronicles 29:11)" },
"Glory Light": { "quote": "The city does not need the sun or the moon to shine on it, for the glory of God gives it light. (Revelation 21:23)" },
"Divine Splendor": { "quote": "I saw the Lord, high and exalted, seated on a throne; and the train of his robe filled the temple. (Isaiah 6:1)" },
"Glory Presence": { "quote": "Then the cloud covered the tent of meeting, and the glory of the Lord filled the tabernacle. (Exodus 40:34)" },
"Divine Beauty": { "quote": "One thing I ask from the Lord, this only do I seek: to gaze on the beauty of the Lord. (Psalm 27:4)" },
"Glory Revelation": { "quote": "The Word became flesh and made his dwelling among us. We have seen his glory. (John 1:14)" },
"Divine Honor": { "quote": "You are worthy, our Lord and God, to receive glory and honor and power. (Revelation 4:11)" },
"Glory Attributes": { "quote": "To the King of ages, immortal, invisible, the only God, be honor and glory forever and ever. (1 Timothy 1:17)" },
"Divine Excellence": { "quote": "O Lord, our Lord, how majestic is your name in all the earth! (Psalm 8:1)" },
"Glory Experience": { "quote": "And we all, who with unveiled faces contemplate the Lord's glory, are being transformed. (2 Corinthians 3:18)" },
"Divine Grandeur": { "quote": "Great is the Lord and most worthy of praise; his greatness no one can fathom. (Psalm 145:3)" },
"Glory Knowledge": { "quote": "For the earth will be filled with the knowledge of the glory of the Lord as the waters cover the sea. (Habakkuk 2:14)" },
"Divine Brilliance": { "quote": "His face shone like the sun, and his clothes became as white as the light. (Matthew 17:2)" },
"Glory Power": { "quote": "Now to him who is able to do immeasurably more than all we ask or imagine, according to his power that is at work within us. (Ephesians 3:20)" },
"Divine Praise": { "quote": "Praise and glory and wisdom and thanks and honor and power and strength be to our God for ever and ever. (Revelation 7:12)" },
"Glory Reflection": { "quote": "The Son is the radiance of God's glory and the exact representation of his being. (Hebrews 1:3)" },
"Divine Wonder": { "quote": "Many, Lord my God, are the wonders you have done, the things you planned for us. (Psalm 40:5)" },
"Glory Recognition": { "quote": "Declare his glory among the nations, his marvelous deeds among all peoples. (Psalm 96:3)" },
"Divine Exaltation": { "quote": "Be exalted, O God, above the heavens; let your glory be over all the earth. (Psalm 57:5)" },
"Glory Dwelling": { "quote": "The glory of the Lord settled on Mount Sinai. (Exodus 24:16)" },
"Divine Magnitude": { "quote": "Great is the Lord and most worthy of praise; his greatness no one can fathom. (Psalm 145:3)" },
"Glory Purpose": { "quote": "All things were created by him and for him. (Colossians 1:16)" },
"Divine Worship": { "quote": "Give unto the Lord the glory due unto his name; worship the Lord in the beauty of holiness. (Psalm 29:2)" },
"Glory Inheritance": { "quote": "In him we were also chosen, having been predestined according to his purpose. (Ephesians 1:11)" },
"Divine Essence": { "quote": "For from him and through him and for him are all things. To him be the glory forever! (Romans 11:36)" },
"Glory Kingdom": { "quote": "Yours, O Lord, is the greatness and the power and the glory and the majesty and the splendor. (1 Chronicles 29:11)" }
}
