{
"Sacred Space": { "quote": "\"How awesome is this place! This is none other than the house of God, and this is the gate of heaven.\" (Genesis 28:17)" },
"Temple": { "quote": "\"My house shall be called a house of prayer for all peoples.\" (Isaiah 56:7)" },
"Sanctuary Definition": { "quote": "\"The Lord is in his holy temple; let all the earth keep silence before him.\" (Habakkuk 2:20)" },
"Sacred Ground": { "quote": "\"Remove your sandals from your feet, for the place where you stand is holy ground.\" (Exodus 3:5)" },
"Inner Sanctuary": { "quote": "\"Do you not know that you are God's temple and that God's Spirit dwells in you?\" (1 Corinthians 3:16)" },
"Divine Dwelling": { "quote": "\"Verily, the first House appointed for mankind was that at Bakkah (Mecca), full of blessing.\" (Quran 3:96)" },
"Sacred Center": { "quote": "\"In the center of the soul is the divine milieu where the creature touches the Creator.\" (Meister Eckhart)" },
"Holy Places": { "quote": "\"Wherever you turn, there is the Face of Allah.\" (Quran 2:115)" },
"Sanctuary Purpose": { "quote": "\"Let them make me a sanctuary, that I may dwell in their midst.\" (Exodus 25:8)" },
"Sacred Architecture": { "quote": "\"The temple is cosmic space in microcosm.\" (Mircea Eliade, The Sacred and the Profane)" },
"Sanctuary Gates": { "quote": "\"This is the gate of the Lord; the righteous shall enter through it.\" (Psalm 118:20)" },
"Divine Protection": { "quote": "\"The name of the Lord is a strong tower; the righteous run into it and are safe.\" (Proverbs 18:10)" },
"Sacred Boundaries": { "quote": "\"I will be a wall of fire around her, and I will be the glory in her midst.\" (Zechariah 2:5)" },
"Sanctuary Rules": { "quote": "\"Holiness befits your house, O Lord, forevermore.\" (Psalm 93:5)" },
"Sacred Presence": { "quote": "\"The Pure Land is not far from here.\" (Buddha)" },
"Divine Refuge": { "quote": "\"God is our refuge and strength, a very present help in trouble.\" (Psalm 46:1)" },
"Sacred Rituals": { "quote": "\"Worship the Lord in the beauty of holiness.\" (Psalm 29:2)" },
"Sanctuary Peace": { "quote": "\"My soul yearns, even faints, for the courts of the Lord.\" (Psalm 84:2)" },
"Sacred Vessels": { "quote": "\"The vessels of the sanctuary are holy.\" (Numbers 31:6)" },
"Divine Access": { "quote": "\"Let us then with confidence draw near to the throne of grace.\" (Hebrews 4:16)" },
"Sacred Time": { "quote": "\"For a day in your courts is better than a thousand elsewhere.\" (Psalm 84:10)" },
"Sanctuary Service": { "quote": "\"They serve in a copy and shadow of the heavenly sanctuary.\" (Hebrews 8:5)" },
"Sacred Community": { "quote": "\"For where two or three are gathered in my name, there am I among them.\" (Matthew 18:20)" },
"Divine Environment": { "quote": "\"In sacred space, the ordinary becomes extraordinary.\" (Joseph Campbell)" },
"Sanctuary Wisdom": { "quote": "\"The temple is a place of instruction, of revelation, of making covenants.\" (Dalai Lama)" },
"Sacred Orientation": { "quote": "\"From the rising of the sun to its setting, my name is great among the nations.\" (Malachi 1:11)" },
"Divine Atmosphere": { "quote": "\"The whole earth is full of His glory.\" (Isaiah 6:3)" },
"Sanctuary Elements": { "quote": "\"Gold, and silver, and brass, and precious stones adorned the sanctuary.\" (Exodus 35:5)" },
"Sacred Function": { "quote": "\"That they may make me a sanctuary wherein I may dwell among them.\" (Exodus 25:8)" },
"Divine Order": { "quote": "\"Let all things be done decently and in order.\" (1 Corinthians 14:40)" }
}
