{
"Universal Form": { "quote": "The Supreme Lord said: 'Behold My forms, hundreds of thousands, divine and multicolored.' (Bhagavad Gita 11:5)" },
"Formless Essence": { "quote": "There is nothing like unto Him, and He is the Hearing, the Seeing. (Quran 42:11)" },
"Sacred Geometry": { "quote": "God geometrizes continually. (Plato's attributed saying)" },
"Divine Light": { "quote": "Allah is the Light of the heavens and the earth. The example of His light is like a niche within which is a lamp. (Quran 24:35)" },
"Cosmic Body": { "quote": "All the universes exist in Me, and all beings dwell within Me. (Bhagavad Gita 9:4)" },
"Divine Image": { "quote": "So God created mankind in his own image, in the image of God he created them. (Genesis 1:27)" },
"Sacred Manifestation": { "quote": "In the beginning was the Word, and the Word was with God, and the Word was God. (John 1:1)" },
"Form of Beauty": { "quote": "His beauty steals the hearts of millions of Cupids. (Brahma Samhita 5.30)" },
"Divine Symbols": { "quote": "I am the syllable Om in the Vedic mantras. (Bhagavad Gita 7:8)" },
"Sacred Architecture": { "quote": "The temple is the body of God. Its measurements are His measurements. (Vastu Shastra)" },
"Divine Presence": { "quote": "Wheresoever you turn, there is the Face of Allah. (Quran 2:115)" },
"Celestial Forms": { "quote": "As above, so below; as below, so above. (Hermes Trismegistus, Emerald Tablet)" },
"Sacred Patterns": { "quote": "The patterns of the Divine are written in nature's perfect mathematics. (Fibonacci Principle)" },
"Inner Form": { "quote": "The kingdom of God is within you. (Luke 17:21)" },
"Cosmic Design": { "quote": "He has created everything in perfect measure. (Quran 25:2)" },
"Divine Proportions": { "quote": "God forever geometrizes. The universe is written in mathematical language. (Galileo Galilei)" },
"Sacred Visions": { "quote": "Then I saw the Lord, high and exalted, seated on a throne; and the train of his robe filled the temple. (Isaiah 6:1)" },
"Form Transcendence": { "quote": "Neither gross nor subtle, neither short nor long... beyond all attributes is Brahman. (Upanishads)" },
"Divine Attributes": { "quote": "To Him belong the Most Beautiful Names. (Quran 20:8)" },
"Sacred Space": { "quote": "This is none other than the house of God, and this is the gate of heaven. (Genesis 28:17)" },
"Form Expression": { "quote": "As many faiths, so many paths. (Ramakrishna)" },
"Divine Archetypes": { "quote": "In the archetypal world, every form reflects divine intelligence. (Platonic Philosophy)" },
"Sacred Numbers": { "quote": "Number is the ruler of forms and ideas, and the cause of gods and demons. (Pythagoras)" },
"Formless Reality": { "quote": "That which is without form gave birth to form. (Tao Te Ching 14)" },
"Divine Incarnation": { "quote": "For the protection of the good, for the destruction of evil-doers, for the establishment of righteousness, I am born in every age. (Bhagavad Gita 4:8)" },
"Sacred Dimensions": { "quote": "In my Father's house are many mansions. (John 14:2)" },
"Form Emanation": { "quote": "From the One emanates the many, yet the One remains unchanged. (Plotinus, Enneads)" },
"Divine Symmetry": { "quote": "The universe shows us the face of God in mathematical form. (Sir James Jeans)" },
"Sacred Resonance": { "quote": "The whole universe is but the outer shell of inner divine harmony. (Pythagoras)" },
"Form Transformation": { "quote": "All forms are transformations of the one ultimate reality. (Vedantic Philosophy)" }
}
