{
"Nature of Divine Will": { "quote": "\"Thy will be done, on earth as it is in heaven.\" (Matthew 6:10)" },
"Will Manifestation": { "quote": "\"Not my will, but yours be done.\" (Luke 22:42)" },
"Divine Purpose": { "quote": "\"For I know the plans I have for you, declares the Lord.\" (Jeremiah 29:11)" },
"Will Expression": { "quote": "\"Everything that happens is according to the will of Allah.\" (Quran 57:22)" },
"Divine Intention": { "quote": "\"The Lord works out everything to its proper end.\" (Proverbs 16:4)" },
"Will of Heaven": { "quote": "\"Heaven's will is profound and far-reaching.\" (I Ching, Hexagram 1)" },
"Supreme Will": { "quote": "\"The divine will alone exists; there is no other will.\" (Sri Ramana Maharshi)" },
"Divine Direction": { "quote": "\"In all your ways acknowledge Him, and He shall direct your paths.\" (Proverbs 3:6)" },
"Universal Will": { "quote": "\"All things work according to the counsel of His will.\" (Ephesians 1:11)" },
"Will Implementation": { "quote": "\"God's will is manifested through all actions in the universe.\" (Bhagavad Gita 9:8)" },
"Divine Decision": { "quote": "\"What He wills, He does.\" (Psalm 115:3)" },
"Will of Brahman": { "quote": "\"All this is directed by Brahman's will alone.\" (Kena Upanishad 1.5)" },
"Divine Decree": { "quote": "\"When He decrees a matter, He only says to it, 'Be,' and it is.\" (Quran 2:117)" },
"Cosmic Will": { "quote": "\"The Tao moves according to its own way.\" (Tao Te Ching, Chapter 25)" },
"Will Execution": { "quote": "\"Who can thwart what His hand does?\" (Daniel 4:35)" },
"Divine Governance": { "quote": "\"The Lord has established His throne in heaven, and His kingdom rules over all.\" (Psalm 103:19)" },
"Will Alignment": { "quote": "\"Align yourself with the divine will and you will know peace.\" (Augustine of Hippo)" },
"Divine Plan": { "quote": "\"In him we were also chosen, having been predestined according to his plan.\" (Ephesians 1:11)" },
"Will Operation": { "quote": "\"It is God who works in you to will and to act.\" (Philippians 2:13)" },
"Supreme Purpose": { "quote": "\"Everything serves His purpose.\" (Ecclesiastes 3:1)" },
"Divine Command": { "quote": "\"Command belongs to Allah alone.\" (Quran 12:40)" },
"Eternal Will": { "quote": "\"The counsel of the Lord stands forever.\" (Psalm 33:11)" },
"Will Manifestation": { "quote": "\"As above, so below.\" (Hermes Trismegistus)" },
"Divine Authority": { "quote": "\"All authority in heaven and on earth has been given to me.\" (Matthew 28:18)" },
"Perfect Will": { "quote": "\"That you may prove what is that good and acceptable and perfect will of God.\" (Romans 12:2)" },
"Divine Intention": { "quote": "\"For I know the thoughts that I think toward you.\" (Jeremiah 29:11)" },
"Will Implementation": { "quote": "\"What He opens no one can shut, and what He shuts no one can open.\" (Revelation 3:7)" },
"Supreme Direction": { "quote": "\"The steps of a good man are ordered by the Lord.\" (Psalm 37:23)" },
"Divine Purpose": { "quote": "\"According to the purpose of Him who works all things.\" (Ephesians 1:11)" },
"Universal Order": { "quote": "\"From Him and through Him and to Him are all things.\" (Romans 11:36)" }
}
