{
"Nature of Mercy": { "quote": "\"The Lord is gracious and merciful, slow to anger and abounding in steadfast love.\" (Psalm 145:8)" },
"Mercy Attributes": { "quote": "\"Allah is the Most Merciful of the merciful.\" (Quran 12:92)" },
"Divine Compassion": { "quote": "\"The Buddha of Infinite Light and Infinite Life responds with boundless compassion to all beings.\" (Larger Sutra of Immeasurable Life)" },
"Mercy Manifestation": { "quote": "\"I desire mercy, not sacrifice.\" (Matthew 9:13)" },
"Universal Mercy": { "quote": "\"My mercy embraces all things.\" (Quran 7:156)" },
"Paths of Mercy": { "quote": "\"Mercy and truth have met together; righteousness and peace have kissed.\" (Psalm 85:10)" },
"Mercy Practice": { "quote": "\"Be merciful, just as your Father is merciful.\" (Luke 6:36)" },
"Ocean of Mercy": { "quote": "\"The ocean of God's mercy is infinite and boundless.\" (Sri Ramakrishna)" },
"Mercy Qualities": { "quote": "\"The quality of mercy is not strained; it droppeth as the gentle rain from heaven.\" (Shakespeare, The Merchant of Venice)" },
"Forms of Mercy": { "quote": "\"In every act of kindness, divine mercy flows.\" (Rumi)" },
"Mercy Gates": { "quote": "\"The gates of mercy are never shut.\" (Talmud, Berachot 32b)" },
"Mercy Powers": { "quote": "\"By His mercy He makes us see, by His mercy we receive wisdom.\" (Guru Granth Sahib)" },
"Divine Forgiveness": { "quote": "\"He is the Forgiving, the Merciful.\" (Quran 39:53)" },
"Mercy Effects": { "quote": "\"Mercy transforms both giver and receiver.\" (Catherine McAuley)" },
"Mercy Purpose": { "quote": "\"That they may receive mercy and find grace to help in time of need.\" (Hebrews 4:16)" },
"Mercy Teachings": { "quote": "\"Blessed are the merciful, for they shall receive mercy.\" (Matthew 5:7)" },
"Mercy Relations": { "quote": "\"Let us then with confidence draw near to the throne of grace.\" (Hebrews 4:16)" },
"Mercy Process": { "quote": "\"From His fullness we have all received, grace upon grace.\" (John 1:16)" },
"Mercy Experience": { "quote": "\"Taste and see that the Lord is good.\" (Psalm 34:8)" },
"Mercy Dimensions": { "quote": "\"The height and depth, length and breadth of divine mercy surpass understanding.\" (Ephesians 3:18-19)" },
"Mercy Benefits": { "quote": "\"His mercies never come to an end; they are new every morning.\" (Lamentations 3:22-23)" },
"Mercy Symbols": { "quote": "\"The rainbow shall be in the cloud, and I will look on it to remember the everlasting covenant.\" (Genesis 9:16)" },
"Mercy Knowledge": { "quote": "\"To know divine mercy is to know the heart of God.\" (St. Faustina)" },
"Mercy Covenant": { "quote": "\"I will be merciful toward their iniquities, and I will remember their sins no more.\" (Hebrews 8:12)" },
"Mercy Mission": { "quote": "\"Go and learn what this means: 'I desire mercy, not sacrifice.'\" (Matthew 9:13)" },
"Mercy Promise": { "quote": "\"Surely goodness and mercy shall follow me all the days of my life.\" (Psalm 23:6)" },
"Mercy Invitation": { "quote": "\"Come to me, all who labor and are heavy laden, and I will give you rest.\" (Matthew 11:28)" },
"Mercy Victory": { "quote": "\"Mercy triumphs over judgment.\" (James 2:13)" },
"Mercy Heritage": { "quote": "\"From generation to generation His mercy is on those who fear Him.\" (Luke 1:50)" },
"Mercy Presence": { "quote": "\"The Lord is near to all who call on Him in truth.\" (Psalm 145:18)" }
}
