{
  "Transcendence": {
    "quote": "That which is beyond thought and word, yet gives rise to both. (Kena Upanishad 1.3)"
  },
  "Unity": {
    "quote": "All differences dissolve in the One. (Plotinus, Enneads V.8)"
  },
  "Infinity": {
    "quote": "To see a world in a grain of sand, and heaven in a wild flower. (William Blake, Auguries of Innocence)"
  },
  "Immanence": {
    "quote": "Closer is He than breathing, and nearer than hands and feet. (Tennyson, The Higher Pantheism)"
  },
  "Eternity": {
    "quote": "Before Abraham was, I am. (John 8:58)"
  },
  "Omniscience": {
    "quote": "He knows what lies before them and what lies behind them. (Quran 2:255)"
  },
  "Omnipresence": {
    "quote": "Where can I go from your Spirit? Where can I flee from your presence? (Psalm 139:7)"
  },
  "Omnipotence": {
    "quote": "With God all things are possible. (Matthew 19:26)"
  },
  "Creation": {
    "quote": "In the beginning God created the heavens and the earth. (Genesis 1:1)"
  },
  "Providence": {
    "quote": "Even the very hairs of your head are all numbered. (Luke 12:7)"
  },
  "Justice": {
    "quote": "Righteousness and justice are the foundation of your throne. (Psalm 89:14)"
  },
  "Mercy": {
    "quote": "His mercy endures forever. (Psalm 136:1)"
  },
  "Grace": {
    "quote": "By grace you have been saved through faith. (Ephesians 2:8)"
  },
  "Love": {
    "quote": "God is love, and whoever abides in love abides in God. (1 John 4:16)"
  },
  "Wisdom": {
    "quote": "The Lord by wisdom founded the earth. (Proverbs 3:19)"
  },
  "Truth": {
    "quote": "I am the way, the truth, and the life. (John 14:6)"
  },
  "Beauty": {
    "quote": "One thing I have desired of the Lord: to behold the beauty of the Lord. (Psalm 27:4)"
  },
  "Consciousness": {
    "quote": "That which knows all thoughts, yet is itself unknown. (Kena Upanishad 1.6)"
  },
  "Being": {
    "quote": "I am who I am. (Exodus 3:14)"
  },
  "Non-Being": {
    "quote": "The Tao is empty, yet inexhaustible. (Tao Te Ching 4)"
  },
  "Silence": {
    "quote": "Be still, and know that I am God. (Psalm 46:10)"
  },
  "Light": {
    "quote": "God is light, and in Him there is no darkness at all. (1 John 1:5)"
  },
  "Word": {
    "quote": "In the beginning was the Word, and the Word was with God, and the Word was God. (John 1:1)"
  },
  "Life": {
    "quote": "In Him was life, and that life was the light of all mankind. (John 1:4)"
  }
}
