{
"Nature of Call": { "quote": "Many are called, but few are chosen. (Matthew 22:14)" },
"Divine Invitation": { "quote": "Come to Me, all who are weary and heavy-laden, and I will give you rest. (Matthew 11:28)" },
"Spiritual Awakening": { "quote": "Arise! Awake! And stop not until the goal is reached. (Katha Upanishad 1.3.14)" },
"Inner Voice": { "quote": "And your Lord inspired to the bee, 'Take for yourself among the mountains, houses.' (Quran 16:68)" },
"Sacred Purpose": { "quote": "Before I formed you in the womb I knew you, before you were born I set you apart. (Jeremiah 1:5)" },
"Divine Guidance": { "quote": "My sheep hear My voice, and I know them, and they follow Me. (John 10:27)" },
"Spiritual Journey": { "quote": "The journey of a thousand miles begins with a single step. (Tao Te Ching, Chapter 64)" },
"Call to Service": { "quote": "Here am I. Send me! (Isaiah 6:8)" },
"Divine Communication": { "quote": "Be still, and know that I am God. (Psalm 46:10)" },
"Sacred Mission": { "quote": "Go therefore and make disciples of all nations. (Matthew 28:19)" },
"Mystical Experience": { "quote": "The breeze at dawn has secrets to tell you. Don't go back to sleep. (Rumi)" },
"Spiritual Recognition": { "quote": "Those who have ears to hear, let them hear. (Matthew 11:15)" },
"Divine Summons": { "quote": "O you who believe! Respond to Allah and His Messenger when he calls you. (Quran 8:24)" },
"Sacred Duty": { "quote": "Stand firm in your duty and abandon all attachment to the success or failure of your work. (Bhagavad Gita 2:48)" },
"Inner Awakening": { "quote": "Wake up! Run for shelter to your preceptor. (Mundaka Upanishad 1.2.13)" },
"Call to Truth": { "quote": "Then I heard the voice of the Lord saying, 'Whom shall I send?' (Isaiah 6:8)" },
"Spiritual Direction": { "quote": "Your own Self-realization is the greatest service you can render the world. (Ramana Maharshi)" },
"Divine Response": { "quote": "Seek and you shall find, knock and the door shall be opened. (Matthew 7:7)" },
"Sacred Connection": { "quote": "The kingdom of God is within you. (Luke 17:21)" },
"Universal Call": { "quote": "Truth is one, though sages know it by many names. (Rig Veda 1.164.46)" },
"Divine Purpose": { "quote": "For we are God's handiwork, created in Christ Jesus to do good works. (Ephesians 2:10)" },
"Spiritual Quest": { "quote": "Not all those who wander are lost. (J.R.R. Tolkien)" },
"Call to Action": { "quote": "Rise up and establish prayer. (Quran 4:103)" },
"Inner Transformation": { "quote": "Be transformed by the renewing of your mind. (Romans 12:2)" },
"Sacred Path": { "quote": "There are many paths to the top of the mountain, but the view is always the same. (Chinese Proverb)" },
"Divine Initiative": { "quote": "You did not choose me, but I chose you. (John 15:16)" },
"Spiritual Calling": { "quote": "Follow your bliss and the universe will open doors where there were only walls. (Joseph Campbell)" },
"Sacred Responsibility": { "quote": "To whom much is given, much will be required. (Luke 12:48)" },
"Divine Voice": { "quote": "Today, if you hear his voice, do not harden your hearts. (Hebrews 3:15)" },
"Universal Message": { "quote": "Let anyone who has an ear listen to what the Spirit is saying. (Revelation 2:7)" }
}
