{
"Names of Divine Child": { "quote": "\"For to us a child is born, to us a son is given... and his name shall be called Wonderful Counselor, Mighty God, Everlasting Father, Prince of Peace.\" (Isaiah 9:6)" },
"Divine Offspring": { "quote": "\"I have said, 'You are gods, children of the Most High, all of you.'\" (Psalm 82:6)" },
"Divine Birth": { "quote": "\"The Word became flesh and made his dwelling among us.\" (John 1:14)" },
"Divine Childhood": { "quote": "\"Krishna, the divine child, played among the cowherds of Vrindavan.\" (Bhagavata Purana 10.8)" },
"Divine Innocence": { "quote": "\"Unless you change and become like little children, you will never enter the kingdom of heaven.\" (Matthew 18:3)" },
"Divine Son": { "quote": "\"You are my Son; today I have become your Father.\" (Psalm 2:7)" },
"Divine Daughter": { "quote": "\"Kanya Kumari, the virgin goddess, eternal divine daughter.\" (Tamil tradition)" },
"Child Avatars": { "quote": "\"The divine child Murugan, born of wisdom-fire, emerged to lead the celestial forces.\" (Skanda Purana)" },
"Divine Play": { "quote": "\"The child Krishna's divine play (lila) reveals cosmic truths through innocent games.\" (Bhagavata Purana)" },
"Child Saints": { "quote": "\"Even as a child he was filled with the Holy Spirit.\" (Luke 1:15)" },
"Divine Education": { "quote": "\"And Jesus grew in wisdom and stature, and in favor with God and man.\" (Luke 2:52)" },
"Divine Protection": { "quote": "\"A little child shall lead them.\" (Isaiah 11:6)" },
"Divine Qualities": { "quote": "\"The divine child embodies perfect wisdom in innocent form.\" (Tibetan Buddhism)" },
"Sacred Childhood": { "quote": "\"The child is father of the man.\" (William Wordsworth, inspired by divine vision)" },
"Divine Growth": { "quote": "\"The child grew and became strong in spirit.\" (Luke 1:80)" },
"Divine Mission": { "quote": "\"Before I formed you in the womb I knew you, before you were born I set you apart.\" (Jeremiah 1:5)" },
"Divine Teachings": { "quote": "\"Out of the mouth of babes and sucklings you have prepared praise.\" (Matthew 21:16)" },
"Divine Heritage": { "quote": "\"See what great love the Father has lavished on us, that we should be called children of God!\" (1 John 3:1)" },
"Divine Potential": { "quote": "\"The kingdom of God belongs to such as these.\" (Mark 10:14)" },
"Child Manifestation": { "quote": "\"The divine child manifests to restore dharma and bring joy.\" (Hindu tradition)" },
"Divine Wonder": { "quote": "\"And a little child shall lead them in paths of peace.\" (Isaiah 11:6)" },
"Sacred Birth": { "quote": "\"Born not of blood, nor of the will of the flesh, nor of the will of man, but of God.\" (John 1:13)" },
"Divine Symbolism": { "quote": "\"The child represents the perfect union of heaven and earth.\" (Carl Jung, on the divine child archetype)" },
"Child Wisdom": { "quote": "\"The pure heart of a child reflects divine wisdom.\" (Zen teaching)" },
"Divine Purpose": { "quote": "\"This child is destined to cause the falling and rising of many.\" (Luke 2:34)" },
"Divine Nature": { "quote": "\"As children of light, walk in the light.\" (Ephesians 5:8)" },
"Sacred Inheritance": { "quote": "\"If we are children, then we are heirs—heirs of God and co-heirs with Christ.\" (Romans 8:17)" },
"Divine Recognition": { "quote": "\"Out of Egypt I called my son.\" (Hosea 11:1)" },
"Divine Promise": { "quote": "\"I will be a Father to you, and you will be my sons and daughters.\" (2 Corinthians 6:18)" },
"Sacred Journey": { "quote": "\"The child increased in wisdom and in years, and in divine and human favor.\" (Luke 2:52)" }
}
