{
  "King of Kings": {
    "quote": "And on His robe and on His thigh He has a name written, 'KING OF KINGS, AND LORD OF LORDS.' (Revelation 19:16)"
  },
  "The Most High": {
    "quote": "I will praise the LORD according to His righteousness, And will sing praise to the name of the LORD Most High. (Psalm 7:17)"
  },
  "The Ancient of Days": {
    "quote": "The Ancient of Days took His seat; His vesture was like white snow And the hair of His head like pure wool. (Daniel 7:9)"
  },
  "The Almighty": {
    "quote": "I am the Almighty God; walk before me, and be thou perfect. (Genesis 17:1)"
  },
  "Supreme Being": {
    "quote": "The Supreme Being is the source of all emanations and the foundation of existence itself. (Vedic Texts)"
  },
  "Lord of Hosts": {
    "quote": "Holy, holy, holy is the LORD of hosts; the whole earth is full of His glory! (Isaiah 6:3)"
  },
  "The All-Merciful": {
    "quote": "The Most Gracious, the Most Merciful, Master of the Day of Judgment. (Quran 1:3-4)"
  },
  "The Creator": {
    "quote": "Remember also your Creator in the days of your youth. (Ecclesiastes 12:1)"
  },
  "The Preserver": {
    "quote": "The Lord is faithful, who shall establish you and guard you from evil. (2 Thessalonians 3:3)"
  },
  "The Destroyer": {
    "quote": "I am become Death, the destroyer of worlds. (Bhagavad Gita 11:32)"
  },
  "The Alpha and Omega": {
    "quote": "I am the Alpha and the Omega, the beginning and the end, says the Lord God. (Revelation 1:8)"
  },
  "The Light of the World": {
    "quote": "I am the light of the world. Whoever follows me will not walk in darkness. (John 8:12)"
  },
  "The Great Spirit": {
    "quote": "The Great Spirit is in all things: the air we breathe, the trees, the grass, the clouds. (Native American Tradition)"
  },
  "The Divine Mother": {
    "quote": "The Divine Mother is the power behind all creation, preservation, and dissolution. (Devi Mahatmya)"
  },
  "The Absolute": {
    "quote": "The Absolute is beyond all attributes and forms, yet contains all within itself. (Advaita Vedanta)"
  },
  "The Living God": {
    "quote": "My soul thirsts for God, for the living God. (Psalm 42:2)"
  },
  "The Eternal One": {
    "quote": "Before the mountains were brought forth, or ever you had formed the earth and the world, from everlasting to everlasting you are God. (Psalm 90:2)"
  },
  "The Supreme Teacher": {
    "quote": "The Lord himself is the supreme teacher who awakens wisdom in the soul. (Upanishads)"
  },
  "The Good Shepherd": {
    "quote": "I am the good shepherd. The good shepherd lays down his life for the sheep. (John 10:11)"
  },
  "The Source of All": {
    "quote": "From whom all beings originate and to whom all return. (Bhagavad Gita)"
  },
  "The Most High God": {
    "quote": "Melchizedek was priest of God Most High, Creator of heaven and earth. (Genesis 14:18-19)"
  },
  "The Holy One": {
    "quote": "Holy, Holy, Holy, is the LORD of hosts, The whole earth is full of His glory. (Isaiah 6:3)"
  },
  "The Divine Architect": {
    "quote": "The great architect of the universe built all things by measure, number, and weight. (Wisdom 11:20)"
  },
  "The All-Knowing": {
    "quote": "His knowledge encompasses the heavens and the earth. (Quran 2:255)"
  },
  "The Wise One": {
    "quote": "O the depth of the riches both of the wisdom and knowledge of God! (Romans 11:33)"
  },
  "The Supreme Soul": {
    "quote": "The Supreme Soul dwells in the heart of all beings. (Bhagavad Gita 13:17)"
  },
  "The First and the Last": {
    "quote": "I am the First and I am the Last; besides Me there is no God. (Isaiah 44:6)"
  },
  "The Lord of All": {
    "quote": "The earth is the Lord's, and everything in it, the world, and all who live in it. (Psalm 24:1)"
  },
  "The All-Compassionate": {
    "quote": "The Lord is gracious and compassionate, slow to anger and rich in love. (Psalm 145:8)"
  },
  "The Perfect One": {
    "quote": "As for God, His way is perfect; the word of the LORD is flawless. (Psalm 18:30)"
  },
  "The All-Powerful": {
    "quote": "With God all things are possible. (Matthew 19:26)"
  },
  "The Ever-Present": {
    "quote": "Do I not fill heaven and earth? declares the LORD. (Jeremiah 23:24)"
  },
  "The Universal Sovereign": {
    "quote": "The LORD has established his throne in heaven, and his kingdom rules over all. (Psalm 103:19)"
  },
  "The Divine Protector": {
    "quote": "The LORD is my rock, my fortress and my deliverer. (Psalm 18:2)"
  },
  "The Highest Truth": {
    "quote": "I am the way, the truth, and the life. (John 14:6)"
  },
  "The Supreme Guide": {
    "quote": "For this God is our God forever and ever; he will be our guide even to the end. (Psalm 48:14)"
  }
}
