{
  "Divine Character": {
    "quote": "\"God is light; in him there is no darkness at all.\" (1 John 1:5)"
  },
  "Divine Expression": {
    "quote": "\"As a man acts, so does he become.\" (Brihadaranyaka Upanishad 4.4.5)"
  },
  "Divine Consciousness": {
    "quote": "\"I am the consciousness that resides in all beings.\" (Bhagavad Gita 10:20)"
  },
  "Divine Will": {
    "quote": "\"Not my will, but yours be done.\" (Luke 22:42)"
  },
  "Divine Temperament": {
    "quote": "\"The Lord is compassionate and gracious, slow to anger, abounding in love.\" (Psalm 103:8)"
  },
  "Divine Moods": {
    "quote": "\"My love and my wrath are both aspects of my mercy.\" (Hadith Qudsi)"
  },
  "Divine Behavior": {
    "quote": "\"Be perfect, therefore, as your heavenly Father is perfect.\" (Matthew 5:48)"
  },
  "Divine Qualities": {
    "quote": "\"Truth, knowledge, infinity is Brahman.\" (Taittiriya Upanishad 2.1)"
  },
  "Divine Emotions": {
    "quote": "\"For the Lord your God is a consuming fire, a jealous God.\" (Deuteronomy 4:24)"
  },
  "Divine Intelligence": {
    "quote": "\"O Lord, how manifold are your works! In wisdom you have made them all.\" (Psalm 104:24)"
  },
  "Divine Wisdom": {
    "quote": "\"The Tao gives birth to all beings, nourishes them, maintains them.\" (Tao Te Ching 51)"
  },
  "Divine Mind": {
    "quote": "\"For who has known the mind of the Lord?\" (Romans 11:34)"
  },
  "Divine Heart": {
    "quote": "\"I have loved you with an everlasting love.\" (Jeremiah 31:3)"
  },
  "Divine Spirit": {
    "quote": "\"God is spirit, and his worshipers must worship in spirit and in truth.\" (John 4:24)"
  },
  "Divine Presence": {
    "quote": "\"Where can I go from your Spirit? Where can I flee from your presence?\" (Psalm 139:7)"
  },
  "Divine Voice": {
    "quote": "\"Be still, and know that I am God.\" (Psalm 46:10)"
  },
  "Divine Understanding": {
    "quote": "\"His understanding has no limit.\" (Psalm 147:5)"
  },
  "Divine Communication": {
    "quote": "\"In the past God spoke to our ancestors through the prophets... but in these last days he has spoken to us by his Son.\" (Hebrews 1:1-2)"
  },
  "Divine Authority": {
    "quote": "\"All authority in heaven and on earth has been given to me.\" (Matthew 28:18)"
  },
  "Divine Leadership": {
    "quote": "\"The Lord is my shepherd, I lack nothing.\" (Psalm 23:1)"
  },
  "Divine Spontaneity": {
    "quote": "\"The wind blows wherever it pleases... So it is with everyone born of the Spirit.\" (John 3:8)"
  },
  "Divine Creativity": {
    "quote": "\"See, I am making all things new.\" (Revelation 21:5)"
  },
  "Divine Response": {
    "quote": "\"Call to me and I will answer you.\" (Jeremiah 33:3)"
  },
  "Divine Interaction": {
    "quote": "\"Draw near to God and He will draw near to you.\" (James 4:8)"
  },
  "Divine Experience": {
    "quote": "\"Taste and see that the Lord is good.\" (Psalm 34:8)"
  },
  "Divine Attitude": {
    "quote": "\"For I know the plans I have for you, plans to prosper you and not to harm you.\" (Jeremiah 29:11)"
  },
  "Divine Disposition": {
    "quote": "\"The Lord delights in those who fear him, who put their hope in his unfailing love.\" (Psalm 147:11)"
  },
  "Divine Traits": {
    "quote": "\"I am gentle and humble in heart.\" (Matthew 11:29)"
  },
  "Divine Characteristics": {
    "quote": "\"Every good and perfect gift is from above, coming down from the Father of the heavenly lights, who does not change like shifting shadows.\" (James 1:17)"
  },
  "Divine Nature": {
    "quote": "\"In him we live and move and have our being.\" (Acts 17:28)"
  }
}
