{
"Title": { "quote": "The name given to the resource. 'Pride and Prejudice' is the title of Jane Austen's novel." },
"Creator": { "quote": "The entity primarily responsible for making the resource. Leonardo da Vinci is the creator of the Mona Lisa painting." },
"Subject": { "quote": "The topic of the resource, typically expressed as keywords or classification codes. 'Climate change' is a subject for an environmental science paper." },
"Description": { "quote": "An account of the resource's content. An abstract summarizing research findings is a description of a scholarly article." },
"Publisher": { "quote": "The entity responsible for making the resource available. Oxford University Press is the publisher of many academic books." },
"Contributor": { "quote": "An entity responsible for making contributions to the resource. An illustrator who provided images for a textbook is a contributor." },
"Date": { "quote": "A point or period of time associated with the resource. '2023-04-15' might be the publication date of a journal article." },
"Type": { "quote": "The nature or genre of the resource. 'Image', 'Text', or 'Sound' describe different types of digital resources." },
"Format": { "quote": "The file format, physical medium, or dimensions of the resource. 'PDF', 'JPEG', or '21 x 30 cm' are examples of format." },
"Identifier": { "quote": "An unambiguous reference to the resource within a given context. A DOI like '10.1000/182' uniquely identifies a scholarly article." },
"Source": { "quote": "A related resource from which the described resource is derived. A digitized photograph's source might be the original physical photograph." },
"Language": { "quote": "The language of the resource. 'en' indicates English content according to ISO 639-1 codes." },
"Relation": { "quote": "A related resource. 'IsPartOf' might relate a book chapter to its containing book." },
"Coverage": { "quote": "The spatial or temporal topic of the resource. 'North America; 1900-1999' indicates geographical and time period coverage." },
"Rights": { "quote": "Information about rights held in and over the resource. 'Creative Commons Attribution 4.0' describes permitted uses of the resource." },
"Audience": { "quote": "The class of entity for whom the resource is intended or useful. 'Elementary school students' describes an intended audience for educational materials." },
"Provenance": { "quote": "A statement of changes in ownership and custody of the resource. 'Transferred from the British Museum to the National Gallery in 1824' documents provenance." },
"RightsHolder": { "quote": "A person or organization owning or managing rights over the resource. 'Estate of Ernest Hemingway' may be the rights holder for an author's works." },
"Instructional Method": { "quote": "A process used to engender knowledge, attitudes, or skills. 'Problem-based learning' describes how educational resources might be used." },
"Accrual Method": { "quote": "The method by which items are added to a collection. 'Donation' indicates how a library acquired materials." },
"Accrual Periodicity": { "quote": "The frequency with which items are added to a collection. 'Annual' describes regular additions to an archive." },
"Accrual Policy": { "quote": "The policy governing addition of items to a collection. 'Active collection in defined subject areas' describes an acquisition strategy." },
"Alternative Title": { "quote": "An alternative name for the resource. 'War and Peace' is known in Russian as 'Война и мир' (Voyna i mir)." },
"Table of Contents": { "quote": "A list of subunits of the resource. The chapter titles of a book constitute its table of contents." },
"Abstract": { "quote": "A summary of the resource's content. A concise summary preceding a research article is its abstract." },
"Created": { "quote": "Date of creation of the resource. A sculpture might have been created in 1504 but only acquired by a museum in 1939." },
"Valid": { "quote": "Date or date range during which the resource is valid. A legal document might be valid from 2022-01-01 to 2025-12-31." },
"Available": { "quote": "Date when the resource became or will become available. An embargoed thesis might become available six months after completion." },
"Issued": { "quote": "Date of formal issuance of the resource. A government report might be issued on a specific date." },
"Modified": { "quote": "Date when the resource was changed. A website's last update date tracks its modifications." },
"Extent": { "quote": "The size or duration of the resource. '350 pages' or '1 hour, 30 minutes' describes the extent of a book or film." }
}
