{
"Names of Ein Sof": { "quote": "Ein Sof means 'without end,' 'infinite,' or 'endless.' It represents God prior to any self-manifestation. (Zohar 3:288b)" },
"Divine Essence": { "quote": "Ein Sof cannot be conceived, for it is absolute unity, complete simplicity, and utterly without attributes. (Moses Cordovero, Pardes Rimonim)" },
"Divine Concealment": { "quote": "Before all things were created... there was only Ein Sof. (Chaim Vital, Etz Chaim 1:1)" },
"Divine Infinity": { "quote": "Ein Sof is neither conceivable nor attainable by thoughts. (Isaac Luria)" },
"Definitions": { "quote": "Ein Sof is the hidden God, as distinguished from the God manifested in the Sefirot. (Zohar 1:21a)" },
"Divine Fundamentals": { "quote": "Ein Sof is the ultimate reality from which all creation emerges. (Moshe Chaim Luzzatto, Derech Hashem)" },
"Divine Identity": { "quote": "Ein Sof transcends both being and non-being. (Azriel of Gerona)" },
"Divine Nature": { "quote": "Ein Sof contains all things in perfect unity before they emerge into differentiation. (Zohar 1:65a)" },
"Divine Aspects": { "quote": "Ein Sof has no attributes, yet contains the potential for all attributes. (Moses Cordovero)" },
"Divine Process": { "quote": "Through tzimtzum (divine contraction), Ein Sof makes space for creation. (Isaac Luria, Etz Chaim)" },
"Divine Reality": { "quote": "Ein Sof is the limitless divine plenum in which all things exist. (Zohar 3:288a)" },
"Divine Manifestation": { "quote": "The Sefirot are vessels through which Ein Sof reveals itself. (Bahir 125)" },
"Divine Concealment": { "quote": "Ein Sof remains forever hidden while manifesting through the Sefirot. (Moses Cordovero)" },
"Divine Knowledge": { "quote": "No thought can grasp Ein Sof at all. (Zohar 3:288b)" },
"Divine Properties": { "quote": "Ein Sof transcends all qualities and descriptions. (Azriel of Gerona)" },
"Divine Unity": { "quote": "In Ein Sof, all opposites are united in perfect harmony. (Moses Cordovero)" },
"Divine Light": { "quote": "The light of Ein Sof radiates through all worlds. (Isaac Luria)" },
"Divine Will": { "quote": "Creation emerges through the will of Ein Sof. (Chaim Vital)" },
"Divine Presence": { "quote": "Ein Sof is equally present in all things, yet transcends them all. (Baal Shem Tov)" },
"Divine Source": { "quote": "All existence flows from and returns to Ein Sof. (Moses Cordovero)" },
"Divine Mystery": { "quote": "Ein Sof is the ultimate mystery that cannot be comprehended. (Zohar 1:21a)" },
"Divine Ground": { "quote": "Ein Sof is the ground of all being and non-being. (Azriel of Gerona)" },
"Divine Essence": { "quote": "The essence of Ein Sof cannot be grasped by any created being. (Isaac Luria)" },
"Divine Transcendence": { "quote": "Ein Sof transcends all names and attributes. (Moses Cordovero)" },
"Divine Immanence": { "quote": "Ein Sof permeates all reality while remaining beyond it. (Baal Shem Tov)" }
}
