{
"Names of Elohim": { "quote": "These are the generations of the heavens and of the earth when they were created, in the day that YHWH Elohim made the earth and the heavens. (Genesis 2:4)" },
"Divine Creation": { "quote": "In the beginning Elohim created the heavens and the earth. (Genesis 1:1)" },
"Divine Justice": { "quote": "For Elohim will bring every deed into judgment, including every hidden thing, whether it is good or evil. (Ecclesiastes 12:14)" },
"Divine Power": { "quote": "Who is like You, Elohim, among the mighty? Who is like You, majestic in holiness? (Exodus 15:11)" },
"Divine Wisdom": { "quote": "For YHWH gives wisdom; from His mouth come knowledge and understanding. (Proverbs 2:6)" },
"Divine Unity": { "quote": "Hear, O Israel: YHWH our Elohim, YHWH is One. (Deuteronomy 6:4)" },
"Divine Law": { "quote": "The law of Elohim is perfect, refreshing the soul. (Psalm 19:7)" },
"Divine Presence": { "quote": "Where can I go from Your Spirit? Where can I flee from Your presence? (Psalm 139:7)" },
"Divine Providence": { "quote": "The eyes of YHWH are everywhere, keeping watch on the wicked and the good. (Proverbs 15:3)" },
"Divine Judgment": { "quote": "Elohim is a righteous judge, and a God who feels indignation every day. (Psalm 7:11)" },
"Divine Mercy": { "quote": "But You, O Lord, are a God merciful and gracious, slow to anger and abounding in steadfast love and faithfulness. (Psalm 86:15)" },
"Divine Truth": { "quote": "The sum of Your word is truth, and every one of Your righteous rules endures forever. (Psalm 119:160)" },
"Divine Holiness": { "quote": "Who is able to stand before YHWH, this holy Elohim? (1 Samuel 6:20)" },
"Divine Sovereignty": { "quote": "Yours, O YHWH, is the greatness and the power and the glory and the victory and the majesty. (1 Chronicles 29:11)" },
"Divine Protection": { "quote": "The name of YHWH is a strong tower; the righteous run into it and are safe. (Proverbs 18:10)" },
"Divine Knowledge": { "quote": "Great is our Lord, and abundant in power; His understanding is beyond measure. (Psalm 147:5)" },
"Divine Covenant": { "quote": "I will establish My covenant between Me and you and your offspring after you throughout their generations. (Genesis 17:7)" },
"Divine Voice": { "quote": "The voice of YHWH is powerful; the voice of YHWH is full of majesty. (Psalm 29:4)" },
"Divine Glory": { "quote": "The heavens declare the glory of El; the skies proclaim the work of His hands. (Psalm 19:1)" },
"Divine Eternity": { "quote": "Before the mountains were brought forth, or ever You had formed the earth and the world, from everlasting to everlasting You are El. (Psalm 90:2)" },
"Divine Authority": { "quote": "For YHWH is the great El, the great King above all gods. (Psalm 95:3)" },
"Divine Attributes": { "quote": "YHWH, YHWH, a God merciful and gracious, slow to anger, and abounding in steadfast love and faithfulness. (Exodus 34:6)" },
"Divine Names": { "quote": "I appeared to Abraham, to Isaac, and to Jacob, as El Shaddai. (Exodus 6:3)" },
"Divine Righteousness": { "quote": "Righteous are You, O YHWH, and right are Your rules. (Psalm 119:137)" },
"Divine Will": { "quote": "Our Elohim is in the heavens; He does all that He pleases. (Psalm 115:3)" },
"Divine Blessing": { "quote": "May Elohim be gracious to us and bless us and make His face to shine upon us. (Psalm 67:1)" },
"Divine Peace": { "quote": "YHWH will bless His people with peace. (Psalm 29:11)" },
"Divine Commandments": { "quote": "And Elohim spoke all these words, saying... (Exodus 20:1)" },
"Divine Redemption": { "quote": "I am YHWH your Elohim, who brought you out of the land of Egypt, out of the house of slavery. (Exodus 20:2)" },
"Divine Guidance": { "quote": "Your word is a lamp to my feet and a light to my path. (Psalm 119:105)" }
}
