{
  "Effusion": {
    "short_description": "The process of flowing or pouring out from a source, often representing the initial stages of emanation."
  },
  "Radiation": {
    "short_description": "The emission or transmission of energy or influence from a central point, often representing the outward flow of emanation."
  },
  "Diffusion": {
    "short_description": "The spreading or dispersal of energy, influence, or substance from a central point, often representing the gradual expansion of emanation."
  },
  "Propagation": {
    "short_description": "The transmission or spreading of energy, influence, or information through a medium or channel, often representing the ongoing process of emanation."
  },
  "Aura": {
    "short_description": "The subtle, surrounding energy or atmosphere that emanates from a person, object, or place, often representing the outer reaches of emanation."
  },
  "Field": {
    "short_description": "A region or area where energy, influence, or information is present, often representing the scope or domain of emanation."
  },
  "Resonance": {
    "short_description": "The vibration or frequency that is emitted or transmitted by a source, often representing the harmonics or tone of emanation."
  },
  "Vibration": {
    "short_description": "The oscillation or frequency that is emitted or transmitted by a source, often representing the dynamic or kinetic aspect of emanation."
  },
  "Pulse": {
    "short_description": "The rhythmic or periodic emission or transmission of energy, influence, or information, often representing the heartbeat or cadence of emanation."
  },
  "Wave": {
    "short_description": "The undulating or oscillating motion that is emitted or transmitted by a source, often representing the flowing or dynamic aspect of emanation."
  },
  "Emission": {
    "short_description": "The process of releasing or sending out energy, influence, or information from a source, often representing the initial stages of emanation."
  },
  "Transmission": {
    "short_description": "The process of conveying or sending energy, influence, or information from one point to another, often representing the ongoing process of emanation."
  },
  "Immanence": {
    "short_description": "The quality of being present or inherent within something, often representing the inner or intrinsic aspect of emanation."
  },
  "Transcendence": {
    "short_description": "The quality of going beyond or exceeding something, often representing the outer or extrinsic aspect of emanation."
  },
  "Effulgence": {
    "short_description": "The radiant or shining quality that is emitted or transmitted by a source, often representing the brilliant or luminous aspect of emanation."
  },
  "Luminosity": {
    "short_description": "The quality of giving off light or radiating energy, often representing the shining or glowing aspect of emanation."
  },
  "Illumination": {
    "short_description": "The process of shedding light or understanding on something, often representing the enlightening or revealing aspect of emanation."
  },
  "Inspiration": {
    "short_description": "The process of breathing in or receiving energy, influence, or information from a source, often representing the receptive or inward aspect of emanation."
  },
  "Aspiration": {
    "short_description": "The process of breathing out or expressing energy, influence, or information from a source, often representing the expressive or outward aspect of emanation."
  },
    "Emanation": {
    "short_description": "The process of flowing forth or issuing from a source, often referring to the divine or spiritual radiance or influence that permeates reality."
  },
  "Source": {
    "short_description": "The origin or fountainhead from which emanation proceeds, often conceived as the divine, ultimate reality, or the absolute."
  },
  "Divine Light": {
    "short_description": "The spiritual or metaphysical illumination that emanates from the divine source, representing wisdom, understanding, and transcendent knowledge."
  },
  "Effulgence": {
    "short_description": "The radiant glow or brilliance that emanates from a source, symbolizing the divine presence and its spiritual influence."
  },
  "Cascade": {
    "short_description": "The successive flow or descent of emanations, forming a hierarchical structure of being, consciousness, or reality."
  },
  "Hierarchy": {
    "short_description": "The structured ordering of emanations, representing the gradual descent or unfolding of divine influence through various levels of existence."
  },
  "Hypostasis": {
    "short_description": "A distinct level or stage of emanation, representing a particular aspect or manifestation of the divine source, such as the One, Intellect, and Soul in Neoplatonism."
  },
  "Overflow": {
    "short_description": "The spontaneous and generous outpouring of divine goodness or influence, emanating from the source and giving rise to the multiplicity of beings."
  },
  "Procession": {
    "short_description": "The emergence or issuing forth of beings from their divine or metaphysical source, reflecting the dynamic nature of emanation."
  },
  "Return": {
    "short_description": "The spiritual or metaphysical journey back to the source, as beings or consciousness ascend through the hierarchical levels of emanation."
  },
  "Apophasis": {
    "short_description": "The approach to the divine through negation, recognizing that the ultimate source of emanation is ineffable and transcends human understanding."
  },
  "Kataphasis": {
    "short_description": "The approach to the divine through affirmation, attributing positive qualities to the source of emanation based on its manifestations."
  },
  "Theurgy": {
    "short_description": "The practice of divine work or ritual aimed at invoking and experiencing the divine emanations, ultimately seeking union with the source."
  },
  "Henosis": {
    "short_description": "The mystical union or oneness with the divine source, achieved through the spiritual ascent and integration of emanations."
  },
  "Nous": {
    "short_description": "The divine intellect or mind, representing the second hypostasis in Neoplatonism, which emanates from the One and gives rise to the Soul."
  },
  "Psyche": {
    "short_description": "The soul or anima mundi, representing the third hypostasis in Neoplatonism, which emanates from the Nous and permeates the material world."
  },
  "Demiurge": {
    "short_description": "The creative force or intermediary being responsible for the manifestation of the material world, acting as an agent of the divine emanations."
  },
  "Aeons": {
    "short_description": "Eternal intermediary beings or emanations that participate in the divine source and assist in the unfolding of reality, often found in Gnostic traditions."
  },
  "Logos": {
    "short_description": "The divine word, reason, or principle that emanates from the source, structuring and ordering reality, and revealing the divine wisdom."
  },
  "Sophia": {
    "short_description": "The divine wisdom or insight that emanates from the source, often personified as a feminine aspect of the divine, such as in Gnosticism and mystical traditions."
  },
  "Pleroma": {
    "short_description": "The fullness or totality of divine emanations, representing the complete expression of the divine source and its attributes."
  },
  "Kenoma": {
    "short_description": "The emptiness or deficiency that results from the absence or withdrawal of divine emanations, often associated with the material world or imperfection."
  },
  "Apocatastasis": {
    "short_description": "The restoration or reconstitution of all things in the divine source, as the emanations and beings return to their original unity and perfection."
  },
  "Anamnesis": {
    "short_description": "The spiritual reminiscence or recollection of the divine source, as beings remember their true nature and origin, facilitating their return."
  },
  "Epistrophi": {
    "short_description": "The spiritual turning or conversion towards the divine source, as beings realign themselves with the emanations and seek union with the ultimate reality."
  },
  "Metousia": {
    "short_description": "The participation or sharing in the divine emanations, as beings connect with the source and manifest its qualities and attributes."
  },
  "Homousia": {
    "short_description": "The essential oneness or unity of being, as the divine source and its emanations share the same nature and substance."
  },
  "Hierophany": {
    "short_description": "The manifestation or revelation of the divine through emanations, as the sacred presence is disclosed and experienced in the material world."
  },
  "Theophany": {
    "short_description": "The visible or tangible manifestation of the divine, as the emanations reveal the divine presence and power in the world of phenomena."
  },
  "Epiphany": {
    "short_description": "The sudden and profound realization or experience of the divine emanations, leading to spiritual insight, transformation, and illumination."
  }
}
