{
"Core Emotional Triggers": { "quote": "Fundamental responses hardwired into human psychology. The sudden appearance of enemies in horror games triggers our fight-or-flight response." },
"Visceral Design": { "quote": "Immediate sensory and emotional reactions to aesthetics. The satisfying visual and audio feedback when defeating enemies in Diablo III creates instant gratification." },
"Behavioral Design": { "quote": "How interaction patterns affect emotional states. The fluid, responsive controls in Super Mario Odyssey create joy through movement." },
"Reflective Design": { "quote": "Deeper meaning and emotional resonance that emerges over time. Journey's wordless narrative creates powerful emotional attachment through shared experience and symbolism." },
"Emotional Arcs": { "quote": "Deliberate pacing of emotional intensity throughout the experience. God of War (2018) alternates between intense combat, quiet character moments, and awe-inspiring vistas." },
"Empathy Engineering": { "quote": "Creating connection between players and virtual characters. The Last of Us builds attachment to Ellie through shared experiences and vulnerability." },
"Emotional Contrast": { "quote": "Juxtaposing different emotional states for greater impact. Undertale shifts from humor to poignancy to create more powerful emotional responses." },
"Emotional Pacing": { "quote": "Controlling the rhythm of emotional intensity. Ori and the Blind Forest alternates between challenging gameplay, narrative moments, and visual wonder." },
"Anticipated Emotion": { "quote": "Feelings players expect to experience. Horror games like Resident Evil build anticipation and dread before revealing threats." },
"Experienced Emotion": { "quote": "Actual feelings during gameplay. The unexpected emotional impact of companion loss in Shadow of the Colossus changes how players perceive their actions." },
"Emotional Congruence": { "quote": "Alignment between game elements to reinforce emotional states. Inside uses monochromatic visuals, minimal music, and oppressive environments to create consistent unease." },
"Emotional Investment": { "quote": "Building player attachment to outcomes and characters. Mass Effect's long-term consequences for decisions create deep investment in the narrative." },
"Emotional Affordances": { "quote": "Design elements that signal potential emotional responses. Animal Crossing's soft colors, rounded shapes, and gentle music signal safety and comfort." },
"Emotional Catalysts": { "quote": "Key moments designed to trigger specific emotions. The flower scene in Brothers: A Tale of Two Sons uses mechanics to evoke profound grief." },
"Emotional Memory": { "quote": "Creating memorable experiences through emotional intensity. That Dragon, Cancer uses personal narrative and abstraction to create lasting emotional impact." },
"Catharsis": { "quote": "Emotional release through resolution of tension. The ending of Final Fantasy VII: Crisis Core provides emotional release through inevitable tragedy." },
"Emotion Through Music": { "quote": "Using sound and score to enhance emotional states. Nier: Automata's dynamic music system adds vocals as emotional intensity increases." },
"Environmental Storytelling": { "quote": "Using spaces to evoke emotional responses. What Remains of Edith Finch communicates family tragedy through the details of their abandoned home." },
"Emotional Challenge": { "quote": "Difficulties that test emotional rather than strategic capacities. Hellblade: Senua's Sacrifice challenges players to persevere through psychological distress." },
"Emotional Reward": { "quote": "Satisfaction derived from emotional resolution. The sense of triumph in Dark Souls comes from overcoming seemingly impossible challenges." },
"Dissonance": { "quote": "Deliberately misaligning game elements to create unease. Silent Hill 2 uses discordant music and fog to create psychological tension." },
"Emotional Vectors": { "quote": "Directional flow of feelings throughout an experience. Red Dead Redemption 2's trajectory from outlaw fantasy to reflection on mortality creates emotional maturity." },
"Wonder": { "quote": "Designing for awe and amazement. The scale and beauty of discovering new worlds in Outer Wilds creates moments of pure wonder." },
"Emotional Safety": { "quote": "Creating spaces where players feel secure enough to experience emotions. Spiritfarer addresses death and grief within a nurturing, supportive game framework." },
"Emotional Vulnerability": { "quote": "Allowing players to experience challenging emotions in a controlled environment. Life is Strange explores difficult themes within the safety of a fictional setting." },
"Emotional Ambiguity": { "quote": "Deliberately unclear emotional framing that promotes reflection. Shadow of the Colossus leaves players to question the morality of their actions." },
"Emotional Authenticity": { "quote": "Creating genuine rather than manipulative emotional experiences. Kentucky Route Zero presents surreal situations with emotional truth rather than forced sentimentality." },
"Emotional Agency": { "quote": "Allowing players to influence emotional outcomes. The Walking Dead's difficult choices give players agency over the emotional direction of the story." },
"Emotional Progression": { "quote": "Development of feelings throughout the player journey. Florence uses simple mechanics that evolve to represent the stages of a relationship." },
"Emotional Accessibility": { "quote": "Designing emotional experiences that connect across diverse audiences. Pixar-like games such as Concrete Genie create emotional resonance across age groups." }
}
