{
  "Prime Mover": {
    "short_description": "Fundamental force or principle that initiates and sustains motion or change."
  },
  "Transformer": {
    "short_description": "System that converts one form of energy or state into another."
  },
  "Catalyst": {
    "short_description": "Agent that enables or accelerates transformation without being consumed."
  },
  "Perpetuator": {
    "short_description": "System that maintains continuous cycle or process of renewal."
  },
  "Amplifier": {
    "short_description": "Mechanism that increases magnitude or intensity of force or signal."
  },
  "Attractor": {
    "short_description": "Pattern or state that draws systems toward particular outcomes."
  },
  "Generator": {
    "short_description": "System that produces new instances or manifestations from principles."
  },
  "Accumulator": {
    "short_description": "Structure that gathers and concentrates energy or resources."
  },
  "Distributor": {
    "short_description": "System that allocates or disperses energy or resources across network."
  },
  "Resonator": {
    "short_description": "Structure that amplifies through synchronized vibration or rhythm."
  },
  "Oscillator": {
    "short_description": "System that produces regular fluctuation or alternation."
  },
  "Metabolizer": {
    "short_description": "System that processes and transforms materials for energy or growth."
  },
  "Integrator": {
    "short_description": "Mechanism that combines separate elements into functional whole."
  },
  "Differentiator": {
    "short_description": "System that creates distinction or separation from unity."
  },
  "Synchronizer": {
    "short_description": "Mechanism that coordinates multiple processes or cycles."
  },
  "Evolutionary Engine": {
    "short_description": "System driving development through selection and adaptation."
  },
  "Recursive Engine": {
    "short_description": "Process that builds complexity through self-reference and iteration."
  },
  "Dialectical Engine": {
    "short_description": "System that progresses through resolution of opposites."
  },
  "Emergence Engine": {
    "short_description": "Process generating higher-order patterns from simpler interactions."
  },
  "Entropic Engine": {
    "short_description": "System that harnesses tendency toward disorder or equilibrium."
  },
  "Syntropy Engine": {
    "short_description": "Process that builds order and complexity against entropy."
  },
  "Morphic Engine": {
    "short_description": "System that generates and maintains forms and patterns."
  },
  "Vortex Engine": {
    "short_description": "Self-sustaining spiral process that concentrates energy or matter."
  },
  "Field Engine": {
    "short_description": "System operating through distributed influence across space."
  },
  "Wave Engine": {
    "short_description": "Process that propagates change through medium via oscillation."
  },
  "Quantum Engine": {
    "short_description": "System operating through probabilistic or non-local principles."
  },
  "Social Engine": {
    "short_description": "Collective dynamics driving cultural or societal change."
  },
  "Cognitive Engine": {
    "short_description": "Mental processes generating understanding and meaning."
  },
  "Symbolic Engine": {
    "short_description": "System operating through representation and interpretation."
  },
  "Fractal Engine": {
    "short_description": "Process that generates self-similar patterns across scales."
  },
  "Network Engine": {
    "short_description": "System driving change through connected node interactions."
  },
  "Information Engine": {
    "short_description": "Process that harnesses or transforms patterns of difference."
  },
  "Algorithmic Engine": {
    "short_description": "System that generates output through defined sequential steps."
  },
  "Organic Engine": {
    "short_description": "Self-organizing system mimicking biological processes."
  },
  "Cyclical Engine": {
    "short_description": "System operating through repeated phases or stages."
  },
  "Harmonic Engine": {
    "short_description": "Process driven by principle of proportional relationships."
  },
  "Archetypal Engine": {
    "short_description": "System operating through fundamental patterns or templates."
  }
}
