{
"Illustrative Example": { "quote": "A concrete case that demonstrates a concept clearly. For instance, the apple falling on Newton's head illustrates gravity." },
"Counterexample": { "quote": "An example that disproves or contradicts a general statement. The platypus, a mammal that lays eggs, counters the claim that all mammals give live birth." },
"Paradigmatic Example": { "quote": "A model or prototype that exemplifies key features. The Model T Ford serves as a paradigmatic example of early mass production." },
"Edge Case": { "quote": "An example at the extreme boundaries of what's possible. Dividing by zero represents an edge case in mathematics that requires special handling." },
"Thought Experiment": { "quote": "A hypothetical scenario used to explore consequences. Schrödinger's cat illustrates quantum superposition through an imagined scenario." },
"Historical Example": { "quote": "A real event from the past that demonstrates a principle. The fall of the Roman Empire exemplifies how complex societies can collapse." },
"Contemporary Example": { "quote": "A current case that applies to present circumstances. Modern social media platforms exemplify network effects in digital economies." },
"Analogical Example": { "quote": "An example that draws parallels between different domains. The brain as a computer provides an analogy for understanding human cognition." },
"Personal Example": { "quote": "An instance from one's own experience. My grandmother's recipe for bread shows the importance of tacit knowledge in cooking." },
"Hypothetical Example": { "quote": "A constructed scenario used to test principles. If everyone always lied, trust would become impossible—showing why truth matters." },
"Canonical Example": { "quote": "A standard reference point in a field. Shakespeare's Hamlet serves as a canonical example in discussions of tragedy and indecision." },
"Motivating Example": { "quote": "An example that inspires interest in a topic. The 2008 financial crisis motivated renewed study of systemic economic risks." },
"Simplifying Example": { "quote": "A case that reduces complexity to highlight key features. The supply and demand of ice cream illustrates basic economic principles." },
"Extended Example": { "quote": "A detailed exploration of a single case. Analyzing the entire iPhone development process reveals principles of product design innovation." },
"Comparative Example": { "quote": "Examples that highlight differences or similarities. Comparing honeybees and ants reveals different social insect strategies." },
"Mundane Example": { "quote": "An everyday case that relates abstract concepts to common experience. Making coffee demonstrates principles of chemical extraction." },
"Abstract Example": { "quote": "A non-specific example that illustrates general patterns. A nameless company expanding too quickly illustrates the concept of overextension." },
"Memorable Example": { "quote": "A striking case that aids retention. The marshmallow test is a memorable illustration of delayed gratification studies." },
"Prototypical Example": { "quote": "The most representative case of a category. A robin is a prototypical example of a bird for many Western cultures." },
"Generative Example": { "quote": "An example that helps create new insights or applications. AlphaGo's unusual moves generated new strategies for human Go players." },
"Cautionary Example": { "quote": "A case that warns of potential problems. The Tacoma Narrows Bridge collapse serves as a cautionary example in engineering." },
"Cross-cultural Example": { "quote": "Cases that illustrate variations across different cultures. Gift-giving customs worldwide demonstrate cultural differences in reciprocity." },
"Pedagogical Example": { "quote": "Examples specifically designed for teaching. The Pythagorean theorem applied to a 3-4-5 triangle simplifies learning." },
"Contrasting Examples": { "quote": "Paired examples that highlight differences. Democracy versus authoritarianism illustrates contrasting governance approaches." },
"Sequential Examples": { "quote": "A series of related examples that build understanding. Learning programming through increasingly complex code examples." },
"Visual Example": { "quote": "Using images to illustrate concepts. A color wheel demonstrates complementary color relationships more effectively than words." },
"Narrative Example": { "quote": "A story that exemplifies a concept. The tortoise and the hare fable exemplifies that consistent effort often beats natural talent." },
"Data-driven Example": { "quote": "Using specific statistics or measurements to illustrate a point. Rising CO₂ levels in the atmosphere exemplify human impact on climate." },
"Recursive Example": { "quote": "An example that references itself. This entry is a recursive example of a recursive example." },
"Metaphorical Example": { "quote": "Using figurative language to illustrate. The journey as a metaphor for life exemplifies how metaphors structure understanding." }
}
