{
"Database Concepts": { "quote": "A database is a collection of related data, and a database system is a computerized system that enables users to create and maintain a database." },
"Data Models": { "quote": "A data model provides the means to describe data structure and constraints at a conceptual level, independent of implementation details." },
"Entity-Relationship Model": { "quote": "The ER model represents the real world as entities with attributes that are connected by relationships, providing a conceptual blueprint for database design." },
"Relational Model": { "quote": "The relational model organizes data into tables (relations) with rows (tuples) and columns (attributes), connected through foreign key relationships." },
"Relational Algebra": { "quote": "A procedural query language that operates on relations as its basic objects, with operators like select, project, join, and set operations." },
"SQL": { "quote": "The standard language for defining, manipulating, and querying relational databases through statements like SELECT, INSERT, UPDATE, and DELETE." },
"Database Design": { "quote": "The process of producing a detailed data model of a database that meets all user requirements while minimizing redundancy and maintaining integrity." },
"Normalization": { "quote": "A systematic approach to decomposing relations to eliminate anomalies and redundancies, typically through normal forms from 1NF through 5NF." },
"Functional Dependencies": { "quote": "Constraints between attributes that define when one attribute's value determines another's value, forming the basis for normalization." },
"Transaction Processing": { "quote": "Managing sequences of database operations that must be treated as a single unit of work to ensure data integrity." },
"ACID Properties": { "quote": "Transactions must be Atomic (all or nothing), Consistent (preserve database integrity), Isolated (independent of other transactions), and Durable (persistent)." },
"Concurrency Control": { "quote": "Techniques for managing simultaneous access to the database, including locking mechanisms, timestamps, and optimistic approaches." },
"Serializability": { "quote": "The property that ensures the effect of concurrent transactions is equivalent to some serial execution of those transactions." },
"Recovery Systems": { "quote": "Mechanisms to restore the database to a consistent state after failures, typically using logs, checkpoints, and recovery protocols." },
"Distributed Databases": { "quote": "Systems where data is stored across multiple physical locations, requiring specialized techniques for distribution, replication, and global transaction management." },
"Data Warehousing": { "quote": "Subject-oriented, integrated, time-variant, non-volatile collections of data designed to support management decision-making processes." },
"OLAP vs. OLTP": { "quote": "Online Analytical Processing (OLAP) supports complex analysis and decision-making, while Online Transaction Processing (OLTP) manages day-to-day operations." },
"Indexes": { "quote": "Data structures that improve the speed of data retrieval operations at the cost of additional storage and maintenance overhead." },
"B+ Trees": { "quote": "Self-balancing tree structures optimized for block-oriented storage systems, widely used for database indexes." },
"Query Processing": { "quote": "The transformation of high-level queries into execution plans that access the physical data efficiently." },
"Query Optimization": { "quote": "The process of selecting the most efficient query execution plan based on cost estimates and statistics." },
"Database Security": { "quote": "Mechanisms to protect data from unauthorized access, including authentication, authorization, and encryption." },
"Integrity Constraints": { "quote": "Rules that maintain data accuracy and consistency, including entity integrity, referential integrity, and domain constraints." },
"Triggers": { "quote": "Procedural code automatically executed in response to database events like inserts, updates, or deletes." },
"Stored Procedures": { "quote": "Precompiled collections of SQL statements stored in the database for reuse and improved performance." },
"Object-Oriented Databases": { "quote": "Systems that store data as objects, encapsulating both data and behavior, supporting inheritance and polymorphism." },
"NoSQL Databases": { "quote": "Non-relational database systems designed for distributed data stores with large-scale data storage needs and flexible schema requirements." },
"XML and Databases": { "quote": "Techniques for storing, querying, and managing XML data in databases, including native XML databases and XML support in relational systems." },
"Big Data": { "quote": "Extremely large data sets that may be analyzed computationally to reveal patterns, trends, and associations, requiring specialized storage and processing techniques." },
"Database Tuning": { "quote": "The process of adjusting database parameters, structures, and queries to optimize performance for specific workloads." }
}
