{
"Action": { "quote": "Real-time gameplay requiring quick reflexes and hand-eye coordination. (Super Mario Bros., Doom)" },
"Adventure": { "quote": "Exploration, puzzle-solving, and narrative-driven experiences focused on story. (The Legend of Zelda, Myst)" },
"Action-Adventure": { "quote": "Combining action gameplay with exploration and puzzle elements. (Uncharted, Tomb Raider)" },
"Role-Playing Games": { "quote": "Character progression, stat-building, and narrative choices shape the journey. (Final Fantasy, The Elder Scrolls)" },
"Strategy": { "quote": "Emphasizes tactical decision-making and resource management. (StarCraft, Civilization)" },
"Simulation": { "quote": "Recreates real-world activities or systems with accuracy. (The Sims, Microsoft Flight Simulator)" },
"Sports": { "quote": "Virtual representations of athletic competitions. (FIFA, NBA 2K)" },
"Racing": { "quote": "Competitive driving experiences focusing on speed and vehicle mastery. (Gran Turismo, Mario Kart)" },
"Fighting": { "quote": "One-on-one combat focused on timing, combos, and special moves. (Street Fighter, Mortal Kombat)" },
"First-Person Shooter": { "quote": "Action from the character's perspective, typically focused on weapon-based gameplay. (Call of Duty, Half-Life)" },
"Third-Person Shooter": { "quote": "Combat gameplay viewed from behind the player character. (Gears of War, Max Payne)" },
"Platform": { "quote": "Navigating environments by jumping between suspended platforms. (Super Mario Bros., Celeste)" },
"Puzzle": { "quote": "Challenges that require logical thinking and pattern recognition. (Tetris, Portal)" },
"Survival": { "quote": "Managing limited resources while facing environmental threats. (Don't Starve, Subnautica)" },
"Horror": { "quote": "Creating fear through atmosphere, limited resources, and threatening enemies. (Resident Evil, Silent Hill)" },
"Stealth": { "quote": "Emphasizing avoiding detection rather than direct confrontation. (Metal Gear Solid, Hitman)" },
"Open World": { "quote": "Non-linear environments that allow free exploration. (Grand Theft Auto, The Witcher 3)" },
"Massively Multiplayer": { "quote": "Persistent worlds where numerous players interact simultaneously. (World of Warcraft, EVE Online)" },
"Battle Royale": { "quote": "Last-player-standing elimination across a shrinking play area. (Fortnite, PUBG)" },
"MOBA": { "quote": "Team-based competition controlling unique characters with specialized abilities. (League of Legends, Dota 2)" },
"Rhythm": { "quote": "Gameplay synchronized to music requiring timing and pattern recognition. (Guitar Hero, Beat Saber)" },
"Sandbox": { "quote": "Creative freedom with minimal restrictions or objectives. (Minecraft, Garry's Mod)" },
"Visual Novel": { "quote": "Text-based narratives with branching storylines and static visuals. (Ace Attorney, Doki Doki Literature Club)" },
"Roguelike": { "quote": "Procedurally generated levels with permanent death mechanics. (The Binding of Isaac, Hades)" },
"Metroidvania": { "quote": "Exploration-focused platformers with ability-gated progression. (Hollow Knight, Castlevania: Symphony of the Night)" },
"Card Game": { "quote": "Strategy based on collecting and playing cards with various effects. (Hearthstone, Magic: The Gathering Arena)" },
"Tower Defense": { "quote": "Strategic placement of defensive structures against waves of enemies. (Plants vs. Zombies, Bloons TD)" },
"Idle-Incremental": { "quote": "Progress occurs with minimal player input over extended periods. (Cookie Clicker, Clicker Heroes)" },
"Educational": { "quote": "Designed primarily to teach specific skills or knowledge. (Math Blaster, Oregon Trail)" },
"Casual": { "quote": "Simple mechanics designed for quick, accessible play sessions. (Candy Crush, Angry Birds)" }
}
