{
"Input Response": { "quote": "The immediacy and precision with which a game responds to player commands. Super Meat Boy's instant acceleration and tight controls enable pixel-perfect platforming." },
"Weight and Momentum": { "quote": "How virtual objects convey mass through movement characteristics. Shadow of the Colossus communicates scale through deliberate, weighty character animations." },
"Physical Feedback": { "quote": "Tactile sensations that reinforce virtual actions. God of War's axe recall provides satisfying controller vibration that enhances the feeling of magical control." },
"Animation Principles": { "quote": "Visual techniques that enhance the sense of physical presence. Overwatch uses squash and stretch, anticipation, and follow-through to create expressive character movements." },
"Juiciness": { "quote": "Excessive positive feedback to mundane interactions. Peggle's extreme celebration with zoom effects, rainbows, and Ode to Joy when completing a level." },
"Camera Design": { "quote": "How perspective follows and frames the action. Dead Cells uses slight camera lead and subtle screen shake to enhance the sense of movement and impact." },
"Audio Response": { "quote": "Sound design that reinforces player actions. The distinctive 'pop' when collecting coins in Mario provides instantaneous auditory confirmation." },
"Environmental Response": { "quote": "How the game world reacts to player presence. Half-Life 2's physics objects respond realistically to the gravity gun, creating a convincing interactive world." },
"Combat Feel": { "quote": "The tactile satisfaction of conflict mechanics. Doom (2016) creates satisfying combat through weapon kickback, enemy reactions, and glory kill animations." },
"Movement Systems": { "quote": "How characters navigate through space. Titanfall 2's wall-running, sliding, and double-jumping create a fluid movement system that feels exhilarating." },
"Ability Execution": { "quote": "The sensory feedback when performing special actions. Overwatch's ultimate abilities deliver powerful audiovisual feedback proportional to their game impact." },
"Time Manipulation": { "quote": "Adjusting time flow to enhance the feel of actions. Hitstop in fighting games momentarily freezes the action on impact to emphasize powerful hits." },
"Screenshake": { "quote": "Camera vibration that emphasizes impact. Nuclear Throne uses variable screenshake to communicate the power of different weapons and explosions." },
"Visual Effects": { "quote": "Particle systems, lighting, and other effects that enhance actions. Enter the Gungeon's bullet trails, muzzle flashes, and impact effects make combat visually satisfying." },
"Animation Canceling": { "quote": "Allowing players to interrupt animations for responsive control. Fighting games like Street Fighter allow canceling recovery frames to maintain flow and responsiveness." },
"Contextual Actions": { "quote": "Input simplification based on environmental context. Assassin's Creed's parkour system automatically performs appropriate movements based on the surrounding architecture." },
"Input Buffering": { "quote": "Storing inputs to execute after the current action. Fighting games use input buffers to maintain responsiveness while preserving timing requirements." },
"Analog Control": { "quote": "Variable input producing proportional in-game actions. Mario's jump height varies based on how long the button is pressed, creating nuanced control." },
"Digital Physicality": { "quote": "Creating tangible sensations through abstract representation. Tetris pieces feel like they have weight despite being simple geometric shapes." },
"Cinematic Effects": { "quote": "Film-inspired techniques that enhance impact. Max Payne's bullet time creates dramatic moments while providing tactical advantages." },
"Locomotion Cycles": { "quote": "The rhythmic patterns of movement. Journey's fluid sand-surfing creates a sense of effortless flow and momentum." },
"Interface Kinesthetics": { "quote": "How menu navigation and UI elements respond to input. Plants vs Zombies' cards have subtle physics when dragged, making menu interaction tactile." },
"Controller Mappings": { "quote": "How physical inputs relate to in-game actions. Xbox controllers' trigger buttons naturally map to shooting mechanics in racing and shooter games." },
"Consistency vs. Context": { "quote": "Balancing predictable response with situational appropriateness. Uncharted maintains consistent core controls while adapting animations to the environment." },
"Environmental Traversal": { "quote": "How characters interact with and move through terrain. Breath of the Wild's climbing system adapts to different surfaces and weather conditions." },
"Material Properties": { "quote": "How different surfaces and objects behave when interacted with. Half-Life: Alyx communicates material differences through sound, physics, and haptic feedback in VR." },
"Virtual Proprioception": { "quote": "The sense of where your character's body exists in space. Mirror's Edge's visible limbs and body-aware camera help players feel embodied in first-person." },
"Secondary Motion": { "quote": "Reactive movements that result from primary actions. Clothing, hair, and equipment physics in Ghost of Tsushima respond to character movement and wind." },
"Mechanical Metaphors": { "quote": "Systems that leverage physical understanding. Portal's momentum conservation creates intuitive yet novel gameplay possibilities." },
"Sensory Harmony": { "quote": "The synchronized integration of visual, audio, and haptic feedback. Rez synchronizes music, visuals, and controller vibration to create synesthetic gameplay." }
}
