{
"MDA Framework": { "quote": "Mechanics, Dynamics, and Aesthetics connect what designers create to what players experience. The rules of poker (mechanics) create betting patterns (dynamics) that generate tension and excitement (aesthetics)." },
"Flow Theory": { "quote": "The mental state where challenge perfectly matches player skill. Tetris maintains flow by gradually increasing speed as player skill improves." },
"Meaningful Choices": { "quote": "Decisions with clear tradeoffs and consequences. In XCOM, choosing which missions to undertake means sacrificing others, creating strategic tension." },
"Feedback Loops": { "quote": "Systems where outputs affect future inputs. Mario Kart's rubber-banding gives items that help trailing players catch up (negative feedback loop)." },
"Cognitive Load": { "quote": "Mental effort required to understand and play. Chess of the Dead simplifies zombie chess by using fewer piece types to reduce complexity." },
"Depth vs. Complexity": { "quote": "Strategic richness versus rules overhead. Go has simple rules (low complexity) but deep strategy (high depth)." },
"Intrinsic vs. Extrinsic Motivation": { "quote": "Playing for enjoyment versus external rewards. Minecraft focuses on intrinsic satisfaction of creativity while idle games emphasize extrinsic progression." },
"Core Engagement Cycles": { "quote": "The fundamental activities that maintain player interest. In Diablo: kill monsters, get loot, become stronger, kill stronger monsters." },
"Conveyance": { "quote": "How games teach players without explicit instruction. Half-Life 2 uses visual cues and level design to guide players without UI markers." },
"Triangularity": { "quote": "Risk/reward options of varying potential. Shooters let players choose between safe, low-damage body shots or risky, high-reward headshots." },
"Juiciness": { "quote": "Excessive positive feedback that makes interaction satisfying. Plants vs. Zombies uses animations, sounds, and visual effects to make simple actions feel rewarding." },
"Affordances": { "quote": "Visual cues that suggest interaction possibilities. Red barrels in games implicitly communicate explosiveness to players." },
"Elegance": { "quote": "Maximum depth from minimum complexity. Chess has only six piece types but creates endless strategic possibilities." },
"Balancing Methods": { "quote": "Techniques for maintaining fairness and challenge. Rock-Paper-Scissors achieves perfect balance through a circular power relationship." },
"Interest Curves": { "quote": "The deliberate pacing of intensity throughout an experience. God of War (2018) alternates between combat, exploration, and quiet character moments." },
"Player Agency": { "quote": "The capacity for meaningful player control and expression. Immersive sims like Deus Ex provide multiple valid approaches to objectives." },
"Possibility Space": { "quote": "The range of actions and strategies available to players. Breath of the Wild's chemistry system creates emergent gameplay through elemental interactions." },
"Decision Clarity": { "quote": "How well players understand their choices and outcomes. Into the Breach shows exactly what will happen on the next turn before players commit actions." },
"Intentionality": { "quote": "The match between player decisions and game outcomes. Precise platformers like Celeste ensure deaths feel fair by responding exactly to player inputs." },
"Magic Circle": { "quote": "The psychological boundary separating play from ordinary life. Animal Crossing creates a separate world with its own rules and consequences." },
"Information Horizon": { "quote": "How far ahead players can predict game states. Chess shows the current board state but requires players to mentally simulate future moves." },
"Layered Complexity": { "quote": "Gradually introducing depth over time. Portal teaches individual mechanics before combining them in increasingly complex puzzles." },
"The Hook": { "quote": "The initial experience that captures player interest. DOOM (2016) begins with the player immediately breaking free and fighting demons." },
"Constraints as Liberation": { "quote": "Limitations that focus creativity and decision-making. Spelunky's limited health makes each encounter meaningful and tense." },
"Aspiration Play": { "quote": "Design that showcases future possibilities. Hollow Knight's locked areas and visible-but-unreachable paths create motivation to continue." },
"Pacing Tools": { "quote": "Mechanics that control the rhythm of play. The bonfire system in Dark Souls creates natural break points in the experience." },
"Accessible Depth": { "quote": "Design that's easy to learn but difficult to master. Rocket League's basic concept (car soccer) hides remarkable mechanical and strategic depth." },
"Indirect Control": { "quote": "Guiding player behavior without forcing it. Left 4 Dead's Director system spawns special zombies behind players to keep them moving forward." },
"Skill Atoms": { "quote": "The fundamental learning units of gameplay. Fighting games break down complex combos into chainable individual moves that players master sequentially." },
"Orthogonal Unit Differentiation": { "quote": "Units with distinct abilities rather than statistical variations. Chess pieces move in fundamentally different ways rather than just having different power levels." }
}
