{
"Emergent Gameplay": { "quote": "Complex player behaviors that arise from simple rule systems. The physics engine in Breath of the Wild enables creative solutions not explicitly designed by developers." },
"Dominant Strategy": { "quote": "Optimal approaches that emerge and potentially diminish strategic diversity. Rushing in RTS games often becomes a dominant strategy without proper counterbalances." },
"Meta Evolution": { "quote": "How player strategies adapt and change over time. League of Legends' meta constantly shifts as players discover new champion combinations and counters." },
"Skill Ceiling": { "quote": "The maximum potential effectiveness achievable through player skill. Fighting games like Street Fighter have extremely high skill ceilings with frame-perfect techniques." },
"Skill Floor": { "quote": "The minimum effectiveness a new player can achieve. Overwatch heroes like Mercy have lower skill floors to accommodate beginners." },
"Power Creep": { "quote": "Gradual increase in power of new content compared to existing content. Card games often struggle with new expansions making previous cards obsolete." },
"Risk/Reward Ratio": { "quote": "How potential gains balance against potential losses. High-risk plays in Poker create tension through uncertain but potentially large payoffs." },
"Positive Feedback Loops": { "quote": "Systems where success leads to further advantage. In MOBAs, early kills provide gold advantages that make subsequent kills easier." },
"Negative Feedback Loops": { "quote": "Systems that help disadvantaged players catch up. Mario Kart provides better items to players in lower positions." },
"Counterplay": { "quote": "Strategic options to respond to opponent actions. Rock-Paper-Scissors design in fighting games ensures no strategy is unbeatable." },
"Nash Equilibrium": { "quote": "Strategic balance points where no player benefits from changing strategy alone. Team composition in competitive games often settles into stable patterns." },
"Social Dynamics": { "quote": "Patterns of interaction between players. Among Us creates emergent social deduction through limited information and communication." },
"Economy Inflation": { "quote": "Gradual devaluation of in-game currency over time. MMO economies often see gold become less valuable as wealth accumulates in the player base." },
"Grinding": { "quote": "Repetitive actions performed to gain incremental advantages. RPGs often feature experience point systems that encourage repeated activities." },
"Diminishing Returns": { "quote": "Decreasing benefits from continued investment. Character attributes in Dark Souls provide less benefit after reaching certain thresholds." },
"Decision Fatigue": { "quote": "Degradation of decision quality due to mental exhaustion. Auto-chess games like Teamfight Tactics balance strategic depth against cognitive burden." },
"Analysis Paralysis": { "quote": "Overthinking that prevents timely decisions. Chess can create situations where too many possible moves inhibit decision-making." },
"Skill Expression": { "quote": "How mechanics allow players to demonstrate mastery. Rocket League's flying mechanics create a visible distinction between skill levels." },
"Metagame Cycles": { "quote": "Recurring patterns of strategic evolution. Competitive games often cycle through aggro, control, and combo-oriented strategies." },
"Snowballing": { "quote": "Early advantages that compound into larger leads. MOBA matches can become one-sided when one team secures early objectives." },
"Comeback Mechanisms": { "quote": "Systems that provide opportunities to reverse disadvantages. Fighting games often include super meters that fill when taking damage." },
"Time Investment": { "quote": "How player commitment correlates with progression. MMORPGs traditionally reward hours played with character advancement." },
"Mastery Curve": { "quote": "The relationship between experience and effectiveness. Games like Dota 2 feature steep but rewarding mastery curves." },
"Strategic Depth": { "quote": "The breadth of viable approaches to success. Chess provides immense strategic depth through simple movement rules." },
"Tactical Adaptation": { "quote": "Adjusting strategies in response to changing conditions. Battle royale games require constant adaptation to shrinking play areas and equipment availability." },
"Player Interaction Models": { "quote": "How players affect each other's experiences. Journey creates positive interdependence through cooperative mechanics without communication." },
"Psychological Momentum": { "quote": "The perception that success breeds further success. Win streaks in competitive games can create confidence that affects performance." },
"Attention Economy": { "quote": "Competition for limited player focus. Modern game interfaces carefully prioritize information to avoid overwhelming players." },
"Progression Pacing": { "quote": "The rhythm of advancement and reward distribution. RPGs balance steady improvements with significant milestones." },
"Skill Transferability": { "quote": "How abilities in one context apply to others. First-person shooter skills often transfer between games in the genre." }
}
