{
"Constitutive Rules": { "quote": "The fundamental abstract logic of a game. Chess rules define legal moves for each piece without explaining implementation." },
"Operational Rules": { "quote": "How rules are executed during play. In Monopoly, landing on another player's property requires payment of the specified rent." },
"Implicit Rules": { "quote": "Unwritten expectations about player behavior. Not staring at another player's cards in poker is an implicit rule." },
"Victory Conditions": { "quote": "How winners are determined. In chess, checkmate of the opponent's king defines victory." },
"Failure States": { "quote": "Conditions that end gameplay unsuccessfully. In platformers like Super Mario Bros., running out of lives results in game over." },
"Turn Structure": { "quote": "The sequence and timing of player actions. In Civilization, players complete all their actions before the next player's turn begins." },
"Action Economy": { "quote": "The allocation and management of available player actions. In board games like Pandemic, players typically have a limited number of actions per turn." },
"Resource Management": { "quote": "Rules governing acquisition and expenditure of game assets. In Settlers of Catan, players collect and trade resources to build settlements." },
"Spatial Rules": { "quote": "How game elements relate to physical or virtual space. In chess, bishops can only move diagonally across the board." },
"Temporal Rules": { "quote": "How time affects gameplay. In real-time strategy games like StarCraft, units take time to build and move." },
"Randomness": { "quote": "How chance and probability are incorporated. In poker, card drawing introduces unpredictability governed by probability." },
"Hidden Information": { "quote": "Rules about what players know and don't know. In Stratego, opponents cannot see the rank of your pieces." },
"Perfect Information": { "quote": "Games where all information is visible to all players. In chess, both players can see all pieces and possible moves." },
"Interaction Rules": { "quote": "How game elements affect each other. In Magic: The Gathering, specific card interactions are governed by comprehensive rules." },
"Progression Rules": { "quote": "How players advance through game content. In role-playing games, experience points lead to character level advancement." },
"Balancing Mechanisms": { "quote": "Systems that maintain competitive equilibrium. In Mario Kart, rubber-banding gives trailing players better power-ups." },
"Constraints": { "quote": "Limitations that create strategic depth. In Scrabble, the limited tile set and board space create meaningful decisions." },
"Emergent Rules": { "quote": "Complex behaviors arising from simple rule interactions. Conway's Game of Life generates complex patterns from four simple rules." },
"Meta Rules": { "quote": "Rules about changing or interpreting other rules. In Nomic, changing the rules is part of gameplay itself." },
"Rule Hierarchies": { "quote": "Which rules take precedence when conflicts occur. In Magic: The Gathering, card text overrides general game rules." },
"Forbidden Actions": { "quote": "What players cannot do within the game. In chess, moving into check is forbidden." },
"Mandatory Actions": { "quote": "What players must do when certain conditions arise. In checkers, players must capture when possible." },
"Rule Exceptions": { "quote": "Special cases that override general rules. In Monopoly, the 'Get Out of Jail Free' card bypasses normal jail rules." },
"Symmetrical Rules": { "quote": "When all players operate under identical rules. In chess, both players have identical starting positions and piece capabilities." },
"Asymmetrical Rules": { "quote": "When players have different abilities or goals. In Star Wars: Rebellion, Imperial and Rebel players have different victory conditions." },
"Feedback Loops": { "quote": "How success or failure affects future gameplay. In Monopoly, acquiring properties creates positive feedback through increased income." },
"Zero-Sum Rules": { "quote": "When one player's gain equals another's loss. In chess, capturing an opponent's piece directly weakens their position." },
"Non-Zero-Sum Rules": { "quote": "When mutual benefit is possible. In cooperative games like Pandemic, all players win or lose together." },
"Nested Rules": { "quote": "Rules within rules that create gameplay depth. In role-playing games, combat often has its own distinct ruleset." },
"House Rules": { "quote": "Player-created modifications to official rules. Free parking money in Monopoly is a common house rule not in the official rulebook." }
}
