{
"Heroism": { "quote": "The journey of an ordinary character becoming extraordinary. The Legend of Zelda series follows Link's transformation from simple villager to world savior." },
"Survival": { "quote": "The struggle against overwhelming odds and hostile environments. The Last of Us depicts humanity's desperate fight for existence in a post-pandemic world." },
"Exploration": { "quote": "Discovery of unknown territories and hidden secrets. Outer Wilds rewards curiosity with cosmic revelations across its miniature solar system." },
"War": { "quote": "The conflict between opposing forces on a large scale. Call of Duty examines the personal stories within larger historical conflicts." },
"Post-Apocalyptic": { "quote": "Life after societal collapse or catastrophic events. Fallout's retro-futuristic wasteland explores how civilization might rebuild after nuclear war." },
"Dystopia": { "quote": "Societies with oppressive or dehumanizing qualities. BioShock's Rapture shows the failure of an objectivist utopia corrupted by unchecked ambition." },
"Utopia": { "quote": "Idealized societies with seemingly perfect qualities. Mirror's Edge presents a pristine city whose perfection masks underlying totalitarianism." },
"Fantasy": { "quote": "Magical worlds beyond our reality. The Elder Scrolls creates elaborate mythologies and cultures in its fantasy universe." },
"Science Fiction": { "quote": "Speculative futures and technological advancement. Mass Effect explores how humanity might find its place in a diverse galactic community." },
"Horror": { "quote": "Fear and the unknown as central elements. Silent Hill uses psychological horror to manifest characters' inner demons in physical form." },
"Mystery": { "quote": "Investigation and uncovering hidden truths. Return of the Obra Dinn challenges players to piece together the fate of a doomed ship through logical deduction." },
"Betrayal": { "quote": "Trust broken and loyalties tested. Among Us creates social dynamics around deception and suspicion." },
"Redemption": { "quote": "The journey from disgrace to atonement. Red Dead Redemption 2 follows Arthur Morgan's transformation from outlaw to someone seeking meaning beyond himself." },
"Loss": { "quote": "Dealing with absence and grief. What Remains of Edith Finch explores a family's history of tragedy through magical realism." },
"Identity": { "quote": "Questions of self and the nature of being. Nier: Automata examines what it means to be human through the perspective of artificial beings." },
"Morality": { "quote": "Ethical choices and their consequences. The Walking Dead forces difficult decisions about survival versus humanity in a hostile world." },
"Power": { "quote": "The acquisition and consequences of strength and influence. God of War explores how the pursuit of power can bring both victory and tragedy." },
"Corruption": { "quote": "The degradation of individuals or systems over time. Spec Ops: The Line shows how good intentions can lead to moral compromise in extreme situations." },
"Revolution": { "quote": "Uprising against established powers. Half-Life 2's Combine-occupied Earth depicts resistance against an alien occupation." },
"Justice": { "quote": "The pursuit of fairness and retribution. Phoenix Wright: Ace Attorney tasks players with defending the innocent against false accusations." },
"Nature": { "quote": "Humanity's relationship with the natural world. Shadow of the Colossus questions the environmental cost of the protagonist's quest." },
"Isolation": { "quote": "The experience of being alone or cut off. Firewatch examines the psychological effects of solitude in the Wyoming wilderness." },
"Technology": { "quote": "The impact of advancement on society and individuals. Deus Ex explores human augmentation and the divide between enhanced and unenhanced people." },
"Time": { "quote": "The effects of temporal progression or manipulation. The Legend of Zelda: Ocarina of Time uses time travel to show how choices affect the future." },
"Memory": { "quote": "The reliability and importance of recollection. Disco Elysium's amnesiac protagonist reconstructs his identity through recovered memories." },
"Faith": { "quote": "Belief systems and their influence on individuals and societies. Cultist Simulator examines the allure and danger of esoteric belief systems." },
"Family": { "quote": "Bonds of kinship and their complexities. Brothers: A Tale of Two Sons uses cooperative mechanics to strengthen the emotional connection between siblings." },
"Sacrifice": { "quote": "What we give up for greater purposes. Shadow of the Colossus questions whether the protagonist's cause justifies his destructive actions." },
"Freedom": { "quote": "The pursuit of autonomy and self-determination. The Stanley Parable meta-textually explores player choice and narrative constraints." },
"Legacy": { "quote": "The impact of past actions on the future. Horizon Zero Dawn reveals how current civilization lives among the technological remnants of its ancestors." }
}
