{
"Nash Equilibrium": { "quote": "A state where no player can benefit by changing their strategy while other players keep theirs unchanged. In the Prisoner's Dilemma, mutual defection is the Nash equilibrium despite not being the optimal collective outcome." },
"Dominant Strategy": { "quote": "A strategy that provides better outcomes regardless of what other players do. In the Prisoner's Dilemma, defection is the dominant strategy for both players." },
"Prisoner's Dilemma": { "quote": "A game showing why two rational individuals might not cooperate even when it's in their best interest. Two suspects each face the choice to cooperate with each other or defect, leading to the famous payoff matrix." },
"Zero-Sum Games": { "quote": "Games where one player's gain is exactly balanced by another's loss. Chess and poker are zero-sum games as the total resources remain constant." },
"Non-Zero-Sum Games": { "quote": "Games where mutual gains or losses are possible. Trade and cooperation often create positive-sum outcomes where all participants benefit." },
"Pareto Efficiency": { "quote": "A state where no player can be made better off without making another worse off. Free market exchanges theoretically move toward Pareto efficient outcomes." },
"Minimax Strategy": { "quote": "Minimizing the maximum possible loss. In chess, players often choose moves that minimize their worst-case scenario rather than maximizing potential gains." },
"Backward Induction": { "quote": "Reasoning backward from the end of a game to determine optimal strategy. In finite games like tic-tac-toe, perfect play can be determined by working backward from end positions." },
"Extensive Form Games": { "quote": "Sequential games represented as decision trees. Chess can be represented in extensive form, though the tree becomes astronomically large." },
"Normal Form Games": { "quote": "Simultaneous games represented as matrices. Rock-Paper-Scissors is typically represented in normal form with a 3×3 payoff matrix." },
"Mixed Strategy": { "quote": "A probability distribution over possible actions. In Rock-Paper-Scissors, the optimal mixed strategy is to randomly choose each option with 1/3 probability." },
"Pure Strategy": { "quote": "A strategy that deterministically selects one action. In Prisoner's Dilemma, always defecting is a pure strategy." },
"Subgame Perfect Equilibrium": { "quote": "A refinement of Nash equilibrium in extensive form games. In the ultimatum game, accepting any positive offer is subgame perfect." },
"Bayesian Games": { "quote": "Games with incomplete information where players have beliefs about others' types. Auctions are Bayesian games where bidders have private valuations for items." },
"Evolutionary Game Theory": { "quote": "Applying game theory to evolving populations. The Hawk-Dove game models how aggressive and peaceful strategies might coexist in nature." },
"Stag Hunt": { "quote": "A game modeling cooperation for maximum gain versus individual safety. Hunters choosing between cooperatively hunting a stag or individually catching rabbits." },
"Chicken Game": { "quote": "A model of conflict where the worst outcome is mutual non-cooperation. Two drivers heading toward each other, where swerving means losing face but collision is catastrophic." },
"Tragedy of the Commons": { "quote": "When individual rational actions lead to collective resource depletion. Overfishing occurs when each fisher maximizes their individual catch despite depleting the shared resource." },
"Repeated Games": { "quote": "Games played multiple times, allowing for reputation and retaliation. The iterated Prisoner's Dilemma can sustain cooperation through strategies like Tit-for-Tat." },
"Folk Theorem": { "quote": "In repeated games, a wide range of outcomes can be sustained as equilibria. Cooperation in repeated Prisoner's Dilemma can be maintained through the threat of future punishment." },
"Mechanism Design": { "quote": "Designing games to achieve specific outcomes. Vickrey auctions are designed to incentivize truthful bidding." },
"Shapley Value": { "quote": "A fair distribution of gains from cooperation based on marginal contributions. In coalition formation, it allocates payoffs according to each player's average marginal contribution." },
"Price of Anarchy": { "quote": "The efficiency loss of a system due to selfish behavior of its agents. Traffic congestion often results from individuals choosing fastest routes rather than system-optimal paths." },
"Correlated Equilibrium": { "quote": "A solution concept where a mediator gives private recommendations. Traffic lights serve as correlation devices that coordinate driver actions at intersections." },
"Bargaining Theory": { "quote": "Models of how players divide a surplus through negotiation. The Nash bargaining solution maximizes the product of players' utility gains from cooperation." },
"Signaling Games": { "quote": "Games where one player has private information and can send signals. Job applicants signal their quality through education in the labor market." },
"Coordination Games": { "quote": "Games where players benefit from choosing the same strategy. Driving on the same side of the road is a coordination game with multiple equilibria." },
"Incomplete Information": { "quote": "Games where players lack full knowledge about others' payoffs or types. Auctions typically involve incomplete information about others' valuations." },
"Coalition Formation": { "quote": "How groups form and distribute gains from cooperation. Political parties form coalitions to achieve majority government in multi-party systems." },
"Evolutionary Stable Strategy": { "quote": "A strategy that cannot be invaded by alternative strategies. In biology, certain behavioral traits persist because they are evolutionarily stable against mutations." }
}
