{
"Core Mechanics": { "quote": "The fundamental interactions that form the backbone of gameplay. Super Mario's jumping mechanic has precise physics tuning with acceleration, momentum, and variable height." },
"Resource Systems": { "quote": "The management of limited game commodities. Oxygen, food, and materials in Subnautica create interlocking survival challenges." },
"Progression Systems": { "quote": "How players advance and gain power. Skyrim's 'learn by doing' approach ties skill improvement directly to repeated use." },
"Combat Systems": { "quote": "The mechanics of conflict resolution. The Souls series emphasizes stamina management, attack commitment, and pattern recognition." },
"Economy Systems": { "quote": "The flow of resources throughout the game. EVE Online's player-driven market responds to supply and demand with regional pricing." },
"Crafting Systems": { "quote": "Creation of items from collected resources. Don't Starve combines ingredients in recipes that reflect logical real-world relationships." },
"Inventory Systems": { "quote": "Storage and management of player possessions. Resident Evil's limited inventory space creates strategic tension around what to keep." },
"Movement Systems": { "quote": "How players navigate the game world. Titanfall 2 combines wall-running, sliding, and grappling hooks for fluid traversal." },
"Skill Trees": { "quote": "Branching paths of player abilities. Path of Exile's massive passive skill tree allows for deeply specialized character builds." },
"Character Progression": { "quote": "How player avatars develop over time. Disco Elysium ties skill improvements to personality traits and narrative choices." },
"Procedural Generation": { "quote": "Algorithmically created content. Spelunky generates levels with consistent rules but unpredictable configurations." },
"NPC Systems": { "quote": "Behavior of non-player characters. Red Dead Redemption 2's NPCs have daily routines and remember player interactions." },
"Quest Systems": { "quote": "Structure of objectives and missions. The Witcher 3's branching quests have consequences that affect the game world." },
"Dialogue Systems": { "quote": "Conversation mechanics and choices. Mass Effect's dialogue wheel communicates tone while influencing character relationships." },
"AI Systems": { "quote": "Computer-controlled entity behavior. F.E.A.R.'s enemies communicate, use cover, and coordinate flanking maneuvers." },
"Physics Systems": { "quote": "Simulation of physical interactions. Half-Life 2's gravity gun creates emergent gameplay through object manipulation." },
"Damage Systems": { "quote": "How harm is calculated and applied. Monster Hunter's damage model includes hit zones, weapon sharpness, and elemental weaknesses." },
"Health Systems": { "quote": "Management of player vitality. Halo's regenerating shields paired with limited health creates a push-pull combat rhythm." },
"Magic Systems": { "quote": "Rules governing supernatural abilities. Magicka's element-combining spellcasting allows for experimentation and discovery." },
"Faction Systems": { "quote": "Relationship mechanics between groups. Mount & Blade tracks reputation with different factions that affects trade and diplomacy." },
"Weather Systems": { "quote": "Environmental conditions that impact gameplay. Zelda: Breath of the Wild's thunderstorms create danger for metal-equipped players." },
"Day/Night Cycles": { "quote": "Time progression with gameplay effects. Dying Light transforms zombies from shambling threats to deadly hunters at night." },
"Stealth Systems": { "quote": "Mechanics for avoiding detection. Dishonored models sound propagation, line of sight, and light levels for realistic concealment." },
"Morality Systems": { "quote": "Tracking player ethical choices. Fallout: New Vegas's faction reputation replaces binary good/evil with complex relationships." },
"Permadeath Systems": { "quote": "Consequences of permanent character loss. XCOM's soldier permadeath creates emotional investment and tactical caution." },
"Roguelike Systems": { "quote": "Random generation with permanent consequences. Hades maintains narrative progression across runs despite temporary mechanical setbacks." },
"Loot Systems": { "quote": "Distribution of rewards and treasures. Diablo's variable item drops with randomized properties create a compelling reward loop." },
"Experience Systems": { "quote": "Quantification of character advancement. Final Fantasy traditionally awards XP only after successful battles, incentivizing combat." },
"Level Scaling": { "quote": "Adjustment of challenge to player power. Oblivion's scaled enemies ensure consistent challenge but can undermine progression." },
"Trading Systems": { "quote": "Economic exchanges between entities. Animal Crossing's turnip market introduces time-based risk and reward to trading." }
}
