{
"MDA Framework": { "quote": "Mechanics, Dynamics, Aesthetics - connecting designer actions to player experiences. Mechanics (rules) create Dynamics (behaviors) that generate Aesthetics (emotions)." },
"Elemental Tetrad": { "quote": "Jesse Schell's four elements: Mechanics, Story, Aesthetics, and Technology, which must work in harmony. The Walking Dead balances simple mechanics with powerful storytelling." },
"Player-Centric Design": { "quote": "Designing from the perspective of player needs and experiences. Celeste's assist mode allows players to customize difficulty without sacrificing the core experience." },
"Flow Theory": { "quote": "Csikszentmihalyi's state of optimal experience where challenge matches skill. Super Mario games maintain flow through gradually increasing difficulty with well-placed checkpoints." },
"Self-Determination Theory": { "quote": "Intrinsic motivation through autonomy, competence, and relatedness. Minecraft provides autonomy in goals, competence through building skills, and relatedness in multiplayer." },
"Bartle Player Types": { "quote": "Categorizing players as Achievers, Explorers, Socializers, and Killers. World of Warcraft offers systems for each: achievements, vast landscapes, guilds, and PvP arenas." },
"The Ludology vs. Narratology Debate": { "quote": "Examining games as either rule systems or storytelling vehicles. The Last of Us blends systems-based gameplay with narrative storytelling." },
"The Magic Circle": { "quote": "Huizinga's concept of a boundary between the game world and reality. Entering Skyrim transports players into a space with different rules and social contracts." },
"Engagement Loops": { "quote": "Cyclical patterns of action, reward, and motivation. Destiny 2's daily and weekly challenges create short and long-term engagement cycles." },
"Formal Abstract Design Tools": { "quote": "Doug Church's approach to discussing game elements with precise vocabulary. 'Intention' describes how players can formulate plans within the game's systems." },
"PENS Model": { "quote": "Player Experience of Need Satisfaction, measuring competence, autonomy, and relatedness. Souls games create strong competence satisfaction through challenging but fair gameplay." },
"Emotional Progression Arcs": { "quote": "Mapping the intended emotional journey throughout the experience. Journey's deliberate progression from curiosity to awe to loss to triumph." },
"The 4 Keys 2 Fun": { "quote": "Nicole Lazzaro's four types of fun: Hard Fun, Easy Fun, Serious Fun, and People Fun. Mario Kart offers all four types for different player preferences." },
"Game Genre Expectations": { "quote": "Working within or subverting established conventions. Undertale deliberately subverts RPG conventions to deliver its message about violence in games." },
"Rational Game Design": { "quote": "Ubisoft's systematic approach to creating consistent challenge curves. Trials Rising's track design follows mathematical principles for consistent difficulty progression." },
"The Hero's Journey": { "quote": "Campbell's monomyth adapted to game narrative structure. God of War (2018) follows Kratos and Atreus through the classic heroic arc." },
"Compulsion Loops": { "quote": "Behavioral psychology applied to player retention. Diablo's variable reward schedules with loot drops create powerful compulsion loops." },
"Feedback Loops": { "quote": "Positive loops amplify effects, negative loops create balance. Mario Kart's rubber-banding gives trailing players better items to create closer races." },
"Core, Metagame, and Progression Loops": { "quote": "The hierarchy of gameplay cycles from moment-to-moment to long-term. Clash Royale has core combat, meta card collection, and progression through arenas." },
"Lens-Based Design": { "quote": "Jesse Schell's 113 lenses for examining game design decisions. The Lens of Freedom asks: 'What meaningful choices do I offer the player?'" },
"Skill Atoms": { "quote": "Breaking down mechanics into atomic learning units. Portal introduces each puzzle element individually before combining them." },
"Choice Architecture": { "quote": "How options are presented affects decisions. Mass Effect uses dialogue wheels to shape conversation flow and decision-making." },
"The Interest Curve": { "quote": "Mapping player engagement throughout the experience. Half-Life 2 alternates between combat, puzzles, and story to maintain interest." },
"SCAMPER Method": { "quote": "Substitute, Combine, Adapt, Modify, Put to other use, Eliminate, Reverse - for creative iteration. Splatoon substitutes bullets with ink to create a shooter with unique territory control mechanics." },
"Jobs To Be Done": { "quote": "Understanding why players 'hire' your game. Animal Crossing fulfilled the job of providing routine and social connection during lockdowns." },
"Agile Game Development": { "quote": "Iterative approach with frequent testing and adaptation. Hades used Early Access to refine its roguelike mechanics based on player feedback." },
"Game Feel Principles": { "quote": "Steve Swink's framework for tactile sensation in games. Ori and the Blind Forest's character movement includes subtle squash and stretch animations for responsive feel." },
"MDA X Psychology": { "quote": "Extending MDA with psychological principles. Hellblade: Senua's Sacrifice creates mechanics that induce the anxiety of psychosis to build empathy." },
"The 8 Kinds of Fun": { "quote": "Marc LeBlanc's taxonomy: Sensation, Fantasy, Narrative, Challenge, Fellowship, Discovery, Expression, Submission. Overwatch offers multiple kinds simultaneously through hero variety and team play." },
"Value-Sensitive Design": { "quote": "Accounting for human values in a principled manner. Papers, Please embeds ethical dilemmas directly in its approval mechanics." }
}
