{
"Action": { "quote": "Fast-paced excitement with emphasis on physical feats and conflict. (Die Hard, Jason Bourne novels)" },
"Adventure": { "quote": "Journey-focused narratives emphasizing exploration and discovery. (Indiana Jones, The Odyssey)" },
"Comedy": { "quote": "Humor-centered works designed to provoke laughter. (The Office, The Hitchhiker's Guide to the Galaxy)" },
"Drama": { "quote": "Character-driven stories exploring emotional and social conflicts. (Breaking Bad, The Great Gatsby)" },
"Horror": { "quote": "Evokes fear through atmosphere, tension, and the unknown. (The Shining, Dracula)" },
"Romance": { "quote": "Focuses on relationships and emotional fulfillment through love. (Pride and Prejudice, The Notebook)" },
"Science Fiction": { "quote": "Explores speculative futures and technological implications. (Blade Runner, Foundation series)" },
"Fantasy": { "quote": "Creates magical worlds with elements impossible in reality. (The Lord of the Rings, Game of Thrones)" },
"Mystery": { "quote": "Puzzles and investigations drive the narrative to uncover truths. (Sherlock Holmes, Knives Out)" },
"Thriller": { "quote": "Creates suspense through high stakes and tension. (The Silence of the Lambs, Gone Girl)" },
"Historical": { "quote": "Set in the past with attention to period authenticity. (Schindler's List, War and Peace)" },
"Biography": { "quote": "Accounts of real people's lives and experiences. (The Social Network, Steve Jobs biography)" },
"Documentary": { "quote": "Non-fiction works presenting facts and real-world events. (Planet Earth, In Cold Blood)" },
"Western": { "quote": "Set in the American frontier highlighting frontier justice and expansion. (The Good, the Bad and the Ugly, Lonesome Dove)" },
"Musical": { "quote": "Storytelling through song and choreographed performance. (Hamilton, La La Land)" },
"Satire": { "quote": "Uses humor, irony, and exaggeration to critique society. (Dr. Strangelove, Animal Farm)" },
"Crime": { "quote": "Centers on illegal activities and their consequences. (The Godfather, The Wire)" },
"War": { "quote": "Explores armed conflict and its impact on individuals and society. (Saving Private Ryan, All Quiet on the Western Front)" },
"Coming-of-Age": { "quote": "Chronicles the transition from youth to adulthood. (The Catcher in the Rye, Boyhood)" },
"Epic": { "quote": "Grand-scale narratives spanning long timeframes or vast settings. (Lawrence of Arabia, One Hundred Years of Solitude)" },
"Dystopian": { "quote": "Depicts societies characterized by suffering and injustice. (1984, The Handmaid's Tale)" },
"Tragedy": { "quote": "Follows a protagonist's downfall, often through fatal flaws. (Macbeth, Requiem for a Dream)" },
"Gothic": { "quote": "Combines elements of horror, romance, and death in mysterious settings. (Wuthering Heights, The Fall of the House of Usher)" },
"Experimental": { "quote": "Challenges conventions through innovative techniques. (Ulysses, Memento)" },
"Noir": { "quote": "Dark, cynical stories often featuring crime and moral ambiguity. (The Maltese Falcon, Chinatown)" },
"Magical Realism": { "quote": "Incorporates fantastical elements into otherwise realistic settings. (One Hundred Years of Solitude, Pan's Labyrinth)" },
"Absurdist": { "quote": "Emphasizes the irrationality and meaninglessness of human existence. (Waiting for Godot, Brazil)" },
"Folk": { "quote": "Rooted in traditional cultural narratives and expressions. (O Brother, Where Art Thou?, American folk music)" },
"Surrealism": { "quote": "Combines dreamlike imagery with psychological exploration. (Un Chien Andalou, The Metamorphosis)" },
"Post-Apocalyptic": { "quote": "Set after a catastrophic event has destroyed civilization. (The Road, Mad Max)" }
}
