{
"Divine Names": { "quote": "Govinda means 'finder of the cows' and 'finder of the senses' - He who gives pleasure to the cows and the senses. (Vishnu Purana 5.12.11)" },
"Pastoral Divinity": { "quote": "With a peacock feather in His crown and a flute at His lips, Govinda tends the cows in the forests of Vrindavan. (Brahma Samhita 5.30)" },
"Divine Protection": { "quote": "Just as Govinda protected the cows of Vrindavan, He protects all those who take shelter of Him. (Srimad Bhagavatam 10.25)" },
"Divine Music": { "quote": "When Govinda plays His flute, all of creation becomes enchanted. (Gita Govinda 1.1)" },
"Divine Play": { "quote": "Govinda sports eternally with His devotees in the groves of Vrindavan. (Brahma Samhita 5.43)" },
"Divine Beauty": { "quote": "Govinda's form is eternally youthful, His complexion like a fresh monsoon cloud, His eyes like lotus petals. (Gita Govinda 1.5)" },
"Divine Love": { "quote": "The gopis, forgetting all else, ran to Govinda upon hearing His flute. (Srimad Bhagavatam 10.21.4)" },
"Divine Grace": { "quote": "By Govinda's grace, even impossible things become possible. (Chaitanya Charitamrita 2.15.180)" },
"Divine Nature": { "quote": "Like a wish-fulfilling tree, Govinda fulfills the desires of His devotees. (Brahma Samhita 5.29)" },
"Divine Relationships": { "quote": "To His devotees, Govinda is friend, master, child, and beloved. (Srimad Bhagavatam 10.14.32)" },
"Divine Activities": { "quote": "Govinda's daily pastimes in Vrindavan are eternal and ever-fresh. (Chaitanya Charitamrita 2.20.96)" },
"Divine Abode": { "quote": "Goloka Vrindavan is Govinda's eternal abode, full of wish-fulfilling cows and kalpa-vriksha trees. (Brahma Samhita 5.56)" },
"Divine Service": { "quote": "The highest perfection is to serve Govinda eternally in pure love. (Chaitanya Charitamrita 2.22.96)" },
"Divine Qualities": { "quote": "Govinda possesses all attractive qualities in their fullness. (Nectar of Devotion 21)" },
"Divine Opulence": { "quote": "Though appearing as a simple cowherd, Govinda is the master of all mystic opulence. (Brahma Samhita 5.51)" },
"Divine Companions": { "quote": "Govinda is always surrounded by loving devotees, cowherd boys, and the cows of Vrindavan. (Srimad Bhagavatam 10.15)" },
"Divine Dance": { "quote": "When Govinda dances the Rasa dance, all of creation dances with Him. (Gita Govinda 1.40)" },
"Divine Presence": { "quote": "Govinda is present wherever His devotees remember Him with love. (Padma Purana)" },
"Divine Form": { "quote": "Govinda's form is sac-cid-ananda - eternal, full of knowledge and bliss. (Brahma Samhita 5.32)" },
"Divine Attraction": { "quote": "By His sweet flute-playing, Govinda attracts all living entities. (Srimad Bhagavatam 10.21.7)" },
"Divine Leadership": { "quote": "As Govinda leads the cows to pasture, He leads His devotees to spiritual perfection. (Vishnu Purana 5.13)" },
"Divine Glory": { "quote": "The glory of Govinda is unlimited, like waves in an endless ocean. (Chaitanya Charitamrita 2.25.271)" },
"Divine Protection": { "quote": "Just as Govinda lifted Govardhana Hill to protect His devotees, He protects all who surrender to Him. (Srimad Bhagavatam 10.25)" },
"Divine Pleasure": { "quote": "Govinda's pleasure is in giving pleasure to His devotees. (Bhakti Rasamrita Sindhu 1.2.234)" },
"Divine Sound": { "quote": "The sound of Govinda's flute is the essence of all Vedic wisdom. (Brahma Samhita 5.56)" },
"Divine Accessibility": { "quote": "Though He is the Supreme Lord, as Govinda He is easily approached through love. (Chaitanya Charitamrita 2.19.146)" },
"Divine Reciprocation": { "quote": "As one approaches Govinda, He reciprocates accordingly. (Srimad Bhagavatam 11.2.46)" },
"Divine Intimacy": { "quote": "In His form as Govinda, the Lord exhibits the most intimate loving exchanges. (Bhakti Rasamrita Sindhu 2.1.208)" },
"Divine Play": { "quote": "The pastimes of Govinda are eternally fresh and new. (Chaitanya Charitamrita 1.4.95)" },
"Divine Reality": { "quote": "Though appearing as a cowherd boy, Govinda is the source of all existence. (Brahma Samhita 5.1)" }
}
