{
"Beginner (A1)": { "quote": "Can understand and use familiar everyday expressions and basic phrases. Can introduce themselves and others, ask and answer questions about personal details." },
"Elementary (A2)": { "quote": "Can understand sentences and frequently used expressions related to immediate environment. Can communicate in simple and routine tasks requiring direct exchange of information." },
"Intermediate (B1)": { "quote": "Can understand main points of clear standard input on familiar matters. Can deal with most situations likely to arise while traveling in an English-speaking area." },
"Upper Intermediate (B2)": { "quote": "Can understand complex texts on both concrete and abstract topics. Can interact with a degree of fluency and spontaneity that makes regular interaction with native speakers possible." },
"Advanced (C1)": { "quote": "Can understand a wide range of demanding texts and recognize implicit meaning. Can express ideas fluently and spontaneously without obvious searching for expressions." },
"Mastery (C2)": { "quote": "Can understand virtually everything heard or read. Can express themselves spontaneously, very fluently and precisely, differentiating finer shades of meaning even in more complex situations." },
"Reading Proficiency": { "quote": "From basic text comprehension to understanding complex academic materials, technical documents, and literary works." },
"Writing Skills": { "quote": "From forming simple sentences to crafting sophisticated academic papers, creative works, and professional documents." },
"Listening Comprehension": { "quote": "From understanding basic instructions to following complex discussions, debates, and various accents." },
"Speaking Ability": { "quote": "From basic conversations to fluent presentations, negotiations, and natural interaction with native speakers." },
"Grammar Usage": { "quote": "From basic sentence structures to mastery of complex grammatical forms and nuanced expression." },
"Vocabulary Range": { "quote": "From basic 1000-word vocabulary to advanced academic and specialized terminology exceeding 20,000 words." },
"Pronunciation": { "quote": "From basic intelligibility to near-native pronunciation with proper stress, intonation, and rhythm." },
"Academic English": { "quote": "Specialized language skills for university study, research, and scholarly communication." },
"Business English": { "quote": "Professional language skills for workplace communication, negotiations, and business correspondence." },
"Technical English": { "quote": "Specialized vocabulary and structures for scientific, engineering, and technical fields." },
"Casual English": { "quote": "Everyday conversational English including idioms, slang, and cultural references." },
"Exam Grades": { "quote": "Standardized test scores: IELTS (1-9), TOEFL (0-120), Cambridge (KET to CPE), TOEIC (10-990)." },
"Cultural Competence": { "quote": "Understanding of English-speaking cultures, customs, and communication styles." },
"Fluency Levels": { "quote": "From hesitant, basic communication to smooth, natural expression approaching native speaker ability." },
"Error Frequency": { "quote": "From frequent basic errors to rare, minor mistakes in complex structures." },
"Independent Learning": { "quote": "Ability to continue improving English skills through self-study and immersion." },
"Digital Literacy": { "quote": "Competency in using English in digital environments, social media, and online communication." },
"Professional Proficiency": { "quote": "Ability to function effectively in English-speaking professional environments." },
"Academic Achievement": { "quote": "Capability to succeed in English-medium educational institutions." },
"Social Interaction": { "quote": "Comfort level in various social situations using English." },
"Media Comprehension": { "quote": "Ability to understand English-language media, news, entertainment, and cultural content." }
}
