{
  "Absolute Transcendence": {
    "quote": "Beyond all thought, beyond all qualities, beyond all definition dwells the Absolute. (Upanishads)"
  },
  "Supreme Being": {
    "quote": "I am the Supreme Brahman, the eternal, the pure, the free, the one, and the infinite. (Vivekachudamani)"
  },
  "Personal God": {
    "quote": "The LORD is my shepherd, I shall not want. (Psalm 23:1)"
  },
  "Creator God": {
    "quote": "In the beginning God created the heavens and the earth. (Genesis 1:1)"
  },
  "Universal Consciousness": {
    "quote": "That which pervades all, which nothing transcends and which, like the universal space around us, fills everything completely from within and without. (Bhagavad Gita)"
  },
  "Divine Intelligence": {
    "quote": "The Logos was with God, and the Logos was God. (John 1:1)"
  },
  "Cosmic Mind": {
    "quote": "The universal mind contains all knowledge. It is the potential ultimate of all things. (The Kybalion)"
  },
  "Manifested Deity": {
    "quote": "I manifest myself in various forms, yet remain unchanged. (Krishna, Bhagavad Gita)"
  },
  "Divine Emanations": {
    "quote": "From the One come the many, like sparks from a fire. (Plotinus, Enneads)"
  },
  "Avatars": {
    "quote": "Whenever dharma declines and adharma increases, I incarnate myself. (Bhagavad Gita 4:7)"
  },
  "Divine Attributes": {
    "quote": "To God belong the most beautiful names. (Quran 7:180)"
  },
  "Angelic Hierarchy": {
    "quote": "Above him were seraphim, each with six wings. (Isaiah 6:2)"
  },
  "Divine Powers": {
    "quote": "All power in heaven and on earth has been given to me. (Matthew 28:18)"
  },
  "Lesser Deities": {
    "quote": "There are many gods and many lords, yet for us there is but one God. (1 Corinthians 8:5-6)"
  },
  "Nature Spirits": {
    "quote": "Every tree, every spring, every stream, every hill had its own genius loci, its guardian spirit. (Plutarch)"
  },
  "Divine Messengers": {
    "quote": "We sent not a messenger except to teach the native language of his people. (Quran 14:4)"
  },
  "Divine Essence": {
    "quote": "The essence of all beings is the divine; know this and rejoice in it. (Upanishads)"
  },
  "Cosmic Forces": {
    "quote": "The divine forces maintain the cosmic order through their eternal dance. (Vedic Texts)"
  },
  "Divine Light": {
    "quote": "God is light; in him there is no darkness at all. (1 John 1:5)"
  },
  "Divine Love": {
    "quote": "God is love. Whoever lives in love lives in God, and God in them. (1 John 4:16)"
  },
  "Divine Wisdom": {
    "quote": "Wisdom was with God in the beginning, before any of his works. (Proverbs 8:22)"
  },
  "Divine Truth": {
    "quote": "The truth is one, though sages know it by many names. (Rig Veda)"
  },
  "Divine Justice": {
    "quote": "Righteousness and justice are the foundation of your throne. (Psalm 89:14)"
  },
  "Divine Beauty": {
    "quote": "One thing I ask from the LORD: to gaze on the beauty of the LORD. (Psalm 27:4)"
  },
  "Divine Mercy": {
    "quote": "His mercy endures forever. (Psalm 136)"
  },
  "Divine Power": {
    "quote": "Power belongs to God. (Psalm 62:11)"
  },
  "Divine Grace": {
    "quote": "By grace you have been saved through faith. (Ephesians 2:8)"
  },
  "Divine Presence": {
    "quote": "The whole earth is full of his glory. (Isaiah 6:3)"
  },
  "Divine Word": {
    "quote": "By the word of the LORD the heavens were made. (Psalm 33:6)"
  },
  "Divine Law": {
    "quote": "The law of the LORD is perfect, refreshing the soul. (Psalm 19:7)"
  },
  "Divine Spirit": {
    "quote": "The Spirit of God has made me; the breath of the Almighty gives me life. (Job 33:4)"
  },
  "Divine Names": {
    "quote": "Holy is Your Name. (Luke 1:49)"
  },
  "Divine Will": {
    "quote": "Not my will, but yours be done. (Luke 22:42)"
  },
  "Divine Nature": {
    "quote": "His divine power has given us everything we need. (2 Peter 1:3)"
  },
  "Divine Glory": {
    "quote": "The glory of the LORD filled the temple. (1 Kings 8:11)"
  },
  "Divine Unity": {
    "quote": "Hear, O Israel: The LORD our God, the LORD is one. (Deuteronomy 6:4)"
  },
   "Transcendent": {
    "quote": "Beyond the beyond, and yet beyond that too lies the Absolute. (Mandukya Upanishad)"
  },
  "Immanent": {
    "quote": "Closer is He than breathing, and nearer than hands and feet. (Bhagavad Gita 18:61)"
  },
  "Personal": {
    "quote": "I am your Father and you are My children. (Psalms 82:6)"
  },
  "Impersonal": {
    "quote": "The Tao that can be named is not the eternal Tao. (Tao Te Ching 1)"
  },
  "Omnipresent": {
    "quote": "Where can I flee from your presence? If I ascend to heaven, you are there. (Psalm 139:7-8)"
  },
  "Manifest": {
    "quote": "In every age I come forth to protect the virtuous. (Bhagavad Gita 4:8)"
  },
  "Unmanifest": {
    "quote": "No vision can grasp Him, but His grasp is over all vision. (Quran 6:103)"
  },
  "Absolute": {
    "quote": "I am Brahman - the unchanging, infinite, immanent and transcendent reality. (Brihadaranyaka Upanishad)"
  },
  "Relative": {
    "quote": "As many as are the forms desired by the devotee, so many forms does the Lord manifest. (Bhagavata Purana)"
  },
  "Universal": {
    "quote": "The Self is all this: what has been, what is, what will be. (Chandogya Upanishad)"
  },
  "Individual": {
    "quote": "The kingdom of God is within you. (Luke 17:21)"
  },
  "Infinite": {
    "quote": "His greatness is unsearchable. (Psalm 145:3)"
  },
  "Finite": {
    "quote": "Made himself nothing, taking the form of a servant. (Philippians 2:7)"
  },
  "Essential": {
    "quote": "Before Abraham was, I AM. (John 8:58)"
  },
  "Attributive": {
    "quote": "The Merciful, the Compassionate, the Just, the Holy. (Quran 59:23-24)"
  },
  "Formless": {
    "quote": "No form, no appearance, no comparison. (Heart Sutra)"
  },
  "Form-based": {
    "quote": "I am the cosmic form, the creator of all. (Bhagavad Gita 11:8)"
  },
  "Eternal": {
    "quote": "Before the mountains were brought forth, from everlasting to everlasting, you are God. (Psalm 90:2)"
  },
  "Temporal": {
    "quote": "The Word became flesh and dwelt among us. (John 1:14)"
  },
  "Unity": {
    "quote": "Hear O Israel, the Lord our God, the Lord is One. (Deuteronomy 6:4)"
  },
  "Multiplicity": {
    "quote": "Gods are but His cosmic powers, numberless expressions of the One. (Rig Veda)"
  },
  "Accessible": {
    "quote": "Draw near to God and He will draw near to you. (James 4:8)"
  },
  "Ineffable": {
    "quote": "Neither words nor mind can reach That. (Taittiriya Upanishad)"
  },
  "Active": {
    "quote": "My Father is working until now, and I am working. (John 5:17)"
  },
  "Passive": {
    "quote": "Be still and know that I am God. (Psalm 46:10)"
  }
}
