{
"Number Recognition": { "quote": "Reading and writing numbers 0 to 100, understanding place value of ones and tens." },
"Counting Skills": { "quote": "Count forward to 100, backward from 20, skip counting by 2s, 5s, and 10s." },
"Number Sequence": { "quote": "Identifying patterns in number sequences, understanding before, after, and between numbers." },
"Addition Basics": { "quote": "Adding numbers within 20, understanding the commutative property (2+3 = 3+2)." },
"Subtraction Basics": { "quote": "Subtracting numbers within 20, understanding the relationship between addition and subtraction." },
"Number Bonds": { "quote": "Understanding part-whole relationships within 10 (5 can be 3+2 or 4+1)." },
"Place Value": { "quote": "Understanding tens and ones in two-digit numbers, grouping objects by tens." },
"Comparison": { "quote": "Using symbols >, <, = to compare numbers, ordering numbers from least to greatest." },
"Mental Math": { "quote": "Developing strategies for quick addition and subtraction within 10." },
"Word Problems": { "quote": "Solving simple addition and subtraction story problems using numbers within 20." },
"Shapes": { "quote": "Identifying and describing 2D shapes (circle, square, triangle, rectangle) and their attributes." },
"Patterns": { "quote": "Recognizing, creating, and extending simple patterns with shapes and numbers." },
"Measurement": { "quote": "Measuring length using non-standard units, comparing lengths of objects." },
"Time": { "quote": "Telling time to the hour and half-hour on analog and digital clocks." },
"Money": { "quote": "Identifying coins, understanding their values, counting combinations of pennies, nickels, and dimes." },
"Graphing": { "quote": "Creating and interpreting simple picture graphs and bar graphs." },
"Sorting": { "quote": "Classifying objects by attributes like size, shape, color, and using sorting rules." },
"Number Facts": { "quote": "Memorizing addition facts to 10, understanding doubles (1+1, 2+2, etc.)." },
"Problem Solving": { "quote": "Using strategies like drawing pictures, using objects, or acting out situations." },
"Estimation": { "quote": "Making reasonable guesses about quantities and checking by counting." },
"Mathematical Language": { "quote": "Using terms like add, subtract, equal, more, less, before, after correctly." },
"Number Lines": { "quote": "Using number lines to count, add, subtract, and understand number relationships." },
"Spatial Awareness": { "quote": "Understanding positional words (above, below, beside) and spatial relationships." },
"Calendar Skills": { "quote": "Understanding days of the week, months of the year, and reading a calendar." },
"Data Collection": { "quote": "Gathering and organizing simple data, answering questions about the data." },
"Mathematical Tools": { "quote": "Using manipulatives, number charts, and other tools to solve problems." },
"Number Writing": { "quote": "Proper formation of numerals 0-9, writing two-digit numbers correctly." },
"Mathematical Symbols": { "quote": "Understanding and using +, -, =, >, < symbols appropriately." },
"Skip Counting": { "quote": "Counting by 2s to 30, by 5s to 50, and by 10s to 100." },
"Basic Fractions": { "quote": "Understanding basic concepts of half and whole in real-world contexts." }
}
