{
"Guru Yoga": {
"short_description": "The profound practice of uniting one's mind with the enlightened mind of the teacher through devotion, visualization, and recognition of the guru as the embodiment of all sources of refuge."
},
"Samaya": {
"short_description": "The sacred bond between guru and disciple, constituting both profound commitment and protection, serving as the foundation for all realization and the vessel for transmission of wisdom."
},
"Four Roots": {
"short_description": "The essential foundations of guru yoga practice: devotion that never wavers, pure perception that sees all actions as perfect, constant remembrance of kindness, and unwavering commitment to following the guru's instructions."
},
"Lineage": {
"short_description": "The unbroken chain of transmission from enlightened master to disciple, carrying both blessings and teachings through time while maintaining the purity and power of the original realization."
},
"Wang": {
"short_description": "Empowerment ceremonies where the guru directly transmits the power, blessings, and authority to practice specific aspects of the teaching, awakening the disciple's inherent potential."
},
"Four Powers": {
"short_description": "The essential aspects of guru blessing: enlightened body, speech, mind, and activity, each conferring specific realizations and capabilities when properly received and maintained."
},
"Visualization": {
"short_description": "The detailed practice of seeing the guru in various forms - peaceful, wrathful, or natural - as the embodiment of all buddhas, maintaining this divine pride while dissolving ordinary perception."
},
"Devotion": {
"short_description": "The heartfelt recognition and appreciation of the guru's qualities that opens the disciple to receiving blessings and transformation, considered the swift path to realization."
},
"Merit Field": {
"short_description": "The visualization of all lineage masters, enlightened beings, and sources of refuge assembled in space before oneself, serving as the field for accumulating merit and receiving blessings."
},
"Seven-Branch Practice": {
"short_description": "The complete method of relating to the guru and accumulating merit through prostration, offering, confession, rejoicing, requesting teachings, beseeching to remain, and dedication."
},
"Three Roots": {
"short_description": "The guru as the root of blessings, the yidam as the root of accomplishment, and the dakinis as the root of activity, all unified in the guru's enlightened nature."
},
"Four Times": {
"short_description": "The practice of remembering and connecting with the guru throughout the day: morning, day, evening, and night, maintaining continuous devotion and awareness."
},
"Pure Perception": {
"short_description": "The essential view of seeing all appearances as the guru's display and all experiences as the guru's blessing, transcending ordinary conceptual limitations."
},
"Outer Guru": {
"short_description": "The physical teacher who introduces one to the nature of mind and provides direct instruction, embodying the compassionate activity of all buddhas."
},
"Inner Guru": {
"short_description": "The manifestation of wisdom within one's own mind, awakened through devotion to and blessing of the outer guru, recognized as inseparable from one's own buddha nature."
},
"Secret Guru": {
"short_description": "The ultimate nature of reality itself, recognized through the blessing of the outer and inner gurus, beyond all conceptual elaboration."
},
"Guru Principle": {
"short_description": "The universal aspect of enlightened wisdom that manifests as teachers throughout time and space, guiding beings according to their needs and capacity."
},
"Four Confidences": {
"short_description": "The certainties developed through guru yoga: confidence in the view, meditation, conduct, and result, arising from direct experience of the guru's blessing."
},
"Five Perfections": {
"short_description": "The complete arrangement of guru yoga practice: perfect teacher, teaching, retinue, place, and time, all recognized as spontaneously perfect in their true nature."
},
"Blessing Stream": {
"short_description": "The continuous flow of enlightened influence from guru to disciple, transmitted through initiation, instruction, and the maintenance of pure devotion and samaya."
}
}
