{
"Divine Love": { "quote": "Even after all this time, the sun never says to the earth, 'You owe me.' Look what happens with a love like that – it lights the whole sky. (Divan)" },
"Spiritual Wine": { "quote": "Wine is the wise teacher, the revealer of secrets. Look in the mirror of wine to see the face of truth. (Divan)" },
"Mystic Vision": { "quote": "I wish I could show you when you are lonely or in darkness the astonishing light of your own being. (Divan)" },
"Heart Wisdom": { "quote": "The heart is the thousand-stringed instrument that can only be tuned with Love. (Divan)" },
"Divine Grace": { "quote": "This place where you are right now, God circled on a map for you. (Divan)" },
"Poetic Beauty": { "quote": "Stay close to anything that makes you glad you are alive. (Divan)" },
"Spiritual Journey": { "quote": "The morning breeze has secrets to tell you. Do not go back to sleep. (Divan)" },
"Love's Mystery": { "quote": "There are different wells within your heart. Some fill with each good rain, others are far too deep for that. (Divan)" },
"Divine Presence": { "quote": "I am a hole in a flute that the Christ's breath moves through – listen to this music. (Divan)" },
"Sacred Intoxication": { "quote": "Bring wine, for I am suffering crop sickness from the vintage; God has seized me, and I am thus held fast. (Divan)" },
"Mystical Knowledge": { "quote": "The great secret which all learned men know is this: no leaf ever falls without the silent consent of the whole tree. (Divan)" },
"Spiritual Freedom": { "quote": "I have learned so much from God that I can no longer call myself a Christian, a Hindu, a Muslim, a Buddhist, a Jew. (Divan)" },
"Poetry's Power": { "quote": "A poet is someone who can pour light into a cup, then raise it to nourish your beautiful parched holy mouth. (Divan)" },
"Divine Beauty": { "quote": "How did the rose ever open its heart and give to this world all its beauty? It felt the encouragement of light against its being. (Divan)" },
"Inner Truth": { "quote": "The subject tonight is Love and for tomorrow night as well. As a matter of fact, I know of no better topic for us to discuss until we all die! (Divan)" },
"Spiritual Practice": { "quote": "The Earth would die if the sun stopped kissing her. (Divan)" },
"Mystic Dance": { "quote": "Every child has known God, not the God of names, not the God of don'ts, but the God who only knows four words and keeps repeating them, saying: Come dance with Me. (Divan)" },
"Heart's Journey": { "quote": "Your heart and my heart are very, very old friends. (Divan)" },
"Divine Union": { "quote": "I am so small I can barely be seen. How can this great love be inside me? Look at your eyes. They are small, but they see enormous things. (Divan)" },
"Poetic Wisdom": { "quote": "Now is the time to know that all that you do is sacred. (Divan)" },
"Spiritual Light": { "quote": "Fear is the cheapest room in the house. I would like to see you living in better conditions. (Divan)" },
"Love's Teaching": { "quote": "This is the kind of Friend you are - Without making me realize my soul's anguish, you slip into my house at night and while I am sleeping, you silently carry off all my suffering and sordid past in your beautiful hands. (Divan)" },
"Divine Mirror": { "quote": "We have come into this exquisite world to experience ever and ever more deeply our divine courage, freedom, and light. (Divan)" },
"Sacred Voice": { "quote": "What we speak becomes the house we live in. (Divan)" },
"Mystical Love": { "quote": "When all your desires are distilled, you will cast just two votes: To love more, and be happy. (Divan)" },
"Soul's Purpose": { "quote": "There is a candle in your heart, ready to be kindled. There is a void in your soul, ready to be filled. (Divan)" },
"Divine Companionship": { "quote": "Don't surrender your loneliness so quickly. Let it cut more deep. Let it ferment and season you as few human or even divine ingredients can. (Divan)" },
"Poetic Truth": { "quote": "The words you speak become the house you live in. (Divan)" },
"Spiritual Awakening": { "quote": "You have been walking the ocean's edge, holding up your robes to keep them dry. You must dive naked under and deeper under, a thousand times deeper. (Divan)" },
"Heart's Wisdom": { "quote": "The beauty of the heart is the lasting beauty: its lips give to drink of the water of life. (Divan)" }
}
