{
"Nature of Truth": { "quote": "That is because Allah is the Truth, and that which they call upon other than Him is falsehood. (Quran 22:62)" },
"Divine Reality": { "quote": "Everything will perish except His Face. (Quran 28:88)" },
"Truth Manifestation": { "quote": "We will show them Our signs in the horizons and within themselves until it becomes clear to them that it is the truth. (Quran 41:53)" },
"Absolute Reality": { "quote": "Al-Haqq is that which remains when all else vanishes. (Ibn Arabi, Fusus al-Hikam)" },
"Divine Essence": { "quote": "Truth is not what is apparent, but what is essential. (Al-Ghazali, Mishkat Al-Anwar)" },
"Truth Recognition": { "quote": "Whoever knows himself knows his Lord. (Prophetic Tradition)" },
"Divine Presence": { "quote": "Wheresoever you turn, there is the Face of Allah. (Quran 2:115)" },
"Truth Seeking": { "quote": "The seeker of truth is the seeker of Allah. (Junayd al-Baghdadi)" },
"Reality Levels": { "quote": "There are as many paths to Allah as there are souls of creatures. (Ibn Arabi)" },
"Divine Witness": { "quote": "Is it not sufficient that your Lord is Witness over all things? (Quran 41:53)" },
"Truth Path": { "quote": "Guide us to the straight path. (Quran 1:6)" },
"Divine Justice": { "quote": "We shall set up the scales of justice on the Day of Resurrection. (Quran 21:47)" },
"Truth Revelation": { "quote": "Truth has come and falsehood has vanished. (Quran 17:81)" },
"Divine Knowledge": { "quote": "He encompasses all that they have and has enumerated all things in detail. (Quran 72:28)" },
"Truth Experience": { "quote": "Die before you die. (Prophetic Tradition)" },
"Divine Light": { "quote": "Allah is the Light of the heavens and the earth. (Quran 24:35)" },
"Truth Realization": { "quote": "The real voyage of discovery consists not in seeking new landscapes, but in having new eyes. (Ibn Arabi)" },
"Divine Unity": { "quote": "There is no reality except Reality. (Al-Hallaj)" },
"Truth Manifestation": { "quote": "Everything in existence is His manifestation. (Ibn Arabi, Fusus al-Hikam)" },
"Divine Understanding": { "quote": "Knowledge is a light which Allah casts into the heart of whomever He wills. (Al-Ghazali)" },
"Truth Principles": { "quote": "The Truth is One, but its expressions are many. (Ibn Arabi)" },
"Divine Guidance": { "quote": "Whomsoever Allah guides, he is the guided one. (Quran 7:178)" },
"Truth Recognition": { "quote": "He who knows himself knows his Lord. (Ibn Arabi)" },
"Divine Signs": { "quote": "In everything there is a sign pointing to the fact that He is One. (Ibn Arabi)" },
"Truth Discernment": { "quote": "The first step of knowledge is to listen, then to be silent, then to remember, then to act upon it, then to spread it. (Ibn Qayyim)" },
"Divine Proximity": { "quote": "We are nearer to him than his jugular vein. (Quran 50:16)" },
"Truth Implementation": { "quote": "Actions are but by intentions. (Prophetic Tradition)" },
"Divine Wisdom": { "quote": "He gives wisdom to whom He wills, and whoever has been given wisdom has certainly been given much good. (Quran 2:269)" },
"Truth Consciousness": { "quote": "The heart is between two of the fingers of the Most Merciful. (Prophetic Tradition)" },
"Divine Reality": { "quote": "Everything is perishing except His Face. (Quran 28:88)" }
}
