{
  "Nested Hierarchy": {
    "short_description": "System where each level contains and transcends lower levels while being contained by higher ones."
  },
  "Holarchy": {
    "short_description": "Hierarchy of holons, where each unit is both whole and part simultaneously."
  },
  "Scalar Hierarchy": {
    "short_description": "Gradual progression based on magnitude or degree of a quality."
  },
  "Emanation": {
    "short_description": "Descending levels proceeding from supreme source, each level derived from above."
  },
  "Developmental Hierarchy": {
    "short_description": "Progressive stages of growth or evolution building upon previous levels."
  },
  "Functional Hierarchy": {
    "short_description": "Levels organized by role or function within larger system."
  },
  "Vibrational Hierarchy": {
    "short_description": "Gradation based on frequency or subtlety of energy or consciousness."
  },
  "Logical Hierarchy": {
    "short_description": "Structure based on inclusion relationships and categorical distinctions."
  },
  "Power Hierarchy": {
    "short_description": "Organization based on distribution and flow of authority or influence."
  },
  "Value Hierarchy": {
    "short_description": "Arrangement according to worth, importance, or ethical significance."
  },
  "Emergent Hierarchy": {
    "short_description": "Levels arising from complexity of interactions in lower levels."
  },
  "Fractal Hierarchy": {
    "short_description": "Self-similar patterns repeating at different scales of organization."
  },
  "Temporal Hierarchy": {
    "short_description": "Organization based on sequence, duration, or cycles of time."
  },
  "Causal Hierarchy": {
    "short_description": "Arrangement based on chains of cause and effect relationships."
  },
  "Archetypal Hierarchy": {
    "short_description": "Organization according to primordial patterns or ideal forms."
  },
  "Taxonomic Hierarchy": {
    "short_description": "Classification system based on shared characteristics and descent."
  },
  "Structural Hierarchy": {
    "short_description": "Organization based on physical or conceptual support relationships."
  },
  "Intensity Hierarchy": {
    "short_description": "Gradation based on strength or degree of manifestation."
  },
  "Conceptual Hierarchy": {
    "short_description": "Organization of ideas from concrete to abstract or general to specific."
  },
  "Network Hierarchy": {
    "short_description": "Levels emerging from patterns of connection and relationship."
  },
  "Cosmic Hierarchy": {
    "short_description": "Levels of reality from gross material to supreme spiritual principle."
  },
  "Operational Hierarchy": {
    "short_description": "Organization based on sequence or dependency of processes."
  },
  "Morphic Hierarchy": {
    "short_description": "Levels of form and pattern from simple to complex organization."
  },
  "Integrative Hierarchy": {
    "short_description": "System where higher levels coordinate and harmonize lower ones."
  },
  "Resonant Hierarchy": {
    "short_description": "Organization based on harmonic relationships between levels."
  },
  "Ecological Hierarchy": {
    "short_description": "Levels of relationship and dependency in living systems."
  },
  "Developmental Holarchy": {
    "short_description": "Growth stages where each includes and transcends previous stages."
  },
  "Symbolic Hierarchy": {
    "short_description": "Levels of meaning and representation from literal to transcendent."
  },
  "Evolutionary Hierarchy": {
    "short_description": "Organization based on sequence of emergence and complexity."
  },
  "Dimensional Hierarchy": {
    "short_description": "Progression through levels of spatial or conceptual dimension."
  }
}
