{
"Nature of Higher Self": { "quote": "The Self is the witness consciousness that observes all experience. (Upanishads)" },
"Names of Higher Self": { "quote": "Atman, Higher Self, Divine Self, True Self, Eternal Self - many names for the immortal essence within. (Vedantic tradition)" },
"Higher Identity": { "quote": "Know thyself. (Ancient Greek aphorism, Temple of Apollo at Delphi)" },
"Self Realization": { "quote": "The kingdom of God is within you. (Luke 17:21)" },
"Higher Consciousness": { "quote": "That which permeates all, which nothing transcends and which, like the universal space around us, fills everything completely from within and without, that Supreme non-dual Brahman — that thou art. (Shankaracharya)" },
"Divine Spark": { "quote": "The light that shines above heaven, shines above all the worlds, above everything, in the highest worlds beyond which there are no higher - that is the same light that shines within man. (Chandogya Upanishad)" },
"Soul Nature": { "quote": "The soul is eternal, all-pervading, unchangeable, immovable, primeval. (Bhagavad Gita 2:24)" },
"Inner Guide": { "quote": "Listen to your intuitive inner voice and find what passion stirs your soul. (Wayne Dyer)" },
"True Identity": { "quote": "Your true nature is pure awareness. (Ramana Maharshi)" },
"Self Knowledge": { "quote": "To know thyself is the beginning of wisdom. (Socrates)" },
"Higher Purpose": { "quote": "He who has a why to live can bear almost any how. (Friedrich Nietzsche)" },
"Divine Connection": { "quote": "The soul is the truth of who we are, a divine spark of God. (Paramahansa Yogananda)" },
"Spiritual Essence": { "quote": "You are not a drop in the ocean. You are the entire ocean in a drop. (Rumi)" },
"Inner Wisdom": { "quote": "The highest spiritual practice is self-observation without judgment. (Swami Rama)" },
"Sacred Self": { "quote": "Your sacred space is where you can find yourself again and again. (Joseph Campbell)" },
"Eternal Nature": { "quote": "What you seek is seeking you. (Rumi)" },
"Self Transformation": { "quote": "The cave you fear to enter holds the treasure you seek. (Joseph Campbell)" },
"Higher Potential": { "quote": "We are what we think. All that we are arises with our thoughts. With our thoughts, we make the world. (Buddha)" },
"Inner Light": { "quote": "There is a light that shines beyond all things on Earth, beyond us all, beyond the heaven, beyond the highest, the very highest heavens. This is the light that shines in our heart. (Chandogya Upanishad)" },
"Divine Attributes": { "quote": "As above, so below; as within, so without. (Hermes Trismegistus)" },
"Self Discovery": { "quote": "The privilege of a lifetime is to become who you truly are. (Carl Jung)" },
"Inner Divinity": { "quote": "Look within—the secret is inside you. (Hui Neng)" },
"Spiritual Identity": { "quote": "You are not the body, you are not the mind. You are the eternal spirit. (Swami Vivekananda)" },
"Higher Awareness": { "quote": "Awareness is the greatest agent for change. (Eckhart Tolle)" },
"Soul Purpose": { "quote": "The purpose of life is to discover your gift. The work of life is to develop it. (David Viscott)" },
"Divine Recognition": { "quote": "The eye through which I see God is the same eye through which God sees me. (Meister Eckhart)" },
"Inner Mastery": { "quote": "He who conquers himself is the mightiest warrior. (Confucius)" },
"Eternal Being": { "quote": "I am not this hair, I am not this skin, I am the soul that lives within. (Rumi)" },
"Higher Understanding": { "quote": "The kingdom of heaven is not a place but a state of consciousness. (John Tillotson)" },
"Sacred Nature": { "quote": "You are a spiritual being having a human experience. (Pierre Teilhard de Chardin)" }
}
