{
"Essence of Reality": { "quote": "The Reality is too tremendous to be known by any means. Only He knows Himself. (Fusus al-Hikam)" },
"Divine Unity": { "quote": "There is nothing in existence except Allah... The universe is His form, His outward aspect, while He is the spirit of the universe that manages it. (Fusus al-Hikam)" },
"Perfect Human": { "quote": "The Perfect Human is the pole around which the spheres of existence revolve from first to last. (Fusus al-Hikam)" },
"Divine Names": { "quote": "The Divine Names are relations which appear to connect the Real with creation, but in truth they connect creation with the Real. (Futuhat al-Makkiyya)" },
"Unity of Existence": { "quote": "Glory be to Him who created all things, being Himself their very essence. (Fusus al-Hikam)" },
"Knowledge of God": { "quote": "He who knows himself knows his Lord. (Commentary on Prophetic Tradition)" },
"Divine Manifestation": { "quote": "Every instant He is in a different configuration, never repeating Himself. (Fusus al-Hikam)" },
"Spiritual Journey": { "quote": "The journey to God has no end, for it is infinite, just as He is infinite. (Futuhat al-Makkiyya)" },
"Divine Imagination": { "quote": "The world is imaginary, but it exists in reality. All that exists is imagined in reality. (Fusus al-Hikam)" },
"Heart Knowledge": { "quote": "My heart has become capable of every form: it is a pasture for gazelles and a convent for Christian monks. (Tarjuman al-Ashwaq)" },
"Divine Attributes": { "quote": "The attributes of the Real are manifest in creation, while His Essence remains forever beyond. (Fusus al-Hikam)" },
"Levels of Being": { "quote": "Existence has degrees according to the manifestation of the divine names within it. (Futuhat al-Makkiyya)" },
"Divine Love": { "quote": "Love is the root of creation; God created the world through love. (Fusus al-Hikam)" },
"Human Perfection": { "quote": "The perfect human being unites the divine creative truth with the created cosmic truth. (Fusus al-Hikam)" },
"Divine Wisdom": { "quote": "Wisdom is putting everything in its proper place. (Futuhat al-Makkiyya)" },
"Spiritual Reality": { "quote": "The spiritual realities are unlimited, while forms are limited. (Fusus al-Hikam)" },
"Divine Presence": { "quote": "Wherever you turn, there is the Face of God. (Commentary on Quranic Verse)" },
"Mystical Knowledge": { "quote": "Knowledge of mysteries comes only through direct tasting (dhawq). (Futuhat al-Makkiyya)" },
"Divine Mirror": { "quote": "The cosmos is the mirror of the Divine, and the human being is the mirror of both. (Fusus al-Hikam)" },
"Spiritual States": { "quote": "Every state has its own knowledge, and every knowledge has its own state. (Futuhat al-Makkiyya)" },
"Divine Breath": { "quote": "The universe is the breath of the All-Merciful. (Fusus al-Hikam)" },
"Perfect Service": { "quote": "The perfect servant is he who realizes his own nothingness before the necessity of God's existence. (Futuhat al-Makkiyya)" },
"Divine Secrets": { "quote": "The secrets of existence are contained within the human form. (Fusus al-Hikam)" },
"Spiritual Hierarchy": { "quote": "The spiritual masters are the physicians of hearts and souls. (Futuhat al-Makkiyya)" },
"Divine Light": { "quote": "God is the Light of the heavens and earth, and every light is but a reflection of His Light. (Commentary on Quranic Verse)" },
"Eternal Now": { "quote": "There is no repetition in divine self-disclosure; every moment is new. (Fusus al-Hikam)" },
"Divine Witnessing": { "quote": "The gnostic sees the Real in everything, rather than seeing everything in the Real. (Futuhat al-Makkiyya)" },
"Spiritual Station": { "quote": "Every spiritual station has its own specific knowledge and state. (Fusus al-Hikam)" },
"Divine Mercy": { "quote": "My mercy embraces all things - this is the fundamental reality of existence. (Commentary on Quranic Verse)" },
"Ultimate Truth": { "quote": "The Ultimate Truth is beyond all conception and perception, yet It is the source of all conception and perception. (Fusus al-Hikam)" }
}
