{
"Brainstorming": { "quote": "Generating numerous ideas without judgment. Quantity breeds quality; the best ideas often emerge after the obvious ones are exhausted." },
"Mind Mapping": { "quote": "Visual organization of connected ideas branching from a central concept. The non-linear structure reveals relationships that linear thinking might miss." },
"Design Thinking": { "quote": "Human-centered approach focusing on empathy, definition, ideation, prototyping, and testing. Understanding user needs leads to more meaningful solutions." },
"Lateral Thinking": { "quote": "Approaching problems from unexpected angles. A famous example: to reduce elevator complaints, installing mirrors made wait times feel shorter rather than increasing speed." },
"Six Thinking Hats": { "quote": "Examining ideas from multiple perspectives: facts, emotions, caution, benefits, creativity, and process. Each 'hat' represents a distinct thinking mode." },
"SCAMPER": { "quote": "Substitute, Combine, Adapt, Modify, Put to other uses, Eliminate, Reverse. This checklist transforms existing ideas into new concepts." },
"Analogical Thinking": { "quote": "Applying solutions from one domain to another. Velcro was inspired by how burrs stick to clothing, transferring nature's solution to human problems." },
"First Principles": { "quote": "Breaking down complex problems into basic elements and reassembling them. Reasoning from fundamental truths rather than by analogy." },
"Constraint-Based Ideation": { "quote": "Using limitations to spark creativity. The constraint of 140 characters led to Twitter's unique communication style." },
"Divergent Thinking": { "quote": "Exploring multiple possible solutions rather than identifying the 'correct' answer. The foundation of creative problem-solving." },
"Convergent Thinking": { "quote": "Evaluating options to select the most promising ideas. Critical after divergent thinking to move from possibilities to practicalities." },
"Reverse Thinking": { "quote": "Inverting the problem to gain new insights. Instead of asking how to increase customer purchases, ask what prevents them from buying." },
"Random Stimulus": { "quote": "Introducing unrelated elements to spark new connections. Connecting a random word to your problem can break established thinking patterns." },
"Forced Connections": { "quote": "Deliberately combining unrelated concepts. The Rolling Stones' logo emerged from combining a tongue and lips with band identity." },
"Prototyping": { "quote": "Creating quick, tangible versions of ideas to test feasibility. Low-fidelity prototypes allow rapid iteration before significant investment." },
"Bodystorming": { "quote": "Physically acting out scenarios to generate insights. Experiencing problems firsthand reveals solutions invisible to abstract thinking." },
"What If Questions": { "quote": "Challenging assumptions through hypothetical scenarios. 'What if we removed this constraint entirely?' opens possibilities beyond incremental improvement." },
"Storyboarding": { "quote": "Visual narrative exploring how ideas might unfold in practice. Sequential illustrations reveal potential problems and opportunities in implementation." },
"Worst Possible Idea": { "quote": "Deliberately generating bad solutions to overcome fear of judgment. Finding what makes ideas terrible often reveals paths to good solutions." },
"Cross-Disciplinary Collaboration": { "quote": "Bringing diverse expertise to problems. The intersection of biology and architecture led to biomimetic building designs." },
"Provocation": { "quote": "Introducing deliberately unreasonable statements to break conventional thinking. 'Cars should have square wheels' might lead to innovations in suspension systems." },
"Incubation": { "quote": "Allowing unconscious thought processes to work on problems. Many breakthroughs occur during breaks from active problem-solving." },
"Pattern Recognition": { "quote": "Identifying recurring structures to inform new approaches. Recognizing patterns across seemingly unrelated domains reveals transferable solutions." },
"Synthesis": { "quote": "Combining existing elements in novel ways. The smartphone synthesized telephone, camera, computer, and GPS into a revolutionary device." },
"Questioning Assumptions": { "quote": "Challenging implicit beliefs that constrain thinking. Airbnb questioned whether accommodation requires purpose-built hotels." },
"Future Scenarios": { "quote": "Envisioning potential futures to identify opportunities and challenges. Anticipating technological shifts reveals innovation possibilities before they become obvious." },
"Rapid Ideation": { "quote": "Time-constrained idea generation to bypass internal censorship. Artificial deadlines often produce surprising creative output." },
"User-Centered Ideation": { "quote": "Generating ideas based on deep understanding of user needs. Observing how people improvise workarounds reveals unmet needs." },
"Systematic Inventive Thinking": { "quote": "Using patterns of innovation to guide idea generation. The 'subtraction' technique removed earphone wires to create wireless headphones." },
"Cross-Pollination": { "quote": "Transferring ideas between different projects or domains. Pixar's inter-film 'brain trust' shares solutions across seemingly unrelated productions." }
}
