{
"Passive Progression": { "quote": "Advancement that occurs without active player interaction. Cookie Clicker continues generating cookies even when the game is closed." },
"Exponential Growth": { "quote": "Ever-increasing numbers that scale dramatically over time. Adventure Capitalist's profit multipliers create astronomical values that require scientific notation." },
"Prestige Mechanics": { "quote": "Systems that reset progress in exchange for permanent bonuses. Realm Grinder's reincarnation system trades current progress for powerful permanent upgrades." },
"Automation": { "quote": "Mechanics that reduce or eliminate manual player actions. Universal Paperclips gradually unlocks auto-clippers and AI assistants to manage production." },
"Unfolding Design": { "quote": "Gradually revealing new mechanics and systems over time. A Dark Room begins as a simple fire-tending game before expanding into resource management and exploration." },
"Upgrade Trees": { "quote": "Interconnected improvements that enable strategic prioritization. Kittens Game offers multiple technological paths with different resource requirements and benefits." },
"Balancing Active and Passive Play": { "quote": "Mechanics that reward both direct interaction and absence. Clicker Heroes offers accelerated progress for active play while still advancing during player absence." },
"Optimization Puzzles": { "quote": "Challenges to maximize efficiency within system constraints. Reactor Idle requires strategic placement of resource generators and connections." },
"Number Porn": { "quote": "The satisfaction of seeing values grow to extreme sizes. Antimatter Dimensions features numbers that grow beyond imagination with unique naming conventions for massive values." },
"Time Manipulation": { "quote": "Mechanics that alter the passage of game time. NGU Idle features time machines that accelerate resource generation." },
"Discovery Mechanics": { "quote": "Revealing new content through reaching thresholds. Cookie Clicker unveils grandmapocalypse lore and mechanics after specific milestones." },
"Resource Conversion Chains": { "quote": "Systems that transform basic resources into increasingly valuable products. Idle Factory Tycoon implements production lines that convert raw materials through multiple refinement stages." },
"Multiplier Stacking": { "quote": "Combining different bonuses for exponential effects. Idle Champions of the Forgotten Realms uses character formations where buffs multiply rather than add." },
"Idle Batteries": { "quote": "Mechanics that cap offline progress to encourage periodic check-ins. Egg, Inc. limits silo capacity, requiring players to return before resources stop generating." },
"Explicit Waiting Periods": { "quote": "Designed downtime that enforces breaks between active play. Idle Skilling includes training activities with specific completion times regardless of player presence." },
"Mini-Games": { "quote": "Active gameplay segments within the primarily passive experience. Melvor Idle includes combat encounters and skill challenges that require direct player engagement." },
"Tiered Achievements": { "quote": "Goal structures that scale with player progression. Idle Miner Tycoon offers increasingly difficult milestones that provide scaling rewards." },
"Strategic Idling": { "quote": "Decisions about when to return to active play for maximum efficiency. Bitcoin Billionaire creates optimal return moments when investment cycles complete." },
"Collection Mechanics": { "quote": "Accumulating items or entities that provide ongoing benefits. Tap Titans 2 features artifact collections that provide permanent bonuses." },
"Offline Calculations": { "quote": "Systems that determine progress during player absence. Idling to Rule the Gods calculates resources generated while away, with potential for bonus rewards." },
"Soft and Hard Caps": { "quote": "Limits that slow or halt progression to create decision points. NGU Idle implements diminishing returns systems that encourage shifting focus between different resources." },
"Rebirth Loops": { "quote": "Cycles of restarting with enhanced capabilities. Trimps features multiple prestige layers that reset different aspects of progression for various benefits." },
"Narrative Revelation": { "quote": "Story elements unlocked through idle progression. Spaceplan unfolds its quirky narrative only as the player advances through device upgrades." },
"Time as Resource": { "quote": "Mechanics where waiting itself is a form of currency. Idle Research offers time skip tokens as valuable rewards for active play achievements." },
"Compounding Systems": { "quote": "Mechanics where benefits build upon previous improvements. Time Clickers features weapons that improve both damage and resource collection, creating accelerating returns." },
"Attention Management": { "quote": "Mechanics that create intentional player attention cycles. Cell to Singularity creates different optimal interaction frequencies for different game systems." },
"Parallel Progression Tracks": { "quote": "Multiple advancement paths that operate simultaneously. Idle Apocalypse features different rooms and creatures that generate distinct resources on their own timelines." },
"Seasonal Mechanics": { "quote": "Time-limited events that provide alternative progression paths. Cookie Clicker's Christmas and Halloween events offer unique upgrades only available during specific periods." },
"Active Boosting": { "quote": "Temporary enhancements triggered by player interaction. Tap Titans allows rapid tapping to increase damage output for a limited time." },
"Meta Progression": { "quote": "Advancement that persists across multiple game resets or sessions. Idle Breakout maintains permanent brick-breaking upgrades through multiple prestige cycles." }
}
