{
"Security Fundamentals": { "quote": "CIA Triad: Confidentiality, Integrity, and Availability form the core principles of information security." },
"Access Control": { "quote": "AAA Framework: Authentication, Authorization, and Accounting control and track resource access." },
"Network Security": { "quote": "Defense in depth: Multiple layers of security controls protect network assets." },
"Cryptography": { "quote": "Encryption transforms plaintext into ciphertext using algorithms and keys." },
"Application Security": { "quote": "Secure SDLC integrates security throughout the software development lifecycle." },
"Physical Security": { "quote": "Environmental and physical controls protect information assets from physical threats." },
"Identity Management": { "quote": "Digital identities must be unique, verifiable, and securely managed." },
"Risk Management": { "quote": "Risk = Threat × Vulnerability × Impact defines the basis of risk assessment." },
"Incident Response": { "quote": "Preparation, Detection, Analysis, Containment, Eradication, Recovery form the IR lifecycle." },
"Security Operations": { "quote": "Continuous monitoring and response protect against evolving threats." },
"Threat Intelligence": { "quote": "Actionable insights about threats enable proactive defense measures." },
"Vulnerability Management": { "quote": "Regular assessment and patching mitigate known vulnerabilities." },
"Security Architecture": { "quote": "Zero Trust principle: Never trust, always verify all access requests." },
"Data Security": { "quote": "Data classification and handling controls protect information throughout its lifecycle." },
"Cloud Security": { "quote": "Shared responsibility model defines security obligations between provider and customer." },
"Mobile Security": { "quote": "Mobile Device Management (MDM) secures mobile endpoints and data." },
"IoT Security": { "quote": "Securing interconnected devices requires embedded security controls." },
"Compliance": { "quote": "Regulatory frameworks establish minimum security requirements." },
"Security Awareness": { "quote": "Human firewall: Users are the first line of defense against threats." },
"Disaster Recovery": { "quote": "Business Continuity Planning ensures operations during disruptions." },
"Forensics": { "quote": "Digital evidence collection and analysis support incident investigation." },
"Penetration Testing": { "quote": "Ethical hacking identifies security weaknesses before attackers." },
"Security Policies": { "quote": "Documentation establishes security requirements, procedures, and expectations." },
"Security Tools": { "quote": "SIEM, IDS/IPS, Firewalls form the security technology stack." },
"Malware Protection": { "quote": "Anti-malware defenses protect against viruses, ransomware, and other threats." },
"Security Metrics": { "quote": "KPIs and metrics measure security program effectiveness." },
"Security Standards": { "quote": "ISO 27001, NIST frameworks provide security program guidance." },
"Security Auditing": { "quote": "Regular assessments verify security control effectiveness." },
"Security Engineering": { "quote": "Security must be designed in, not added as an afterthought." },
"Security Governance": { "quote": "Leadership commitment and oversight drive security program success." }
}
