{
"Integral Theory": {
"short_description": "A comprehensive meta-framework developed by Ken Wilber that synthesizes multiple perspectives and approaches to understanding reality, consciousness, and human development across all domains of experience."
},
"AQAL": {
"short_description": "All Quadrants, All Levels, All Lines, All States, All Types - the fundamental framework of Integral Theory that maps the total spectrum of human potential and experience across multiple dimensions."
},
"Quadrants": {
"short_description": "The four fundamental perspectives or dimensions of reality: Interior-Individual (subjective), Exterior-Individual (objective), Interior-Collective (intersubjective), and Exterior-Collective (interobjective)."
},
"Interior-Individual": {
"short_description": "The Upper-Left quadrant representing subjective experience, personal consciousness, intentions, and individual psychological development including thoughts, emotions, and spiritual experiences."
},
"Exterior-Individual": {
"short_description": "The Upper-Right quadrant representing objective manifestations, including physical behavior, brain states, organisms, and material aspects of individual entities."
},
"Interior-Collective": {
"short_description": "The Lower-Left quadrant representing intersubjective cultural dimensions, shared values, worldviews, mutual understanding, and collective meaning-making."
},
"Exterior-Collective": {
"short_description": "The Lower-Right quadrant representing interobjective social systems, including social structures, economic systems, technological networks, and environmental contexts."
},
"Levels": {
"short_description": "The stages or waves of development through which consciousness and systems evolve, from basic to more complex forms of organization and awareness across all domains."
},
"Lines": {
"short_description": "Multiple intelligences or capacities that develop relatively independently, including cognitive, emotional, moral, interpersonal, spiritual, and other dimensions of growth."
},
"States": {
"short_description": "Temporary experiences of consciousness including ordinary waking, dreaming, deep sleep, and altered or mystical states, available at any stage of development."
},
"Types": {
"short_description": "Enduring styles or patterns that persist across levels of development, such as personality types, gender types, or various typological systems."
},
"Holons": {
"short_description": "Fundamental units of reality that are both wholes in themselves and parts of larger wholes, forming nested hierarchies of increasing complexity and integration."
},
"Holarchy": {
"short_description": "The natural hierarchy of nested holons, where each level transcends and includes previous levels, creating greater depth and complexity while preserving essential features."
},
"Transcend-Include": {
"short_description": "The fundamental pattern of development where each new stage goes beyond but preserves the essential elements of previous stages, creating greater wholeness and integration."
},
"Pre/Trans Fallacy": {
"short_description": "The confusion between pre-rational and trans-rational stages of development, leading to either reduction of higher stages to lower ones or elevation of lower stages to higher ones."
},
"Integral Methodological Pluralism": {
"short_description": "The systematic inclusion and integration of multiple methodologies and ways of knowing, recognizing the validity and limitations of different approaches to understanding reality."
},
"Shadow": {
"short_description": "Aspects of consciousness that have been rejected, repressed, or dissociated, requiring integration for psychological wholeness and development."
},
"Wilber-Combs Lattice": {
"short_description": "A matrix showing the relationship between stages of structural development and states of consciousness, illustrating how state experiences are interpreted differently at different stages."
},
"Zone": {
"short_description": "Different methodological families or approaches to studying reality, each with its own validity claims and methods of investigation within the integral framework."
},
"Altitude": {
"short_description": "A measure of developmental complexity applicable across all lines of development, indicating the general level of consciousness evolution."
},
"Integral Life Practice": {
"short_description": "A comprehensive approach to personal development that exercises all essential dimensions of being through coordinated practice modules addressing body, mind, spirit, and shadow."
},
"Kosmic Address": {
"short_description": "The specific location of any phenomenon within the total matrix of reality, including its quadrant, level, line, state, and type coordinates."
},
"Tetra-Evolution": {
"short_description": "The co-evolution of all four quadrants, recognizing that change in any dimension necessarily involves corresponding changes in all other dimensions."
},
"Vision-Logic": {
"short_description": "A higher-order cognitive capacity that integrates rational and trans-rational modes of knowing, enabling synthetic and paradoxical understanding."
},
"Integral Semiotics": {
"short_description": "The study of how meaning is created and communicated across all quadrants and levels of development, integrating multiple perspectives on signification."
}
}
