{
"Integral Yoga": {
"short_description": "A comprehensive spiritual system developed by Sri Aurobindo and The Mother, aiming at the complete transformation of human nature into divine nature through the descent and integration of higher consciousness."
},
"Supermind": {
"short_description": "The truth-consciousness above mind that sees and knows reality in its unity and multiplicity simultaneously, representing the creative power that manifests divine intention in perfect form through direct knowledge-will."
},
"Psychic Being": {
"short_description": "The evolving soul-personality or true individual, growing through experiences across lifetimes and serving as the center of consciousness that can integrate all parts of the being in divine transformation."
},
"Triple Transformation": {
"short_description": "The threefold process of spiritual development through psychic, spiritual, and supramental transformation, leading to complete divinization of human nature and life."
},
"Ascent and Descent": {
"short_description": "The dual movement of consciousness rising to higher levels while bringing down their force and light into lower nature, establishing new principles of existence in material life."
},
"Divine Life": {
"short_description": "The ultimate aim of Integral Yoga where individual and collective existence perfectly express divine consciousness in material form, creating a new species and society based on truth-consciousness."
},
"Parts of Being": {
"short_description": "The various aspects of human nature - physical, vital, mental, and spiritual - that must be transformed and integrated through yogic practice to achieve divine perfection."
},
"Central Being": {
"short_description": "The eternal portion of the individual above manifestation that supports all surface personality and evolution, connecting personal existence to cosmic and transcendent reality."
},
"Intermediate Zone": {
"short_description": "The complex realm between ordinary and higher consciousness where mixed influences and partial realizations can create confusion and misunderstanding in spiritual development."
},
"Physical Mind": {
"short_description": "The most material level of mental consciousness, concerned with physical things and bound to sensory experience, requiring specific attention for transformation."
},
"Vital Being": {
"short_description": "The life-force aspect of consciousness responsible for emotions, desires, and dynamic action, needing purification and transformation for divine expression."
},
"Mental Being": {
"short_description": "The thinking and conceptual aspect of consciousness that must be elevated and transformed beyond its limited patterns to express higher truth."
},
"Spiritual Mind": {
"short_description": "Higher levels of mental consciousness including higher mind, illumined mind, intuitive mind, and overmind, representing stages in the ascent to supramental consciousness."
},
"Divine Mother": {
"short_description": "The supreme creative force and consciousness that conducts the yoga and transformation, manifesting different aspects and powers for the evolution of consciousness."
},
"Surrender": {
"short_description": "The fundamental attitude and practice of offering all parts of the being to the Divine for transformation, allowing higher consciousness to work freely."
},
"Aspiration": {
"short_description": "The upward impulse and call from within for higher consciousness and divine realization, maintaining the momentum of transformation."
},
"Rejection": {
"short_description": "The conscious turning away from all that opposes the divine transformation, including falsehood, ego, and the old nature's patterns."
},
"Opening": {
"short_description": "The conscious receptivity to higher consciousness and force, allowing their entry and action in various parts of the being."
},
"Faith": {
"short_description": "The soul's knowledge and conviction of divine reality and the possibility of transformation, supporting the journey through all difficulties."
},
"Peace": {
"short_description": "The fundamental spiritual state that must be established as a basis for transformation, allowing higher consciousness to work effectively."
},
"Light": {
"short_description": "The illuminating power of higher consciousness that reveals truth and transforms understanding and perception at all levels."
},
"Force": {
"short_description": "The dynamic power of higher consciousness that effects transformation and manifests divine possibilities in nature."
},
"Consciousness-Force": {
"short_description": "The unified reality of awareness and power that constitutes all existence, becoming the instrument of divine manifestation through yoga."
},
"Transformation": {
"short_description": "The fundamental change of consciousness and substance from human to divine nature, affecting all parts of the being and life."
},
"Evolution": {
"short_description": "The progressive manifestation of higher consciousness in matter, leading toward complete expression of divine possibility in material existence."
},
  "Integral Yoga": {
    "short_description": "A comprehensive spiritual approach developed by Sri Aurobindo and The Mother, aiming at the evolution of consciousness towards a divine life on Earth."
  },
  "Sri Aurobindo": {
    "short_description": "The primary architect of Integral Yoga, a philosopher, yogi, and poet who advocated for a transformation of human nature into a divine one."
  },
  "The Mother": {
    "short_description": "Mirra Alfassa, co-founder of the Sri Aurobindo Ashram and Auroville, known for her spiritual guidance and practical application of Integral Yoga."
  },
  "Supramental Consciousness": {
    "short_description": "A higher state of consciousness beyond the mental, intended to bring about a transformation of human life into a divine existence."
  },
  "Transformation": {
    "short_description": "The core aim of Integral Yoga, involving the change of human nature at every level - physical, vital, mental, and spiritual."
  },
  "Integral Education": {
    "short_description": "An educational approach that harmonizes physical, mental, and spiritual growth, fostering a holistic development of the individual."
  },
  "Auroville": {
    "short_description": "An experimental township in India, conceived by The Mother as a universal city where people from around the world could live in peace and progressive harmony."
  },
  "Sadhana": {
    "short_description": "Spiritual practice in Integral Yoga, involving meditation, self-observation, and the conscious effort to align with the divine."
  },
  "Psychic Being": {
    "short_description": "The evolving soul or true self in each individual, which seeks to govern life and lead to spiritual growth and transformation."
  },
  "Integral Health": {
    "short_description": "A holistic approach to health incorporating physical, psychological, and spiritual well-being as part of the yogic path."
  },
  "Divine Life": {
    "short_description": "The ultimate goal of Integral Yoga where life on Earth is transformed into an expression of the divine, characterized by truth, beauty, and unity."
  },
  "Manifestation": {
    "short_description": "The process of bringing the spiritual into the material world, making the divine consciousness active in everyday life."
  },
  "Ascent and Descent": {
    "short_description": "The dual movement in Integral Yoga where consciousness ascends towards the Divine and divine forces descend to transform human nature."
  },
  "Surrender": {
    "short_description": "The act of relinquishing one's ego and aligning one's will with the Divine, central to the practice of Integral Yoga."
  },
  "Rejection": {
    "short_description": "The process of discarding or transforming negative traits, thoughts, and habits to purify the nature for spiritual growth."
  },
  "Inner Being": {
    "short_description": "The inner dimensions of the self, including the psychic, mental, vital, and physical aspects which are all to be integrated in the spiritual journey."
  },
  "Concentration": {
    "short_description": "Focused attention on the Divine or on one's inner state, a key practice for achieving spiritual progress in Integral Yoga."
  },
  "Aspiration": {
    "short_description": "The inner yearning or call for the Divine, essential for drawing down grace and facilitating personal transformation."
  },
  "Equality": {
    "short_description": "The state of inner equanimity, where one remains undisturbed by external circumstances, a spiritual quality aimed for in Integral Yoga."
  },
  "Silence": {
    "short_description": "A state of inner quietude where the mind is stilled, allowing deeper spiritual experiences and the influence of higher consciousness."
  },
  "Evolution": {
    "short_description": "The belief in Integral Yoga that human evolution is not complete and continues towards a higher spiritual state through yogic practices."
  },

  "Integral Yoga Definition": { "quote": "A synthesis of all yogic paths—Karma (action), Bhakti (devotion), Jnana (knowledge), Raja (psychic mastery)—to realize the Divine in life. (Sri Aurobindo, *The Synthesis of Yoga*)" },
  "Psychic Being": { "quote": "The soul’s evolving spark: 'The psychic is the flame of the Divine burning in the heart’s lotus.' (The Mother)" },
  "Supramental Consciousness": { "quote": "The Truth-Consciousness: 'The Supermind is the bridge between Sachchidananda [Existence-Consciousness-Bliss] and creation.' (Sri Aurobindo, *The Life Divine*)" },
  "Triple Transformation": { "quote": "1. Psychic (soul awakening), 2. Spiritual (cosmic unity), 3. Supramental (divinizing matter)." },
  "Sadhana of Integral Yoga": { "quote": "Surrender: 'All can be done if the god-touch is there.' (Sri Aurobindo, *Savitri*)" },
  "Jnana Yoga Integral": { "quote": "Knowledge unified with action: 'To know, to will, to dare, and to keep silent.' (The Mother)" },
  "Karma Yoga Integral": { "quote": "Divinized work: 'All life is Yoga.' (Sri Aurobindo)" },
  "Bhakti Yoga Integral": { "quote": "Surrender to the Divine Mother: 'To love the Divine is to love the Truth of oneself.' (The Mother)" },
  "Physical Consciousness": { "quote": "Transforming the body: 'The cells themselves must remember the Divine.' (The Mother)" },
  "Vital Purification": { "quote": "Mastering desires: 'The vital is a horse that must be ridden, not let loose.' (Sri Aurobindo)" },
  "Mental Silence": { "quote": "Cessation of thought-waves: 'Empty the boat of your consciousness to let the Divine cargo in.' (Sri Aurobindo)" },
  "Sachchidananda": { "quote": "सच्चिदानन्द: Existence-Consciousness-Bliss—the Absolute realized through integral practice." },
  "Divine Shakti": { "quote": "The Mother’s Force: 'The Shakti is the key to open the doors of the Unmanifest.' (Sri Aurobindo)" },
  "Overmental vs. Supramental": { "quote": "Overmind fragments truth; Supramind unites all in divine harmony. (Sri Aurobindo, *The Life Divine*)" },
  "Integral Education": { "quote": "Harmonizing body, vital, mind, and soul: 'Education to be complete must have five aspects: physical, vital, mental, psychic, and spiritual.' (The Mother)" },
  "Divine Life": { "quote": "Aim of Integral Yoga: 'A divine life in a divine body.' (Sri Aurobindo)" },
  "Rejection & Offering": { "quote": "Reject unconsciousness; offer all to the Divine: 'Not I, but Thou in me.' (The Mother)" },
  "Gnostic Being": { "quote": "The transformed individual: 'A being of light, power, and joy moving in a world of light, power, and joy.' (Sri Aurobindo)" },
  "Collective Evolution": { "quote": "A divine society: 'Unity is the law of the Supramental world.' (The Mother)" },
  "Agenda of the Body": { "quote": "The body’s resistance: 'The body has its own wisdom; it fears change but can learn to trust the Light.' (The Mother)" },
  "Supermind Descent": { "quote": "The Supramental Manifestation: 'A new sun has lighted the earth’s darkness.' (Sri Aurobindo, *Savitri*)" },
  "Integral Avatar": { "quote": "Sri Aurobindo as guide: 'He who would bring the heavenly realms to earth.' (Sri Aurobindo, *Savitri*)" },
  "Fourfold Personality": { "quote": "Soul (psychic), mental, vital, physical—integrated under the Divine’s governance." },
  "The Mother’s Role": { "quote": "The Divine Feminine: 'The Mother is the Consciousness and Force of the Supreme.' (Sri Aurobindo)" },
  "Yoga of Works": { "quote": "Action as worship: 'All work is Brahman; all results are Brahman’s play.' (Sri Aurobindo)" },
  "Consciousness-Force": { "quote": "Chit-Shakti: 'The power to change the world lies in the purity of consciousness.' (The Mother)" },
  "Supramental Transformation": { "quote": "The body’s divinization: 'Matter shall reveal the Spirit’s face.' (Sri Aurobindo, *Savitri*)" },
  "Obstacles in Yoga": { "quote": "Inertia (tamas), ego, doubt: 'The hostile forces are the test of the sincerity of your aspiration.' (The Mother)" },
  "Future of Humanity": { "quote": "A divine race: 'Man is a transitional being; he is not final.' (Sri Aurobindo)" }
}
