{
"Divine Controller": { "quote": "Ishvara is the supreme controller, the body of consciousness whose cosmic body includes all beings. (Yoga Sutras 1:24)" },
"Supreme Lord": { "quote": "From fear of Him the wind blows, from fear of Him the sun rises. (Taittiriya Upanishad 2.8.1)" },
"Universal Witness": { "quote": "The Lord dwells in the hearts of all beings witnessing their actions. (Bhagavad Gita 13.23)" },
"Cosmic Sustainer": { "quote": "By whose command the moon and sun function, that alone is Brahman. (Kena Upanishad 1.1)" },
"Divine Essence": { "quote": "Ishvara is a special Purusha, untouched by afflictions, karma, fruition or their residue. (Yoga Sutras 1:24)" },
"Divine Knowledge": { "quote": "In Him is contained all knowledge. He is the source of time. (Shvetashvatara Upanishad 6.2)" },
"Divine Grace": { "quote": "By His grace alone do we attain the supreme peace. (Katha Upanishad 2.20)" },
"Cosmic Order": { "quote": "Through His power the universe revolves in order. (Shvetashvatara Upanishad 6.1)" },
"Divine Manifestation": { "quote": "All these forms are manifestations of the Supreme Lord. (Brahma Sutra 2.1.14)" },
"Divine Will": { "quote": "By His will all things move and have their being. (Kena Upanishad 1.4)" },
"Divine Protection": { "quote": "The Lord protects those who take refuge in Him. (Bhagavad Gita 9.31)" },
"Divine Nature": { "quote": "The Lord is the indwelling spirit of all beings. (Bhagavad Gita 18.61)" },
"Divine Power": { "quote": "His power is heard to be indeed diverse. (Shvetashvatara Upanishad 6.8)" },
"Divine Creation": { "quote": "From Him proceeds all creation, in Him it dissolves. (Mundaka Upanishad 1.1.7)" },
"Divine Presence": { "quote": "The Lord resides in the heart of all beings. (Bhagavad Gita 18.61)" },
"Divine Attributes": { "quote": "Omniscient, all-powerful, self-luminous is the Supreme Lord. (Shvetashvatara Upanishad 6.8)" },
"Divine Law": { "quote": "The Lord is the upholder of cosmic law and order. (Bhagavad Gita 9.10)" },
"Divine Reality": { "quote": "That which is One, the sages call by many names. (Rig Veda 1.164.46)" },
"Divine Consciousness": { "quote": "Pure consciousness, eternal and infinite is Ishvara. (Yoga Sutras Commentary 1:24)" },
"Divine Energy": { "quote": "By His energy the whole universe is illumined. (Katha Upanishad 2.2.15)" },
"Divine Unity": { "quote": "All this is indeed Brahman. (Chandogya Upanishad 3.14.1)" },
"Divine Worship": { "quote": "Through devotion alone can one know Me as I am. (Bhagavad Gita 18.55)" },
"Divine Liberation": { "quote": "By knowing Him alone one transcends death. (Shvetashvatara Upanishad 3.8)" },
"Divine Path": { "quote": "Those who meditate on Him become immortal. (Shvetashvatara Upanishad 3.10)" },
"Divine Wisdom": { "quote": "The wise see the Lord present in all beings. (Isha Upanishad 6)" },
"Divine Sound": { "quote": "The sacred syllable Om is verily the Lord. (Mandukya Upanishad 1)" },
"Divine Form": { "quote": "His form is not to be seen, no one sees Him with the eye. (Katha Upanishad 2.3.9)" },
"Divine Time": { "quote": "I am time, the great destroyer of worlds. (Bhagavad Gita 11.32)" },
"Divine Freedom": { "quote": "The Lord is ever free, untouched by any condition. (Yoga Sutras 1:24)" },
"Divine Existence": { "quote": "That which exists is One; sages call it by various names. (Rig Veda 1.164.46)" }
}
