{
"Rapid Prototyping": { "quote": "Quick creation of functional but simplified versions to test concepts. Nintendo's approach of finding the fun through multiple rapid prototypes before full production." },
"Paper Prototyping": { "quote": "Low-fidelity physical representations of digital interfaces. Card games are often prototyped with paper cards and handwritten rules before digital implementation." },
"Wireframing": { "quote": "Basic visual schematics that outline structure and functionality. Wireframes for Hearthstone established card placement and UI flow before visual design." },
"Clickable Prototypes": { "quote": "Interactive mockups that simulate functionality without backend coding. InVision prototypes allow testing of app navigation and basic interactions." },
"Vertical Slice": { "quote": "A fully-polished section of the game that demonstrates the complete vision. The E3 demo for The Last of Us represented a vertical slice showing gameplay, graphics, and story." },
"Proof of Concept": { "quote": "Small implementation that verifies a specific technology or mechanic is feasible. Portal began as a student project called Narbacular Drop that proved the portal concept." },
"Playtesting": { "quote": "Gathering user feedback on prototypes to guide iteration. Valve's extensive playtesting for Left 4 Dead led to the addition of the Director AI system." },
"Iterative Design": { "quote": "Cyclical process of creating, testing, analyzing, and refining. Hades developed in Early Access with players providing feedback on each iteration." },
"A/B Testing": { "quote": "Comparing two versions to determine which performs better. Mobile games often A/B test different monetization models to optimize player spending and retention." },
"User Stories": { "quote": "Descriptions of features from the end-user perspective. 'As a player, I want to clearly see my health status without looking away from the action.'" },
"Minimum Viable Product": { "quote": "Version with just enough features to satisfy early users and enable feedback. Minecraft's alpha release contained basic blocks and survival elements before expanding." },
"Design Sprints": { "quote": "Time-boxed periods focused on specific design challenges. Five-day sprints at Ubisoft might focus on prototyping a new combat system." },
"Participatory Design": { "quote": "Including users directly in the design process. Warframe developers regularly incorporate player suggestions from their Design Council." },
"Lo-Fi Prototyping": { "quote": "Basic interactive models that test functionality without visual polish. Early builds of Among Us used simple colored blocks for characters." },
"Hi-Fi Prototyping": { "quote": "Detailed prototypes that closely resemble the final product. Final beta versions of League of Legends champions include nearly complete visuals and effects." },
"Interactive Mockups": { "quote": "Visual representations with basic interactivity. UI designs for Destiny shown to players with clickable elements to gather navigation feedback." },
"Throwaway Prototyping": { "quote": "Creating disposable versions solely to test concepts. Early movement mechanics in Mirror's Edge were tested in simplified environments never intended for release." },
"Evolutionary Prototyping": { "quote": "Gradually refining a prototype into the final product. No Man's Sky's ongoing development transformed the initial release through continuous iteration." },
"Experience Prototyping": { "quote": "Simulating user experience beyond just interfaces. VR games often prototype physical comfort and motion sickness mitigation techniques." },
"Wizard of Oz Prototyping": { "quote": "Human operators simulate automated functionality. Game AI behavior might be controlled by developers during early playtests to evaluate player reactions." },
"Bodystorming": { "quote": "Physical enactment of scenarios to explore solutions. Nintendo physically acts out gameplay scenarios when designing motion controls for games like Wii Sports." },
"Technical Prototype": { "quote": "Focused on proving technical feasibility rather than user experience. Id Software built tech prototypes to verify DOOM Eternal could run at 60fps with advanced graphics." },
"Design Language": { "quote": "Consistent visual and interaction principles established during prototyping. Overwatch's strong character silhouettes were established in early prototypes." },
"Mood Boards": { "quote": "Collections of visual references that guide aesthetic direction. God of War's Nordic setting was explored through mood boards before environmental prototyping." },
"Storyboarding": { "quote": "Sequential illustrations that map out user journeys or narratives. Cinematic sequences in Uncharted are storyboarded before being prototyped in-engine." },
"Usability Testing": { "quote": "Evaluating how easily users can accomplish tasks with the prototype. Testing whether players can intuitively understand Portal 2's gel mechanics." },
"Feature Prioritization": { "quote": "Ranking features by importance to guide prototype development. Core combat mechanics in Dark Souls were prioritized over inventory systems in early prototypes." },
"Feedback Loops": { "quote": "Cycles of user input and design refinement. Early Access games like Satisfactory incorporate player feedback into regular development updates." },
"Contextual Inquiry": { "quote": "Observing users interacting with prototypes in natural settings. Watching how players approach puzzles in The Witness led to refinements in visual guidance." },
"Performance Testing": { "quote": "Measuring technical aspects like frame rate and load times. Prototypes for Doom Eternal were benchmarked on various hardware configurations." }
}
