{
"Divine Love": { "quote": "Your task is not to seek for love, but merely to seek and find all the barriers within yourself that you have built against it. (Mathnawi)" },
"Spiritual Journey": { "quote": "What you seek is seeking you. (Diwan-e Shams-e Tabrizi)" },
"Mystical Union": { "quote": "I am not this hair, I am not this skin, I am the soul that lives within. (Masnavi)" },
"Inner Wisdom": { "quote": "Yesterday I was clever, so I wanted to change the world. Today I am wise, so I am changing myself. (Fihi Ma Fihi)" },
"Divine Unity": { "quote": "Not Christian or Jew or Muslim, not Hindu, Buddhist, Sufi or Zen. Not any religion or cultural system. I am not from the East or the West... My place is placeless, a trace of the traceless. (Diwan-e Shams)" },
"Spiritual Dance": { "quote": "Dance, when you're broken open. Dance, if you've torn the bandage off. Dance in the middle of the fighting. Dance in your blood. Dance when you're perfectly free. (Mathnawi)" },
"Divine Presence": { "quote": "Why do you stay in prison when the door is so wide open? (Masnavi)" },
"Heart Wisdom": { "quote": "The wound is the place where the Light enters you. (Fihi Ma Fihi)" },
"Soul Journey": { "quote": "Out beyond ideas of wrongdoing and rightdoing, there is a field. I'll meet you there. (Masnavi)" },
"Divine Silence": { "quote": "Silence is the language of God, all else is poor translation. (Fihi Ma Fihi)" },
"Spiritual Liberation": { "quote": "You were born with wings, why prefer to crawl through life? (Diwan-e Shams)" },
"Divine Grace": { "quote": "When you do things from your soul, you feel a river moving in you, a joy. (Mathnawi)" },
"Mystical Knowledge": { "quote": "The minute I heard my first love story, I started looking for you, not knowing how blind that was. Lovers don't finally meet somewhere. They're in each other all along. (Masnavi)" },
"Inner Light": { "quote": "Don't be satisfied with stories, how things have gone with others. Unfold your own myth. (Masnavi)" },
"Divine Friendship": { "quote": "Be with those who help your being. (Fihi Ma Fihi)" },
"Spiritual Transformation": { "quote": "Set your life on fire. Seek those who fan your flames. (Diwan-e Shams)" },
"Sacred Poetry": { "quote": "Words are a pretext. It is the inner bond that draws one person to another, not words. (Masnavi)" },
"Divine Reflection": { "quote": "Everything in the universe is within you. Ask all from yourself. (Mathnawi)" },
"Mystical Path": { "quote": "What you are seeking is seeking you. (Fihi Ma Fihi)" },
"Heart Knowledge": { "quote": "Let the beauty of what you love be what you do. (Masnavi)" },
"Divine Intoxication": { "quote": "Either give me more wine or leave me alone. (Diwan-e Shams)" },
"Spiritual Practice": { "quote": "Everyone has been made for some particular work, and the desire for that work has been put in every heart. (Fihi Ma Fihi)" },
"Love's Wisdom": { "quote": "Love is the bridge between you and everything. (Mathnawi)" },
"Inner Journey": { "quote": "Travel brings power and love back into your life. (Masnavi)" },
"Divine Mystery": { "quote": "Sell your cleverness and buy bewilderment. (Diwan-e Shams)" },
"Soul Connection": { "quote": "The garden of the world has no limits, except in your mind. (Mathnawi)" },
"Spiritual Love": { "quote": "This is love: to fly toward a secret sky, to cause a hundred veils to fall each moment. (Fihi Ma Fihi)" },
"Divine Wisdom": { "quote": "Stop acting so small. You are the universe in ecstatic motion. (Masnavi)" },
"Mystical Vision": { "quote": "Close your eyes, fall in love, stay there. (Diwan-e Shams)" },
"Heart's Journey": { "quote": "Let yourself be silently drawn by the strange pull of what you really love. (Mathnawi)" }
}
