{
    "Names of Jesus": {
        "quote": "\"And his name shall be called Wonderful Counselor, Mighty God, Everlasting Father, Prince of Peace.\" (Isaiah 9:6)"
    },
    "Divine Titles": {
        "quote": "\"I am the Alpha and the Omega, the First and the Last, the Beginning and the End.\" (Revelation 22:13)"
    },
    "Human Identity": {
        "quote": "\"And the Word became flesh and dwelt among us.\" (John 1:14)"
    },
    "Divine Sonship": {
        "quote": "\"This is my beloved Son, with whom I am well pleased.\" (Matthew 3:17)"
    },
    "Messianic Role": {
        "quote": "\"You are the Christ, the Son of the living God.\" (Matthew 16:16)"
    },
    "Salvific Mission": {
        "quote": "\"For God so loved the world that he gave his only Son.\" (John 3:16)"
    },
    "Teaching Authority": {
        "quote": "\"Never has anyone spoken like this!\" (John 7:46)"
    },
    "Healing Ministry": {
        "quote": "\"He went about doing good and healing all who were oppressed.\" (Acts 10:38)"
    },
    "Divine Nature": {
        "quote": "\"I and the Father are one.\" (John 10:30)"
    },
    "Human Nature": {
        "quote": "\"For we do not have a high priest who is unable to sympathize with our weaknesses.\" (Hebrews 4:15)"
    },
    "Sacrificial Role": {
        "quote": "\"Behold, the Lamb of God, who takes away the sin of the world!\" (John 1:29)"
    },
    "Resurrection Power": {
        "quote": "\"I am the resurrection and the life.\" (John 11:25)"
    },
    "Spiritual Authority": {
        "quote": "\"All authority in heaven and on earth has been given to me.\" (Matthew 28:18)"
    },
    "Mediatorial Role": {
        "quote": "\"For there is one God, and there is one mediator between God and men.\" (1 Timothy 2:5)"
    },
    "Divine Wisdom": {
        "quote": "\"Christ, in whom are hidden all the treasures of wisdom and knowledge.\" (Colossians 2:3)"
    },
    "Pastoral Identity": {
        "quote": "\"I am the good shepherd. The good shepherd lays down his life for the sheep.\" (John 10:11)"
    },
    "Prophetic Office": {
        "quote": "\"This is Jesus, the prophet from Nazareth of Galilee.\" (Matthew 21:11)"
    },
    "Priestly Function": {
        "quote": "\"You are a priest forever, after the order of Melchizedek.\" (Hebrews 7:17)"
    },
    "Kingly Authority": {
        "quote": "\"King of kings and Lord of lords.\" (Revelation 19:16)"
    },
    "Divine Light": {
        "quote": "\"I am the light of the world.\" (John 8:12)"
    },
    "Living Word": {
        "quote": "\"In the beginning was the Word, and the Word was with God, and the Word was God.\" (John 1:1)"
    },
    "Divine Presence": {
        "quote": "\"And behold, I am with you always, to the end of the age.\" (Matthew 28:20)"
    },
    "Redemptive Work": {
        "quote": "\"Christ redeemed us from the curse of the law.\" (Galatians 3:13)"
    },
    "Universal Judge": {
        "quote": "\"He has fixed a day on which he will judge the world in righteousness.\" (Acts 17:31)"
    },
    "Second Coming": {
        "quote": "\"This Jesus...will come in the same way as you saw him go into heaven.\" (Acts 1:11)"
    },
    "Cosmic Role": {
        "quote": "\"All things were created through him and for him.\" (Colossians 1:16)"
    },
    "Divine Love": {
        "quote": "\"Greater love has no one than this, that someone lay down his life for his friends.\" (John 15:13)"
    },
    "Eternal Existence": {
        "quote": "\"Before Abraham was, I am.\" (John 8:58)"
    },
    "Divine Victory": {
        "quote": "\"Death is swallowed up in victory.\" (1 Corinthians 15:54)"
    },
    "Spiritual Bread": {
        "quote": "\"I am the bread of life.\" (John 6:35)"
    }
}
