{
"Jnana Yoga": {
"short_description": "The yoga of knowledge and wisdom, focused on direct realization of ultimate truth through discrimination, analysis, and meditation on the nature of existence and consciousness."
},
"Viveka": {
"short_description": "The fundamental practice of discrimination between the real and unreal, eternal and temporary, Self and non-Self, leading to clear understanding of ultimate truth and liberation."
},
"Vairagya": {
"short_description": "Dispassion and detachment from all temporary phenomena, arising from clear discrimination and enabling steady focus on eternal truth without distraction by passing experiences."
},
"Atman": {
"short_description": "The eternal Self or pure consciousness that is one's true nature, identical with Brahman and discovered to be the unchanging witness of all experience and existence."
},
"Brahman": {
"short_description": "The absolute reality or ultimate truth that is the source and substance of all existence, discovered through elimination of all that is temporary and conditioned."
},
"Maya": {
"short_description": "The cosmic power of illusion that creates the appearance of multiplicity and separation, understood through analysis to be neither real nor unreal but indescribable."
},
"Adhyasa": {
"short_description": "The fundamental error of superimposition where the attributes of one thing are mistakenly projected onto another, particularly confusing the Self with the non-Self."
},
"Avidya": {
"short_description": "Primordial ignorance that causes misidentification with body, mind, and experiences, creating the illusion of limitation and suffering to be removed through knowledge."
},
"Neti Neti": {
"short_description": "The analytical method of 'not this, not this,' systematically negating all that is not the eternal Self to reveal what remains as ultimate truth."
},
"Sakshi": {
"short_description": "The witness consciousness that observes all experiences while remaining unchanged, recognized as one's true nature beyond all modifications of mind."
},
"Drg Drsya Viveka": {
"short_description": "The discrimination between the seer and the seen, leading to recognition of oneself as the unchanging witness rather than any object of experience."
},
"Mahavakyas": {
"short_description": "The great statements from the Upanishads that directly indicate the truth of one's identity with Brahman, used for deep contemplation and realization."
},
"Sravana": {
"short_description": "Hearing or studying the truth from authentic sources and qualified teachers, representing the first stage of Vedantic practice."
},
"Manana": {
"short_description": "Deep reflection and reasoning on the teachings heard, removing all doubts and establishing firm intellectual conviction in the truth."
},
"Nididhyasana": {
"short_description": "Profound and continuous meditation on the truth understood, leading to direct realization and establishment in one's true nature."
},
"Aparoksha Anubhuti": {
"short_description": "Direct, immediate experience of truth beyond mental conception, representing the goal of all Jnana Yoga practice and study."
},
"Prakriti": {
"short_description": "The manifest universe of name and form, analyzed to reveal its dependent and temporary nature in contrast to unchanging consciousness."
},
"Purusha": {
"short_description": "Pure consciousness distinct from all manifestation, discovered to be one's true identity through careful analysis and meditation."
},
"Karma": {
"short_description": "The law of cause and effect understood in its ultimate sense as binding only the apparent individual, while the true Self remains ever free."
},
"Moksha": {
"short_description": "Liberation through knowledge, realized as one's eternal nature rather than a state to be achieved, discovered through removal of ignorance."
},
"Samadhi": {
"short_description": "The state of complete absorption in truth, where knower, knowing, and known merge in direct realization of non-dual reality."
},
"Jivan Mukti": {
"short_description": "Liberation while living, where one maintains full functioning in the world while established in the knowledge of one's true nature."
},
"Ajata Vada": {
"short_description": "The highest philosophical position that no creation ever happened, pointing to the absolute non-dual nature of reality beyond all appearance."
},
"Sat Chit Ananda": {
"short_description": "The nature of ultimate reality as existence-consciousness-bliss, discovered to be one's own true nature beyond all limitations."
},
"Upadhi": {
"short_description": "The limiting adjuncts that create the appearance of division and limitation in the one consciousness, analyzed to reveal their temporary nature."
}
}
