{
"Game Feel": { "quote": "The tactile sensation of controlling virtual objects. Super Mario's precise jump arcs and momentum create satisfying movement." },
"Animation Principles": { "quote": "Using squash, stretch, anticipation, and follow-through to create visual impact. Overwatch's character animations telegraph abilities while adding personality." },
"Particle Effects": { "quote": "Visual elements that enhance actions and events. Diablo III's explosive enemy deaths shower particles and loot for satisfying combat feedback." },
"Screen Shake": { "quote": "Brief camera movements that emphasize impact. Vlambeer's Nuclear Throne uses screen shake to make weapons feel powerful and impactful." },
"Sound Design": { "quote": "Audio feedback that reinforces player actions. The distinctive coin sound in Super Mario Bros. provides immediate satisfaction for collection." },
"Hitstop": { "quote": "Momentary game pause on impact to emphasize powerful actions. Fighting games like Street Fighter freeze frames briefly when landing significant hits." },
"Visual Feedback": { "quote": "Immediate visual responses to player input. Plants vs. Zombies uses animated highlights, pop-up numbers, and visual effects for every interaction." },
"Controller Rumble": { "quote": "Haptic feedback that reinforces in-game actions. God of War uses varied rumble patterns to differentiate between axe hits, blocks, and throws." },
"Contextual Animations": { "quote": "Different visual responses based on the game state. Cuphead's varied death animations make even failure entertaining and expressive." },
"Anticipation": { "quote": "Wind-up before an action to create expectation. Punch-Out!! telegraphs upcoming attacks through exaggerated wind-ups and visual cues." },
"Follow-through": { "quote": "Continuation of motion after the main action. The Legend of Zelda: Breath of the Wild's weapon swings have substantial follow-through based on weight." },
"Overlapping Actions": { "quote": "Secondary motions that enhance primary ones. Hollow Knight's cape movement and particle trails create fluid, expressive movement." },
"Variable Timing": { "quote": "Rhythmic pacing of feedback to create interest. Ori and the Blind Forest varies animation speeds to create a sense of weight and momentum." },
"Exaggeration": { "quote": "Amplifying effects beyond realism for impact. Hearthstone's oversized card animations and effects create dramatic moments for simple actions." },
"Layered Feedback": { "quote": "Combining multiple feedback types for richer response. Killing enemies in Doom (2016) simultaneously triggers sound effects, animations, particles, and color changes." },
"Visual Effects": { "quote": "Stylized graphical elements that enhance actions. Hades uses distinctive VFX for each weapon and boon to create varied combat feedback." },
"Slow Motion": { "quote": "Temporarily reducing game speed to emphasize important moments. Max Payne's bullet-time highlights successful precision shooting." },
"Dynamic Cameras": { "quote": "Camera adjustments that react to gameplay. God of War zooms in for finishing moves to emphasize brutal takedowns." },
"Reactive Environments": { "quote": "World elements that respond to player actions. Destructible objects in Control react with physical simulations when powers are used." },
"Progressive Reveals": { "quote": "Gradually showing information or rewards for anticipation. Opening loot boxes in Overwatch uses a prolonged animation sequence to build excitement." },
"Timing Windows": { "quote": "Rewarding precise player timing with enhanced feedback. Perfect reloads in Gears of War are accompanied by distinct sounds and visual cues." },
"Sound Layering": { "quote": "Multiple audio elements combined for richer feedback. The Legend of Zelda uses layered sounds for discovering secrets: the signal sound, music sting, and chest opening sequence." },
"Rhythmic Feedback": { "quote": "Timing responses to create satisfying patterns. Guitar Hero's note hits create a rhythmic audiovisual experience that enhances the music." },
"Color Changes": { "quote": "Using color shifts to signify state changes. Enemies in The Last of Us Part II flash white when taking damage to clearly communicate hits." },
"Micro-Interactions": { "quote": "Small details that add polish to moment-to-moment gameplay. The hover states and button depressions in Persona 5's menus make navigation itself pleasurable." },
"Spatial Audio": { "quote": "Directional sound that enhances immersion and feedback. Hellblade: Senua's Sacrifice uses binaural audio to position voices around the player." },
"Input Buffering": { "quote": "Allowing commands to be entered slightly early but still register. Fighting games use input buffering to make combos feel more responsive." },
"Anticipatory Feedback": { "quote": "Indicating potential actions before execution. Ghost of Tsushima shows visual patterns before sword strikes to telegraph coming moves." },
"Post-Processing Effects": { "quote": "Image modifications that emphasize gameplay moments. DOOM's glory kills trigger color saturation and contrast changes for emphasis." },
"Celebration States": { "quote": "Extended feedback for significant achievements. Nintendo games often feature elaborate animations, music, and particle effects for major milestone completions." }
}
