{
"Karma Yoga": {
"short_description": "The spiritual path of selfless action and service, where enlightenment is pursued through performing duties and actions without attachment to their fruits, while maintaining constant awareness of the divine."
},
"Nishkama Karma": {
"short_description": "The practice of desireless action, performing all work without personal attachment to outcomes, acting from pure duty and divine inspiration rather than ego-driven desire or aversion."
},
"Seva": {
"short_description": "Selfless service performed as worship, seeing the divine in those served and offering all actions as sacred offerings, transforming ordinary work into spiritual practice through attitude and awareness."
},
"Dharma": {
"short_description": "Sacred duty or righteous living, understanding and fulfilling one's proper role and responsibilities in the cosmic order while maintaining spiritual awareness and ethical conduct."
},
"Yajna": {
"short_description": "The spirit of sacrifice that transforms all actions into sacred offerings, performing work as divine worship and seeing all activity as part of the cosmic sacrifice."
},
"Samatva": {
"short_description": "The state of perfect equanimity in action, maintaining balance and detachment through success and failure, pleasure and pain, while continuing to act with full dedication."
},
"Buddhi Yoga": {
"short_description": "The yoga of discriminative intelligence, using clear awareness to determine right action and maintain spiritual perspective while engaged in worldly activities."
},
"Kartavya": {
"short_description": "Actions that must be performed as a matter of duty, recognized and executed with full awareness regardless of personal preference or outcome."
},
"Tyaga": {
"short_description": "The spirit of renunciation, particularly of the fruits of action, while maintaining full engagement in necessary work and service."
},
"Lokasangraha": {
"short_description": "Action for the welfare of the world, performing duties with awareness of their impact on the greater good and evolution of society."
},
"Sattvic Action": {
"short_description": "Work performed with purity of mind, balanced effort, and spiritual awareness, free from excessive passion or inertia while maintaining harmony with natural law."
},
"Naishkarmya": {
"short_description": "The state of actionlessness within action, where the ego is not identified as the doer while full activity continues through divine inspiration."
},
"Yoga-Stha": {
"short_description": "Being established in yoga while performing actions, maintaining constant spiritual awareness and connection with divine consciousness during all activities."
},
"Karmaphala": {
"short_description": "The fruits or consequences of action that must be renounced while maintaining full engagement in the action itself, understanding their binding nature."
},
"Svadharma": {
"short_description": "One's own personal duty based on nature, capacity, and position in life, to be performed with full dedication as spiritual practice."
},
"Karma Bandha": {
"short_description": "The bondage created by attachment to actions and their results, which must be transcended through proper understanding and attitude in work."
},
"Karma Mukti": {
"short_description": "Liberation through action, achieved by performing all duties with spiritual awareness and complete detachment from personal outcomes."
},
"Yajnartha": {
"short_description": "Action performed for the sake of the cosmic sacrifice, seeing all work as part of divine operation and offering it to the supreme."
},
"Buddhiyoga": {
"short_description": "The practice of maintaining discriminative awareness while engaged in action, using intelligence to remain unattached while fully effective."
},
"Samatvam": {
"short_description": "Perfect equilibrium maintained in all situations, seeing success and failure, gain and loss with equal vision while continuing prescribed duties."
},
"Nimitta Matra": {
"short_description": "Being merely an instrument of divine will, performing actions without ego-sense while allowing higher power to work through oneself."
},
"Karma Sannyasa": {
"short_description": "Renunciation of attachment to action while continuing to perform necessary duties, internal surrender while maintaining external activity."
},
"Ishvara Arpana": {
"short_description": "Offering all actions to the divine, performing work as worship and seeing all results as sacred offerings rather than personal possessions."
},
"Prasada Buddhi": {
"short_description": "Accepting all results as divine grace, maintaining equanimity and gratitude regardless of outcomes while continuing dedicated service."
},
"Chitta Shuddhi": {
"short_description": "Purification of mind through selfless action, using work as a means to transform consciousness and transcend ego-based motivation."
}
}
