{
"Entities": { "quote": "The nodes or objects in a knowledge graph representing real-world concepts, people, places, or things. (Google Knowledge Graph identifies 'Paris' as a city entity.)" },
"Relations": { "quote": "The labeled connections between entities that describe how they relate to each other. ('Nikola Tesla' 'invented' 'Tesla Coil')" },
"Triples": { "quote": "The atomic unit of information in a knowledge graph consisting of subject-predicate-object statements. ('Leonardo da Vinci' 'created' 'Mona Lisa')" },
"Ontology": { "quote": "The formal specification of concepts, properties, and relationships within a domain. (SNOMED CT provides a comprehensive medical terminology ontology.)" },
"Schema": { "quote": "The structural framework that defines the organization, attributes, and relationships of data. (Schema.org defines common entity types across the web.)" },
"Taxonomy": { "quote": "A hierarchical classification system organizing entities into categories and subcategories. (Biological taxonomy classifies organisms into kingdom, phylum, class, etc.)" },
"Semantic Networks": { "quote": "Graphical representations showing relationships between concepts as a network of nodes and links. (WordNet connects English words based on semantic relationships.)" },
"RDF": { "quote": "Resource Description Framework - a standard model for data interchange on the web using subject-predicate-object expressions. (DBpedia uses RDF to structure Wikipedia information.)" },
"SPARQL": { "quote": "The query language for retrieving and manipulating data stored in RDF format. (Wikidata can be queried using SPARQL to extract structured information.)" },
"Inference": { "quote": "The process of deriving new information from existing knowledge using logical rules. (If 'Paris' 'isCapitalOf' 'France' and 'France' 'isPartOf' 'Europe', then 'Paris' 'isIn' 'Europe'.)" },
"Entity Resolution": { "quote": "The process of identifying when different references actually point to the same real-world entity. (Recognizing that 'NYC', 'New York', and 'The Big Apple' refer to the same city.)" },
"Knowledge Extraction": { "quote": "The process of automatically deriving structured information from unstructured text. (IBM Watson extracts medical knowledge from journal articles.)" },
"Linked Data": { "quote": "A method of publishing structured data so it can be interlinked with other data to become more useful. (The Linked Open Data cloud connects datasets across domains.)" },
"Named Entity Recognition": { "quote": "The task of identifying and categorizing entities in text. (Identifying 'Apple' as a company versus a fruit based on context.)" },
"Knowledge Fusion": { "quote": "Combining information from multiple sources to create a more comprehensive knowledge graph. (Google Knowledge Vault fuses web content with existing knowledge bases.)" },
"Property Graphs": { "quote": "A graph model where relationships (edges) can have their own properties and metadata. (Neo4j uses property graphs to add context to relationships.)" },
"Class Hierarchy": { "quote": "The arrangement of entities into a parent-child structure based on type or category. ('Mammal' is a superclass of 'Dog', which is a superclass of 'Labrador'.)" },
"Graph Algorithms": { "quote": "Mathematical procedures performed on graphs for analysis and insights. (PageRank calculates the importance of nodes in a knowledge graph.)" },
"Semantic Web": { "quote": "An extension of the web with standards for data sharing and reuse across applications. (W3C standards enable machines to interpret web data.)" },
"Knowledge Representation": { "quote": "Formal encoding of information to make it machine-processable. (Description Logics formalize knowledge about concepts and their relationships.)" },
"Entity Linking": { "quote": "Connecting mentions of entities in text to their corresponding entries in a knowledge base. (Linking the name 'Einstein' in text to his entity in a scientific knowledge graph.)" },
"Fact Extraction": { "quote": "Identifying factual assertions from unstructured text for knowledge graph construction. (Extracting 'Mount Everest is 8,848 meters tall' from a geography article.)" },
"Schema Mapping": { "quote": "Defining correspondences between elements in different data schemas. (Aligning a company database with a standard industry ontology.)" },
"Graph Embedding": { "quote": "Representing nodes and edges in a knowledge graph as vectors in a continuous vector space. (TransE encodes relationships as translations in embedding space.)" },
"Reasoning Systems": { "quote": "Software that derives conclusions from available knowledge using inference rules. (Cyc uses its knowledge base to make logical deductions.)" },
"Knowledge Base Completion": { "quote": "The task of filling in missing facts in a knowledge graph. (Predicting new drug interactions based on existing pharmaceutical knowledge.)" },
"Semantic Enrichment": { "quote": "Adding context and meaning to data by linking it to concepts in a knowledge graph. (Tagging news articles with relevant entities and relationships.)" },
"Graph Visualization": { "quote": "Techniques for displaying complex networks of entities and relationships. (Visual graph exploration tools show connections between research papers.)" },
"Ontology Alignment": { "quote": "The process of establishing correspondences between concepts in different ontologies. (Mapping medical terms between SNOMED CT and ICD-10 coding systems.)" },
"Knowledge Curation": { "quote": "The human-guided process of maintaining and improving knowledge graph quality. (Wikidata editors review and refine entity properties.)" }
}
