{
  "Krishna's Names": { "quote": "I worship Govinda, the primeval Lord, who is adept in playing on His flute, with blooming eyes like lotus petals, with head decked with peacock's feather. (Brahma Samhita 5.30)" },
  "Krishna's Titles": { "quote": "You are the Supreme Personality of Godhead, the ultimate abode, the purest, the Absolute Truth. (Bhagavad Gita 10.12)" },
  "Krishna's Identity": { "quote": "I am the Supersoul seated in the hearts of all living entities. (Bhagavad Gita 10.20)" },
  "Krishna's Teachings": { "quote": "Abandon all varieties of religion and just surrender unto Me. I shall deliver you from all sinful reactions. Do not fear. (Bhagavad Gita 18.66)" },
  "Krishna's Attributes": { "quote": "I am the source of all spiritual and material worlds. Everything emanates from Me. (Bhagavad Gita 10.8)" },
  "Krishna's Powers": { "quote": "By Me, in My unmanifested form, this entire universe is pervaded. (Bhagavad Gita 9.4)" },
  "Krishna's Leelas": { "quote": "The Supreme Lord, Krishna, lifted Govardhan Hill with one hand, just as a child picks up a mushroom. (Bhagavata Purana 10.25.19)" },
  "Krishna's Forms": { "quote": "Arjuna saw in that universal form unlimited mouths, unlimited eyes, unlimited wonderful visions. (Bhagavad Gita 11.10)" },
  "Krishna's Devotees": { "quote": "The gopis, overwhelmed with love for Krishna, danced with Him in the rasa lila. (Bhagavata Purana 10.33)" },
  "Krishna's Symbols": { "quote": "Lord Krishna, wearing a peacock-feather ornament and yellow garments, exhibited His transcendental form. (Bhagavata Purana 10.21.5)" },
  "Krishna's Philosophy": { "quote": "Engage your mind always in thinking of Me, become My devotee, offer obeisances to Me and worship Me. (Bhagavad Gita 9.34)" },
  "Krishna's Worship": { "quote": "If one offers Me with love and devotion a leaf, a flower, fruit or water, I will accept it. (Bhagavad Gita 9.26)" },
  "Krishna's Manifestation": { "quote": "Whenever there is a decline in righteousness, O Arjuna, and a predominant rise of unrighteousness, at that time I manifest Myself. (Bhagavad Gita 4.7)" },
  "Krishna's Relationship": { "quote": "I envy no one, nor am I partial to anyone. I am equal to all. But whoever renders service unto Me in devotion is a friend, is in Me, and I am also a friend to him. (Bhagavad Gita 9.29)" },
  "Names of Krishna": { "quote": "Krishna has thousands of names - Govinda, Gopala, Madhava, Keshava, Hari, each revealing an aspect of His divine nature. (Vishnu Sahasranama)" },
"Divine Identity": { "quote": "I am the source of all spiritual and material worlds. Everything emanates from Me. (Bhagavad Gita 10:8)" },
"Divine Form": { "quote": "I showed you My supreme form of four arms, holding conch, disc, mace and lotus. (Bhagavad Gita 11:46)" },
"Divine Incarnation": { "quote": "Although I am unborn and My transcendental body never deteriorates, I still appear in every millennium. (Bhagavad Gita 4:6)" },
"Divine Play": { "quote": "The entire cosmos is My divine play (lila), yet I remain untouched by its actions. (Bhagavad Gita 9:9)" },
"Divine Love": { "quote": "Those who worship Me with love dwell in Me, and I dwell in them. (Bhagavad Gita 9:29)" },
"Divine Wisdom": { "quote": "I give the understanding by which they can come to Me. (Bhagavad Gita 10:10)" },
"Divine Grace": { "quote": "Fix your mind upon Me, become My devotee, worship Me, offer your homage unto Me, and you shall certainly come to Me. (Bhagavad Gita 18:65)" },
"Divine Protection": { "quote": "Declare it boldly, O Arjuna, My devotee never perishes. (Bhagavad Gita 9:31)" },
"Divine Presence": { "quote": "I am seated in everyone's heart, and from Me come remembrance, knowledge and forgetfulness. (Bhagavad Gita 15:15)" },
"Divine Power": { "quote": "Of all that is powerful, I am the power devoid of desire and attachment. (Bhagavad Gita 7:11)" },
"Divine Time": { "quote": "I am time, the destroyer of all worlds. (Bhagavad Gita 11:32)" },
"Divine Beauty": { "quote": "His beauty steals the heart of millions of Cupids. (Brahma Samhita 5.30)" },
"Divine Relationships": { "quote": "I am the friend of every living being. (Bhagavad Gita 5:29)" },
"Divine Activities": { "quote": "Although I have nothing to gain and am self-sufficient, I engage in prescribed duties to set an example. (Bhagavad Gita 3:22)" },
"Divine Nature": { "quote": "Earth, water, fire, air, ether, mind, intelligence and false ego - all together these eight constitute My separated material energies. (Bhagavad Gita 7:4)" },
"Divine Qualities": { "quote": "Of all creations I am the beginning and the end and also the middle. (Bhagavad Gita 10:32)" },
"Divine Devotion": { "quote": "Always think of Me, become My devotee, worship Me and offer your homage unto Me. (Bhagavad Gita 18:65)" },
"Divine Manifestations": { "quote": "Whatever is glorious, beautiful and mighty, know that to be but a spark of My splendor. (Bhagavad Gita 10:41)" },
"Divine Leadership": { "quote": "To establish dharma, I appear millennium after millennium. (Bhagavad Gita 4:8)" },
"Divine Knowledge": { "quote": "To those who are constantly devoted to serving Me with love, I give the understanding by which they can come to Me. (Bhagavad Gita 10:10)" },
"Divine Pastimes": { "quote": "His transcendental pastimes in Vrindavan enchant all living entities. (Brahma Samhita 5.31)" },
"Divine Opulence": { "quote": "I pervade all universes by a single fragment of Myself. (Bhagavad Gita 10:42)" },
"Divine Sound": { "quote": "Among vibrations I am the transcendental syllable Om. (Bhagavad Gita 7:8)" },
"Divine Essence": { "quote": "The soul can never be cut to pieces by any weapon, nor burned by fire, nor moistened by water, nor withered by the wind. (Bhagavad Gita 2:23)" },
"Divine Justice": { "quote": "I am equally disposed to all living entities; there is none who is My enemy or friend. (Bhagavad Gita 9:29)" },
"Divine Path": { "quote": "After many births and deaths, one who is actually in knowledge surrenders unto Me, knowing Me to be the cause of all causes. (Bhagavad Gita 7:19)" },
"Divine Connection": { "quote": "I am the source of all spiritual and material worlds. Everything emanates from Me. (Bhagavad Gita 10:8)" },
"Divine Reality": { "quote": "I am the Supreme Brahman, the ultimate abode, the purest, the Absolute Truth. (Bhagavad Gita 10:12)" },
"Divine Universe": { "quote": "The entire cosmic manifestation is working under My direction. (Bhagavad Gita 9:10)" }
}
