{
    "Divine Word": { "quote": "\"In the beginning was the Word, and the Word was with God, and the Word was God.\" (John 1:1)" },
    "Cosmic Reason": { "quote": "\"The Logos is the rational principle governing the cosmos.\" (Heraclitus)" },
    "Universal Law": { "quote": "\"The Tao is the way of Heaven and Earth, and the master of all things.\" (Tao Te Ching 25)" },
    "Divine Wisdom": { "quote": "\"Wisdom was created before all things.\" (Ecclesiasticus 1:4)" },
    "Creative Speech": { "quote": "\"And God said, 'Let there be light,' and there was light.\" (Genesis 1:3)" },
    "Eternal Truth": { "quote": "\"Truth is one, paths are many.\" (Mahatma Gandhi)" },
    "Divine Intelligence": { "quote": "\"The divine Nous (Mind) orders all things.\" (Anaxagoras)" },
    "Sacred Sound": { "quote": "\"In the beginning was Prajapati (the Creator); with Him was the Word.\" (Prajapati Vac, Vedic tradition)" },
    "Divine Order": { "quote": "\"The Logos maintains the rational order of all things.\" (Stoic philosophy)" },
    "Creative Force": { "quote": "\"By the word of the Lord the heavens were made.\" (Psalm 33:6)" },
    "Universal Mind": { "quote": "\"The universal mind is the supreme architect.\" (Plato, Timaeus)" },
    "Divine Expression": { "quote": "\"Speech is the expression of divine thought.\" (Sanskrit tradition)" },
    "Cosmic Law": { "quote": "\"Rita (cosmic order) governs the universe.\" (Vedic tradition)" },
    "Divine Reason": { "quote": "\"Reason is divine and pervades all things.\" (Marcus Aurelius)" },
    "Primordial Sound": { "quote": "\"AUM is the primordial vibration from which all creation emerges.\" (Mandukya Upanishad)" },
    "Divine Pattern": { "quote": "\"The Logos is the pattern after which all things are made.\" (Philo of Alexandria)" },
    "Sacred Knowledge": { "quote": "\"Knowledge of the Logos brings wisdom.\" (Greek Philosophy)" },
    "Creative Principle": { "quote": "\"Through wisdom God founded the earth.\" (Proverbs 3:19)" },
    "Divine Understanding": { "quote": "\"Understanding is a wellspring of life.\" (Proverbs 16:22)" },
    "Eternal Word": { "quote": "\"Heaven and earth will pass away, but my words will not pass away.\" (Matthew 24:35)" },
    "Universal Truth": { "quote": "\"Truth is universal, though its expressions are many.\" (Sufi tradition)" },
    "Divine Communication": { "quote": "\"God speaks in various ways.\" (Job 33:14)" },
    "Cosmic Intelligence": { "quote": "\"The universe is governed by divine intelligence.\" (Aristotle)" },
    "Sacred Wisdom": { "quote": "\"Wisdom is radiant and unfading.\" (Wisdom of Solomon 6:12)" },
    "Divine Utterance": { "quote": "\"Let there be' - the creative word of God.\" (Genesis 1)" },
    "Universal Reason": { "quote": "\"Reason is the spark of divine light in all beings.\" (Stoic philosophy)" },
    "Creative Word": { "quote": "\"By the Word of God all things came to be.\" (Early Christian tradition)" },
    "Divine Logic": { "quote": "\"Divine logic orders the cosmos.\" (Neo-Platonic philosophy)" },
    "Eternal Principle": { "quote": "\"The Logos is the eternal principle of order.\" (Greek Philosophy)" },
    "Sacred Order": { "quote": "\"The divine order manifests through the Logos.\" (Hellenistic tradition)" }
}
