{
  "Bhuloka": {
    "short_description": "The physical plane of existence, where material bodies and objects reside, governed by the laws of physics and perceivable through the five senses."
  },
  "Bhuvarloka": {
    "short_description": "The intermediate realm between the physical and astral planes, where subtle energies and astral influences begin to manifest."
  },
  "Svarloka": {
    "short_description": "The celestial realm, where divine beings and higher consciousness reside, characterized by purity, light, and spiritual bliss."
  },
  "Maharloka": {
    "short_description": "The realm of higher mental and intellectual pursuits, where profound knowledge and wisdom are attained, and the mind is purified."
  },
  "Janarloka": {
    "short_description": "The realm of the mind and intellect, where thoughts, ideas, and mental constructs are formed and analyzed, influencing the physical and astral realms."
  },
  "Tapoloka": {
    "short_description": "The realm of asceticism and spiritual discipline, where intense meditation and austerities are practiced to achieve higher states of consciousness."
  },
  "Satyaloka": {
    "short_description": "The realm of absolute truth and reality, where the individual self merges with the universal self, experiencing pure consciousness and enlightenment."
  },
  "Brahma Loka": {
    "short_description": "The realm of the creator, where the divine will and creative power manifest, governing the creation and dissolution of the universe."
  },
  "Patalaloka": {
    "short_description": "The subterranean realm, where lower energies and negative influences reside, often associated with the underworld and shadow aspects of existence."
  },
  "Naraka Loka": {
    "short_description": "The realm of suffering and punishment, where karmic debts are paid and lessons are learned through challenging experiences."
  },
  "Preta Loka": {
    "short_description": "The realm of the hungry ghosts, where beings experience intense cravings and attachments, often due to unfulfilled desires and attachments from past lives."
  },
  "Tiryaloka": {
    "short_description": "The realm of the intermediate states, where beings transition between different planes of existence, experiencing liminal and transitional experiences."
  },
  "Astral Loka": {
    "short_description": "The realm of emotions, desires, and mental images, where the astral body resides and interacts with the physical world through dreams and out-of-body experiences."
  },
  "Mental Loka": {
    "short_description": "The realm of thoughts, ideas, and intellectual pursuits, where the mind creates, analyzes, and understands concepts and abstract ideas."
  },
  "Causal Loka": {
    "short_description": "The realm of cause and effect, where the underlying patterns and principles of existence are understood, and the roots of physical and astral phenomena are revealed."
  },
  "Buddhic Loka": {
    "short_description": "The realm of pure love and compassion, where the soul experiences unity and oneness with all beings, transcending individuality and ego."
  },
  "Atmic Loka": {
    "short_description": "The realm of pure will and divine purpose, where the individual will aligns with the universal will, and the soul's true purpose is realized."
  },
  "Monadic Loka": {
    "short_description": "The highest realm of individual existence, where the monad, or spiritual essence, resides and experiences unity with the divine source."
  },
  "Adi Loka": {
    "short_description": "The realm of pure consciousness, where the individual self merges with the universal self, experiencing absolute unity and transcendence."
  },
  "Anupadaka Loka": {
    "short_description": "The realm of unconditioned existence, where the soul experiences pure being, free from the limitations of form and time."
  },
  "Nirvana Loka": {
    "short_description": "The ultimate realm of enlightenment and liberation, where the individual self is dissolved into the universal self, achieving eternal peace and bliss."
  },
  "Kama Loka": {
    "short_description": "The realm of desire and sensual pleasure, where the astral body experiences emotions, passions, and attachments."
  },
  "Manas Loka": {
    "short_description": "The realm of the mind, where thoughts, ideas, and intellectual pursuits are formed and analyzed, influencing the physical and astral realms."
  },
  "Buddhi Loka": {
    "short_description": "The realm of higher mind and intuition, where the soul experiences pure love, compassion, and wisdom, transcending the limitations of the lower mind."
  },
  "Atma Loka": {
    "short_description": "The realm of the soul, where the individual self experiences unity with the divine will, realizing its true purpose and potential."
  },
  "Monadic Loka": {
    "short_description": "The realm of the monad, where the spiritual essence resides and experiences unity with the divine source."
  },
  "Adi Loka": {
    "short_description": "The realm of pure consciousness, where the individual self merges with the universal self, experiencing absolute unity and transcendence."
  },
  "Anupadaka Loka": {
    "short_description": "The realm of unconditioned existence, where the soul experiences pure being, free from the limitations of form and time."
  },
  "Nirvana Loka": {
    "short_description": "The ultimate realm of enlightenment and liberation, where the individual self is dissolved into the universal self, achieving eternal peace and bliss."
  },
  "Kama Manas Loka": {
    "short_description": "The combined realm of desire and mind, where emotions, thoughts, and intellectual pursuits interact and influence each other."
  },
  "Buddhi Atma Loka": {
    "short_description": "The combined realm of higher mind and soul, where pure love, compassion, and wisdom are experienced in unity with the divine will."
  },
  "Monadic Atma Loka": {
    "short_description": "The combined realm of the monad and soul, where the spiritual essence and individual self experience unity with the divine source."
  },
  "Adi Monad Loka": {
    "short_description": "The combined realm of pure consciousness and the monad, where the individual self merges with the universal self and the divine source."
  },
  "Anupadaka Adi Loka": {
    "short_description": "The combined realm of unconditioned existence and pure consciousness, where the soul experiences pure being and absolute unity."
  },
  "Nirvana Anupadaka Loka": {
    "short_description": "The ultimate combined realm of enlightenment and unconditioned existence, where the individual self is dissolved into the universal self, achieving eternal peace and bliss."
  }
}
