{
"Hard Magic": { "quote": "Well-defined rules, costs, and limitations that function almost scientifically. Brandon Sanderson's Allomancy in Mistborn, where ingesting and 'burning' specific metals grants precise powers." },
"Soft Magic": { "quote": "Mysterious, undefined magic with flexible rules that maintains a sense of wonder. J.R.R. Tolkien's Lord of the Rings, where magic is rare and mysterious, with unclear boundaries and capabilities." },
"Elemental Magic": { "quote": "Manipulation of natural elements like fire, water, earth, and air. Avatar: The Last Airbender's bending arts, where practitioners manipulate elements through martial arts movements." },
"Ritual Magic": { "quote": "Spells cast through specific ceremonies, ingredients, and processes. The witchcraft in The Witch, requiring specific components, timing, and incantations to produce effects." },
"Divine Magic": { "quote": "Power granted by deities or higher beings. Dungeons & Dragons clerics channel divine power from gods, requiring faith and adherence to a deity's principles." },
"Blood Magic": { "quote": "Using blood as a power source or component for spells. Dragon Age's blood magic, where practitioners use their own or others' life force to fuel powerful but taboo spells." },
"Wild Magic": { "quote": "Unpredictable, chaotic magical effects that can't be fully controlled. Discworld's raw magic that warps reality in unexpected ways when concentrated." },
"Runic Magic": { "quote": "Power derived from symbols, inscriptions, or written language. The Elder Scrolls' enchanting system, where runes store magical effects that can be applied to items." },
"Alchemy": { "quote": "Transformation of matter and creation of magical substances. Fullmetal Alchemist's transmutation circles that enable equivalent exchange of matter." },
"Necromancy": { "quote": "Magic involving death, spirits, and reanimation. Diablo's Necromancers who commune with, raise, and command the dead through specialized rituals." },
"Sympathetic Magic": { "quote": "Magic based on connections between similar objects. The voodoo doll concept: what happens to the doll happens to the person it represents." },
"Innate Magic": { "quote": "Magical abilities that are inherent to certain individuals from birth. X-Men's mutant powers, which manifest naturally rather than being learned or acquired." },
"Artifice Magic": { "quote": "Creation of magical items and constructs. Eberlin's artificers in D&D, who infuse ordinary objects with magical properties through specialized crafting." },
"Mind Magic": { "quote": "Telepathy, telekinesis, and mental manipulation. The Force in Star Wars, particularly abilities like mind tricks and telekinesis." },
"Nature Magic": { "quote": "Harnessing the power of plants, animals, and natural forces. Druids in World of Warcraft who shapeshift and command nature's power." },
"Shadow Magic": { "quote": "Manipulation of darkness and shadow realms. The Shadowbinders in A Song of Ice and Fire who work with shadows and darkness." },
"Numerology": { "quote": "Magic based on mathematical principles and numbers. Numeromancy in The Chronicles of Amber, where mathematical calculations alter probability." },
"Illusion Magic": { "quote": "Creating false sensory experiences and deceptions. Genjutsu in Naruto, creating elaborate illusions that trap victims in false realities." },
"Summoning": { "quote": "Calling forth creatures or entities from other realms. Final Fantasy's summoners who call powerful beings like Ifrit or Shiva to aid them." },
"Enchantment": { "quote": "Imbuing objects or beings with magical properties. Harry Potter's Charms class, teaching spells that add properties to objects or creatures." },
"Chronomancy": { "quote": "Manipulation of time. Doctor Strange's Time Stone abilities, allowing him to reverse, accelerate, or loop time." },
"Naming Magic": { "quote": "Power gained through knowing the true names of things. Patrick Rothfuss's Kingkiller Chronicle, where knowing a thing's true name grants power over it." },
"Technomancy": { "quote": "Fusion of technology and magic. Shadowrun's deckers who navigate magical cyberspace with technomantic abilities." },
"Chaos Magic": { "quote": "Unpredictable magic that breaks established magical laws. Wanda Maximoff/Scarlet Witch's reality-altering chaos magic in Marvel." },
"Soul Magic": { "quote": "Manipulation of the spiritual essence of beings. The Soulsborne games' soul-based currency and power systems." },
"Word Magic": { "quote": "Spells cast through specific words or phrases of power. Skyrim's Thu'um/Dragon Shouts, where specific word combinations produce magical effects." },
"Astral Magic": { "quote": "Projection and manipulation of consciousness beyond the physical. Doctor Strange's astral projection abilities in Marvel." },
"Music Magic": { "quote": "Spells and effects created through song and musical performance. The Bards in The Witcher who can influence emotions and events through magical performances." },
"Planar Magic": { "quote": "Manipulation of and travel between different planes of existence. Planeswalkers in Magic: The Gathering who can traverse different dimensional planes." },
"Life Magic": { "quote": "Control over life force, healing, and growth. The Life magic discipline in Guild Wars that focuses on healing and protection." }
}
