{
"Divine Nature": { "quote": "God's existence is identical with His attributes, and His knowledge is identical with His essence. (Guide for the Perplexed, I:68)" },
"Religious Law": { "quote": "The Torah speaks in the language of man, but its wisdom is Divine. (Guide for the Perplexed, I:26)" },
"Human Intellect": { "quote": "The perfection of man's intellect is what truly constitutes human perfection. (Guide for the Perplexed, III:54)" },
"Medical Practice": { "quote": "The physician should not treat the disease but the patient who is suffering from it. (Medical Aphorisms)" },
"Divine Providence": { "quote": "Divine Providence is connected with Divine intellectual influence. (Guide for the Perplexed, III:17)" },
"Prophecy": { "quote": "Prophecy is, in truth and reality, an emanation sent forth by God through the medium of the Active Intellect. (Guide for the Perplexed, II:36)" },
"Creation": { "quote": "The Universe, although created, is continuously maintained by the Creator. (Guide for the Perplexed, I:69)" },
"Free Will": { "quote": "Free will is granted to every man. If he desires to turn toward the good way and be righteous, he has the power to do so. (Mishneh Torah, Laws of Repentance 5:1)" },
"Ethics": { "quote": "Seek the mean in all things, and distance yourself from extremes. (Eight Chapters, Ch. 4)" },
"Knowledge": { "quote": "The knowledge of God is not a knowledge that is apart from His essence. (Guide for the Perplexed, III:20)" },
"Human Purpose": { "quote": "The ultimate purpose of man's existence is to comprehend God to the extent of one's capabilities. (Guide for the Perplexed, III:51)" },
"Evil": { "quote": "Evil is merely the absence of good, just as darkness is the absence of light. (Guide for the Perplexed, III:10)" },
"Torah Study": { "quote": "A person should divide his study time in three: one-third for Scripture, one-third for Mishnah, and one-third for Talmud. (Mishneh Torah, Laws of Torah Study 1:11)" },
"Divine Unity": { "quote": "God is One, not like the oneness of a pair, and not like the oneness of a species. (Mishneh Torah, Foundations of Torah 1:7)" },
"Scientific Method": { "quote": "Accept the truth from whatever source it comes. (Introduction to Eight Chapters)" },
"Medical Ethics": { "quote": "The first consideration should be to cause no harm. (Medical Aphorisms)" },
"Philosophical Method": { "quote": "You should consider the entire universe as a single individual. (Guide for the Perplexed, I:72)" },
"Religious Practice": { "quote": "One should not pray as if fulfilling an obligation, but rather as standing before the Divine Presence. (Mishneh Torah, Prayer 4:16)" },
"Divine Attributes": { "quote": "All attributes ascribed to God are attributes of His actions, not of His essence. (Guide for the Perplexed, I:52)" },
"Human Nature": { "quote": "Man's perfection is attained not through his relation to other men, but through his relation to God. (Guide for the Perplexed, III:51)" },
"Rationalism": { "quote": "The truth does not become more true by virtue of the fact that the entire world agrees with it. (Guide for the Perplexed, II:15)" },
"Education": { "quote": "Teach your tongue to say 'I do not know' and you will progress. (Commentary on the Mishnah)" },
"Jewish Law": { "quote": "The entire Torah was given to make people better and to establish a noble society. (Guide for the Perplexed, III:27)" },
"Health": { "quote": "The body's health and wellbeing are among the ways of God. (Mishneh Torah, Laws of Character 4:1)" },
"Political Theory": { "quote": "The welfare of the soul can only be achieved after that of the body has been secured. (Commentary on the Mishnah, Avot)" },
"Divine Command": { "quote": "Every commandment has a reason, though we may not know it. (Guide for the Perplexed, III:26)" },
"Metaphysics": { "quote": "The foundation of foundations and pillar of wisdom is to know that there is a Primary Being who brought all existence into being. (Mishneh Torah, Foundations of Torah 1:1)" },
"Logic": { "quote": "One should accept the truth from whatever source it comes, after establishing clear proofs. (Introduction to Eight Chapters)" },
"Social Ethics": { "quote": "Give a man a fish and you feed him for a day; teach him to fish and you feed him for a lifetime. (Attributed to Maimonides)" },
"Divine Law": { "quote": "The Law as a whole aims at two things: the welfare of the soul and the welfare of the body. (Guide for the Perplexed, III:27)" }
}
