{
  "The Absolute": {
    "quote": "Our fundamental cognition of the Absolute, our substantial spiritual experience of it is the intuition or the direct experience of an infinite and eternal Existence, an infinite and eternal Consciousness, an infinite and eternal Delight of Existence."
  },
  "The Adorable": {
    "quote": "\"Adorable, imperishable, unchanging, and without origin, it is said to be the highest goal of human understanding.\" - Bhagavad Gita 8.20"
  },
  "The All": {
    "quote": "All, even pain, was the soul's pleasure here; Here all experience was a single plan, The thousandfold expression of the One."
  },
  "The All-Beautiful": {
    "quote": "All-Beautiful in man, in nature, in life, in thought, in art; for God is Beauty and Delight hidden in the variation of his masks and forms. sa25"
  },
  "The All-Blissful": {
    "quote": "Because Thou art All-beauty and All-bliss, My soul blind and enamoured yearns for Thee;"
  },
  "The All-Knowing": {
    "quote": "God knows all that is, was, and will be. God is the Knower, the Known, and the Knowing itself. In God's omniscience, every detail of existence, every thought, every feeling, every action is held in divine awareness. God sees beyond the veils of time and space, encompassing the past, present, and future in a timeless unity."
  },
  "The All-Powerful": {
    "quote": "The All-Powerful is the Divine, the Supreme Truth, who wields the power of creation, preservation, and destruction in the cosmic play. This power manifests through the Divine Mother, the conscious Force that executes the divine Will. The All-Powerful is beyond all limitations, encompassing all forms and forces in the universe. Trust in the All-Powerful's divine plan and surrender to the guidance of the Divine Mother for true strength and fulfillment."
  },
  "The Beloved": { "quote": "\"I am my beloved's and my beloved is mine.\" (Song of Solomon 6:3)" },
  "The Boundless": {
    "quote": "\"For with God nothing shall be impossible.\" - Luke 1:37"
  },
  "Brahman": {
    "quote": "Brahman is the ultimate reality, the supreme, infinite, formless, and eternal essence of the universe. It is the source and essence of all existence, beyond all limitations, beyond time, space, and causality. Brahman is described as Sat-Chit-Ananda – Existence, Consciousness, Bliss. It is the unchanging reality that underlies and sustains all things, the One without a second. Brahman is both immanent in the world and transcendent beyond it, and it can be realized through spiritual practices and inner experience."
  },
  "Consciousness": {
    "quote": "The higher consciousness is that above the ordinary mind and different from it in its workings; it ranges from higher mind through illumined mind, intuition and overmind up to the border line of the supramental. loy3"
  },
  "The Divine": {
    "quote": "Never forget that you are not alone. The Divine is with you helping and guiding you. He is the companion who never fails, the friend whose love comforts and strengthens. The more you feel lonely, the more you are ready to perceive His luminous Presence. Have faith and He will do everything for you. ~ The Mother, Words Of The Mother II"
  },
  "The Ecstasy": {
    "quote": "\"And do not get drunk with wine, for that is debauchery, but be filled with the Spirit.\" - Ephesians 5:18"
  },
  "The Eternal": {
    "quote": "Parted the eternal lids that open heaven;"
  },
  "The Everpresent": {
    "quote": "\"Never the spirit was born; the spirit shall cease to be never; Never was time it was not; End and Beginning are dreams! Birthless and deathless and changeless remaineth the spirit forever; Death hath not touched it at all, dead though the house of it seems!\" - Bhagavad Gita, Chapter 2, Verse 20."
  },
  "Existence": {
    "quote": "\"In the beginning God created the heavens and the earth.\" - Genesis 1:1"
  },
  "Father": {
    "quote": "\"Honour thy father and thy mother: that thy days may be long upon the land which the Lord thy God giveth thee.\" - Exodus 20:12"
  },
  "The Form": {
    "quote": "He met the forms that divinise the sight, 2.9"
  },
  "The Friend": {
    "quote": "\"Faithful are the wounds of a friend; but the kisses of an enemy are deceitful.\" - Proverbs 27:6 (Bible)"
  },
  "God": {
    "quote": "God is everywhere and wherever God is, there is Light."
  },
  "The Gods": {
    "quote": "The gods are the manifold expressions of the one eternal truth. (Rig Veda 1.164.46)"
  },
  "The Guide": {
    "quote": "\"Set thy heart upon thy work, but never its reward.\" - Bhagavad Gita"
  },
  "The Immanent": {
    "quote": "The Divine indwells all, for the Self resides in every being. (Bhagavad Gita 10:20)"
  },
  "The Immutable": {
    "quote": "\"The Absolute, the Perfect, the Immune,\nOne who is in us as our secret self.\" - Savitri"
  },
  "The Infinite": {
    "quote": "The Infinite is the inexhaustible storehouse of forces. The individual is a battery, a storage cell which runs down after use. Consecration is the wire that connects the individual battery to the infinite reserve of forces."
  },
  "The Inviolable / Inviolate": {
    "quote": "The sacred remains untouched, for the Divine essence is inviolable. (Upanishads, Mundaka 3:1)"
  },
  "Ishwara": {
    "quote": "Ishwara: The Supreme Lord who pervades all creation, beyond form yet manifest in every heart. (Bhagavad Gita 18:66)"
  },
  "The King of Kings": {
    "quote": "The King of Kings, sovereign over all creation, rules with eternal justice. (Revelation 19:16)"
  },
  "The Light": {
    "quote": "To be full of light is the aim. ~ Sri Ramana Maharshi, Talks"
  },
  "The Mother": {
    "quote": "\"Honour thy father and thy mother: that thy days may be long upon the land which the Lord thy God giveth thee.\" - Exodus 20:12"
  },
  "The Peace": {
    "quote": "When the Peace is established, this higher or Divine Force from above can descend and work in us. TMWLOTM"
  },
  "The Pure": {
    "quote": "\"Blessed are the pure in heart, for they shall see God.\" - Matthew 5:8"
  },
  "Purusha": {
    "quote": "The Purusha, the cosmic man, whose essence pervades all existence. (Rig Veda 10.90)"
  },
  "The Real": {
    "quote": "Life is not entirely real until it opens into the sense of the infinite. ~ Sri Aurobindo, Essays on the Gita, The Lord of the Sacrifice"
  },
  "The Real-Idea": {
    "quote": "The Real-Idea is the eternal archetype, the unchanging truth behind the ever-changing forms. (Plotinus, Enneads 6.9)"
  },
  "The Right": {
    "quote": "\"I am the way and the truth and the life. No one comes to the Father except through me.\" - John 14:6"
  },
  "Sachchidananda": {
    "quote": "Sachchidananda: The embodiment of Existence, Consciousness, and Bliss. (Shankaracharya, Vivekachudamani)"
  },
  "The Self": {
    "quote": "The Self is the eternal essence that illuminates all, the Atman that is one with the Absolute. (Chandogya Upanishad 6.8.7)"
  },
  "Shakti": {
    "quote": "\"Whenever virtue weakens and wickedness grows strong, I manifest Myself. To establish righteousness and to destroy evil, to save the good I appear millennium after millennium.\" - Bhagavad Gita, Chapter 4, Verse 7"
  },
  "The Silence": {
    "quote": "Heavenly voices to us are a silence, those colours a whiteness. ~ Sri Aurobindo, Collected Poems, Ilion"
  },
  "Spirit": {
    "quote": "\"The Spirit of God has made me, and the breath of the Almighty gives me life.\" - Job 33:4"
  },
  "The Stillness": {
    "quote": "Where stillness listening felt the unspoken word \n And the hours forgot to pass towards grief and change."
  },
  "The Word": {
    "quote": "All world is expression or manifestation, creation by the Word. \n~ Sri Aurobindo, The Secret of the Veda, Brihaspati, Power of the Soul"
  },
  "The Vicar": {
    "quote": "The Vicar embodies the divine presence on earth, acting as the intermediary of celestial grace. (1 Peter 2:9)"
  }
}

