{
  "Framework": {
    "short_description": "The underlying structure of assumptions and relationships that shapes perception, interpretation, and interaction within a given system of understanding."
  },
  "Worldview": {
    "short_description": "The comprehensive lens of meaning through which reality is filtered, composed of cultural, philosophical, and experiential foundations."
  },
  "Model": {
    "short_description": "The conceptual representation that simplifies complexity while maintaining essential patterns, enabling prediction and navigation of phenomena."
  },
  "Lens": {
    "short_description": "The cognitive filter determining what becomes visible or remains obscured in perception, shaped by historical and cultural conditioning."
  },
  "Construct": {
    "short_description": "The artificial yet functional boundaries erected to make chaos comprehensible, constantly rebuilt through language and practice."
  },
  "Schema": {
    "short_description": "The mental architecture organizing incoming information into recognizable patterns, serving as the cognitive infrastructure for understanding."
  },
  "Heuristic": {
    "short_description": "The problem-solving shortcut embedded within paradigms, simultaneously enabling rapid judgment and constraining alternative approaches."
  },
  "Axiom": {
    "short_description": "The self-evident foundation stone requiring no proof, upon which larger structures of logic and belief are erected."
  },
  "Episteme": {
    "short_description": "The unconscious rules governing what can be known and expressed within an historical epoch, determining the possibilities of thought."
  },
  "Paradigm Shift": {
    "short_description": "The seismic transformation where existing frameworks collapse under anomaly weight, giving birth to fundamentally new cosmic understandings."
  },
  "Epistemology": {
    "short_description": "The study of knowledge boundaries within paradigms, mapping the permissible terrain between certainty and heresy."
  },
  "Ontology": {
    "short_description": "The foundational assumptions about existence itself that precede all theoretical development within a paradigm."
  },
  "Discourse": {
    "short_description": "The linguistic ecosystem that simultaneously reflects and constructs paradigmatic reality through sanctioned patterns of communication."
  },
  "Narrative": {
    "short_description": "The story-shaped container giving coherence to paradigm elements, weaving facts into meaningful causal tapestries."
  },
  "Metanarrative": {
    "short_description": "The grand explanatory story claiming universal validity, increasingly fragmented in postmodern paradigm landscapes."
  },
  "Paradigm Lock": {
    "short_description": "The cognitive inertia maintaining obsolete frameworks through institutional power and confirmation bias mechanisms."
  },
  "Paradigm Blindness": {
    "short_description": "The inherent limitation preventing recognition of phenomena outside existing categorical structures."
  },
  "Paradigm Plurality": {
    "short_description": "The coexistence of multiple frameworks within complex systems, creating both creative tension and cognitive dissonance."
  },
  "Paradigm Incommensurability": {
    "short_description": "The fundamental untranslatability between frameworks rooted in different axiomatic foundations."
  },
  "Paradigm Dependency": {
    "short_description": "The phenomenon where observations and even sensory experiences are mediated through existing conceptual structures."
  },
  "Paradigm Emergence": {
    "short_description": "The self-organizing process where new frameworks coalesce from the edge of chaos in intellectual ecosystems."
  },
  "Paradigm Dissolution": {
    "short_description": "The entropic decay of conceptual structures when maintaining coherence requires excessive exception accommodation."
  },
  "Paradigm Hegemony": {
    "short_description": "The dominance of particular frameworks through cultural, economic, and political reinforcement mechanisms."
  },
  "Paradigm Fluidity": {
    "short_description": "The postmodern condition of frameworks becoming increasingly provisional and context-dependent."
  },
  "Paradigm Matrix": {
    "short_description": "The interlocking network of concepts, practices, and institutions that sustain a worldview's operational reality."
  },
  "Paradigm Scaffolding": {
    "short_description": "The temporary support structures enabling paradigm construction, later obscured in finished intellectual edifices."
  },
  "Paradigm Horizon": {
    "short_description": "The shifting boundary between knowable and unthinkable that advances with framework evolution."
  },
  "Paradigm Resonance": {
    "short_description": "The harmonization between individual cognition and cultural frameworks that produces experience of objective reality."
  },
  "Paradigm Archetype": {
    "short_description": "The recurring structural patterns appearing across disparate frameworks, suggesting deep cognitive constants."
  },
  "Paradigm Permeability": {
    "short_description": "The degree to which frameworks allow incorporation of foreign elements without structural collapse."
  },
  "Paradigm Inertia": {
    "short_description": "The resistance to cognitive change proportional to existing framework investment and complexity."
  },
  "Paradigm Catalyst": {
    "short_description": "The anomalous phenomena or conceptual breakthroughs that accelerate framework transformation."
  },
  "Paradigm Reflexivity": {
    "short_description": "The capacity to examine and modify one's own framework while operating within its constraints."
  },
  "Paradigm Echo": {
    "short_description": "The residual influence of obsolete frameworks persisting in language, metaphor, and institutional practices."
  },
  "Paradigm Threshold": {
    "short_description": "The critical mass of anomalies required before existing frameworks undergo phase transition."
  },
  "Paradigm Legacy": {
    "short_description": "The enduring conceptual tools and problematics inherited from previous frameworks, often unconsciously retained."
  }
}
