{
  "the Inconscient": {
    "quote": "The Inconscient itself is only an involved state of consciousness which like the Tao or Shunya, though in a different way, contains all things suppressed within it so that under a pressure from above or within all can evolve out of it - 'an inert Soul with a somnambulist Force'.\" Letters on Yoga"
  },
  "the Ignorance": {
    "quote": "\"Ignorance means Avidya, the separative consciousness and the egoistic mind and life that flow from it and all that is natural to the separative consciousness and the egoistic mind and life. This Ignorance is the result of a movement by which the cosmic Intelligence separated itself from the light of the Supermind (the divine Gnosis) and lost the Truth, - truth of being, truth of divine consciousness, truth of force and action, truth of Ananda. As a result, instead of a world of integral truth and divine harmony created in the light of the divine Gnosis, we have a world founded on the part truths of an inferior cosmic Intelligence in which all is half-truth, half-error. . . . All in the consciousness of this creation is either limited or else perverted by separation from the integral Light; even the Truth it perceives is only a half-knowledge. Therefore it is called the Ignorance.\" The Mother"
  },
  "the Subconscient": {
    "quote": "\"About the subconscient - it is the sub-mental base of the being and is made up of impressions, instincts, habitual movements that are stored there. Whatever movement is impressed in it, it keeps. If one impresses the right movement in it, it will keep and send up that. That is why it has to be cleared of old movements before there can be a permanent and total change in the nature. When the higher consciousness is once established in the waking parts, it goes down into the subconscient and changes that also, makes a bedrock of itself there also.\" Letters on Yoga"
  },
  "the Subtle-Physical": {
    "quote": "Sri Aurobindo is in the subtle physical, you can meet him when you sleep, if you know how to go there. ~ The Mother Words Of The Mother - I"
  },
  "vital plane": {
    "quote": "the plane connected with the life-world or desire-world, a plane in which life and desire find their untrammeled play and their easy self-expression and from there throw their influences and formations on our outer life."
  },
  "mind": {
    "quote": "The Mother \"The true role of the mind is the formation and organization of action. The mind has a formative and organizing power, and it is that which puts the different elements of inspiration in order for action, for organizing action. And if it would only confine itself to that role, receiving inspirations - whether from above or from the mystic centre of the soul - and simply formulating the plan of action - in broad outline or in minute detail, for the smallest things of life or the great terrestrial organizations - it would amply fulfil its function. It is not an instrument of knowledge. But is can use knowledge for action, to organize action. It is an instrument of organization and formation, very powerful and very capable when it is well developed.\" Questions and Answers 1956, MCW Vol. 8.*"
  },
  "Higher Mind": {
    "quote": "I mean by the Higher Mind a first plane of spiritual [consciousness] where one becomes constantly and closely aware of the Self, the One everywhere and knows and sees things habitually with that awareness; but it is still very much on the mindlevel although highly spiritual in its essential substance; and its instrumentation is through an elevated thought-power and comprehensive mental sight-not illumined by any of the intenser upper lights but as if in a large strong and clear daylight. It acts as an intermediate state between the Truth-Light above and the human mind; communicating the higher knowledge in a form that the Mind intensified, broadened, made spiritually supple, can receive without being blinded or dazzled by a Truth beyond it.Our first decisive step out of our human intelligence, our normal mentality, is an ascent into a higher Mind, a mind no longer of mingled light and obscurity or half-light, but a large clarity of the spirit. Its basic substance is a unitarian sense of being with a powerful multiple dynamisation capable of the formation of a multitude of aspects of knowledge, ways of action, forms and significances of becoming, of all of which there is a spontaneous inherent knowledge. It is th"
  },
  "higher mind": {
    "quote": "(c. 1931, in the diagram on page 1360) a plane of consciousness with three levels: \"liberated intelligence\", \"intuitive [higher mind]\" and \"illumined [higher mind]\" (in ascending order). The first level may correspond to vijnanabuddhi in the earlier terminology of the Record of Yoga. The \"intuitive\" and \"illumined\" levels may be what Sri Aurobindo soon after making the diagram began to refer to as \"higher mind\" (defined as \"a luminous thought-mind, a mind of spiritborn conceptual knowledge\") and \"illumined mind\" (characterised by \"an intense lustre, a splendour and illumination of the spirit\"); cf. logistic ideality (also called luminous reason) and hermetic ideality or srauta vijnana (distinguished by \"a diviner splendour of light and blaze of fiery effulgence\") in the terminology of 1919-20."
  },
  "illumined mind": {
    "quote": "\"As the Higher Mind brings a greater consciousness into the being through the spiritual idea and its power of truth, so the Illumined Mind brings in a still greater consciousness through a Truth-sight and Truth-light and its seeing and seizing power.\" The Life Divine*"
  },
  "Intuitive Mind": {
    "quote": "a mind of intuitive reason characterised by its intuitions, its inspirations, its swift revelatory vision, its luminous insight and discrimination; it is a kind of truth-vision, truth-hearing, truth-memory, direct truth-discernment."
  },
  "Intuitive mind": {
    "quote": "same as vijnanabuddhi, a higher form of the buddhi whose \"inspirations, revelations, intuitions, self-luminous discernings are messages from a higher knowledge-plane\", but which \"can perceive the truth only by a brilliant reflection or limited communication and subject to the restrictions and the inferior capacity of the mental vision\"."
  },
  "the Overmental": {
    "quote": "\"The Overmind is a principle of cosmic Truth and a vast and endless catholicity is its very spirit; its energy is an all-dynamism as well as a principle of separate dynamisms: it is a sort of inferior Supermind, - although it is concerned predominantly not with absolutes, but with what might be called the dynamic potentials or pragmatic truths of Reality, or with absolutes mainly for their power of generating pragmatic or creative values, although, too, its comprehension of things is more global than integral, since its totality is built up of global wholes or constituted by separate independent realities uniting or coalescing together, and although the essential unity is grasped by it and felt to be basic of things and pervasive in their manifestation, but no longer as in the Supermind their intimate and ever-present secret, their dominating continent, the overt constant builder of the harmonic whole of their activity and nature.\" The Life Divine"
  },
  "overmind": {
    "quote": "(from 29 October 1927 onwards) the highest plane or system of planes of consciousness below supermind or divine gnosis; especially the principal plane in the overmind system, apparently corresponding to what earlier in 1927 was referred to as supreme supermind. Possessing \"an illimitable capacity of separation and combination of the powers and aspects of the integral and indivisible all-comprehending Unity\", the overmind \"takes up all that is in the three steps below it and raises their characteristic workings to their highest and largest power, adding to them a universal wideness of consciousness and force\""
  },
  "Supermind": {
    "quote": "Supermind is the vast self-extension of the Brahman that contains and develops."
  }
}
