{
"Eight Limbs": { "quote": "Yama, Niyama, Asana, Pranayama, Pratyahara, Dharana, Dhyana, Samadhi are the eight limbs of Yoga. (Yoga Sutras 2.29)" },
"Yogic Mind": { "quote": "Yoga is the cessation of the modifications of the mind. (Yoga Sutras 1.2)" },
"Meditation": { "quote": "When the mind maintains awareness, yet does not mingle with the senses or sense objects, that is called Pratyahara. (Yoga Sutras 2.54)" },
"Samadhi": { "quote": "Samadhi is the state where the mind, intellect and ego are transcended and one enters pure consciousness. (Yoga Sutras 1.51)" },
"Karma": { "quote": "The karmic impressions created by actions, thoughts and speech become the seeds of future experience. (Yoga Sutras 2.12)" },
"Consciousness": { "quote": "The Seer is pure consciousness, though pure, sees through the coloring of the intellect. (Yoga Sutras 2.20)" },
"Sanskrit Grammar": { "quote": "Language is permanent, and the relation between word and meaning is eternal. (Mahabhashya)" },
"Spiritual Practice": { "quote": "Practice becomes firmly grounded when well attended to for a long time, without break and in all earnestness. (Yoga Sutras 1.14)" },
"Mind Control": { "quote": "These mental modifications are restrained by practice and detachment. (Yoga Sutras 1.12)" },
"Ethical Principles": { "quote": "The Yamas are non-violence, truthfulness, non-stealing, continence, and non-greed. (Yoga Sutras 2.30)" },
"Personal Observances": { "quote": "The Niyamas are purity, contentment, austerity, self-study, and surrender to the Supreme. (Yoga Sutras 2.32)" },
"Breath Control": { "quote": "Pranayama is the regulation of the incoming and outgoing flow of breath with retention. (Yoga Sutras 2.49)" },
"Concentration": { "quote": "Dharana is the binding of consciousness to a single point. (Yoga Sutras 3.1)" },
"Liberation": { "quote": "Through practice and detachment, the mind becomes clear like a crystal, reflecting equally the light of pure consciousness. (Yoga Sutras 1.41)" },
"Obstacles": { "quote": "Disease, dullness, doubt, carelessness, laziness, sensuality, false perception, failure to reach firm ground and slipping from the ground gained - these are the obstacles. (Yoga Sutras 1.30)" },
"Enlightenment": { "quote": "When ignorance is destroyed, the bonds of karma are destroyed, bringing freedom from sorrow and achieving enlightenment. (Yoga Sutras 2.25)" },
"Sound and Meaning": { "quote": "The relationship between word and its meaning is eternal. (Mahabhashya on Panini Sutra)" },
"Yogic Powers": { "quote": "By samyama on the form of the body, the power of perception of the form being suspended, contact between the eye of the observer and light is broken. (Yoga Sutras 3.21)" },
"Knowledge": { "quote": "When the light of knowledge comes, ignorance is destroyed. (Yoga Sutras 2.52)" },
"Pure Awareness": { "quote": "Then the Seer abides in its own nature. (Yoga Sutras 1.3)" },
"Practice Method": { "quote": "Faith, energy, memory, absorption, and wisdom are the keys to success in yoga. (Yoga Sutras 1.20)" },
"Mental Peace": { "quote": "By cultivating friendliness towards happiness and compassion towards misery, gladness towards virtue and indifference towards vice, the mind becomes pure. (Yoga Sutras 1.33)" },
"Sanskrit Rules": { "quote": "A word is that which, when articulated, produces an understanding in the mind of the hearer. (Mahabhashya)" },
"Spiritual Evolution": { "quote": "As coal, impurities, and ore are gradually burnt by fire, so the impurities of the mind are burnt by the fire of knowledge. (Yoga Sutras 2.28)" },
"Divine Union": { "quote": "Yoga is the journey of the self, through the self, to the self. (Essence of Yoga Sutras)" },
"Mental Modifications": { "quote": "The modifications of mind are five-fold and are either painful or painless. (Yoga Sutras 1.5)" },
"Grammar Philosophy": { "quote": "Grammar is the door to liberation, the medicine for the impurities of speech, the purifier of all sciences. (Mahabhashya)" },
"Spiritual Discipline": { "quote": "By dedicated practice and detachment, one can stop the waves of the mind. (Yoga Sutras 1.12)" },
"Ultimate Reality": { "quote": "When in meditation, one is established in the witness consciousness, one has reached the highest state. (Yoga Sutras 1.3)" },
"Language Science": { "quote": "The word is the source of all knowledge and the root of the universe. (Mahabhashya)" }
}
