{
"Theory of Forms": { "quote": "The forms are perfect, eternal, and unchanging patterns of which particular objects and qualities in the physical world are imperfect copies. (Republic, Book VII)" },
"Cave Allegory": { "quote": "Imagine human beings living in an underground cave... they see only shadows of reality. (Republic, 514a-520a)" },
"Justice": { "quote": "Justice is having and doing what is one's own... when each part of the soul performs its proper function. (Republic, 433a-b)" },
"Philosophical Method": { "quote": "The dialectical method of inquiry proceeds by question and answer to arrive at truth. (Meno)" },
"Education": { "quote": "The direction in which education starts a man will determine his future life. (Republic, 425b-c)" },
"Soul Nature": { "quote": "The soul is tripartite: reason, spirit, and appetite, each with its proper virtue. (Republic, Book IV)" },
"Knowledge": { "quote": "Knowledge is the food of the soul. (Protagoras, 313c)" },
"Love": { "quote": "Love is a serious mental disease... but also the source of our greatest powers. (Phaedrus, 265b)" },
"Political Theory": { "quote": "Until philosophers are kings, or kings have the spirit of philosophy, cities will never cease from ill. (Republic, 473d)" },
"Reality": { "quote": "What is real is rational and what is rational is real. (Republic, Book VI)" },
"Beauty": { "quote": "Beauty lies in the eye of the beholder... but true beauty is eternal and unchanging. (Symposium)" },
"Virtue": { "quote": "Virtue is knowledge, and those who know the good will do the good. (Meno, 87c)" },
"Immortality": { "quote": "The soul is immortal and imperishable, and our souls will truly exist in another world. (Phaedo, 106e)" },
"Teaching Method": { "quote": "I cannot teach anybody anything, I can only make them think. (Attributed to Plato)" },
"Divine Nature": { "quote": "God is the measure of all things, not man as some say. (Laws, 716c)" },
"Poetry": { "quote": "Poetry is nearer to vital truth than history. (Ion)" },
"Mathematics": { "quote": "Let no one ignorant of geometry enter here. (Inscription at the Academy)" },
"Wisdom": { "quote": "The beginning of wisdom is the definition of terms. (Attributed to Plato)" },
"Government": { "quote": "The price good men pay for indifference to public affairs is to be ruled by evil men. (Republic)" },
"Human Nature": { "quote": "Man is a being in search of meaning. (Republic)" },
"Art": { "quote": "Art is the imitation of an imitation, as it copies the physical world, which itself is a copy of the world of forms. (Republic, Book X)" },
"Ethics": { "quote": "Good people do not need laws to tell them to act responsibly, while bad people will find a way around the laws. (Republic)" },
"Truth": { "quote": "We can easily forgive a child who is afraid of the dark; the real tragedy of life is when men are afraid of the light. (Attributed to Plato)" },
"Learning": { "quote": "All learning has an emotional base. (Republic)" },
"Justice System": { "quote": "Justice means minding one's own business and not meddling with other men's concerns. (Republic, 433a)" },
"Philosopher King": { "quote": "The philosopher is in love with truth, that is, not with the changing world of sensation, but with the unchanging reality. (Republic)" },
"Social Order": { "quote": "The city is what it is because our citizens are what they are. (Republic)" },
"Dialectic": { "quote": "Dialectic is the art of asking questions that expose contradictions in conventional beliefs. (Republic)" },
"Educational Theory": { "quote": "Do not train children to learning by force and harshness, but direct them to it by what amuses their minds. (Republic)" },
"Political Justice": { "quote": "The greatest penalty for declining to rule is to be ruled by someone inferior to yourself. (Republic, 347c)" }
}
