{
"Player Experience Goals": { "quote": "Defining the intended emotional and psychological responses. Journey was designed specifically to create feelings of awe, connection, and smallness." },
"Player Motivation": { "quote": "Understanding why players engage with games. Satisfactory appeals to achievement-oriented players through automation optimization and base-building." },
"Player Agency": { "quote": "Empowering meaningful choices and self-expression. Minecraft prioritizes creative freedom over prescribed objectives." },
"Cognitive Load": { "quote": "Managing mental effort required to play. Into the Breach presents all future enemy actions to focus player thinking on solutions rather than predictions." },
"Skill Acquisition": { "quote": "How players learn and master gameplay systems. Celeste's progression carefully introduces mechanics before combining them in increasingly complex challenges." },
"Flow State": { "quote": "Balancing challenge and skill to create deep engagement. Tetris maintains flow through gradually increasing speed that matches skill development." },
"Player Feedback": { "quote": "How the game communicates information to players. Overwatch uses distinctive sound cues, visual effects, and hit markers to provide clear feedback on actions." },
"Accessibility": { "quote": "Designing for players with different abilities and needs. The Last of Us Part II includes over 60 accessibility options from control remapping to audio cues." },
"User Interface": { "quote": "Creating intuitive information displays and controls. Dead Space integrates health meters into the character's suit to maintain immersion while conveying critical information." },
"Onboarding": { "quote": "Introducing new players to game systems. Breath of the Wild's Great Plateau serves as a tutorial area that teaches core mechanics through guided discovery." },
"Player Types": { "quote": "Accommodating different play styles and preferences. World of Warcraft offers PvE, PvP, collecting, and social activities to appeal to diverse player motivations." },
"User Testing": { "quote": "Gathering player feedback to refine the experience. Valve's extensive playtesting helps identify pain points and areas of confusion before release." },
"Affordances": { "quote": "Visual cues that suggest how objects can be used. Portal 2's white panels clearly indicate surfaces that accept portals." },
"Intrinsic Motivation": { "quote": "Designing for internal player satisfaction rather than external rewards. Outer Wilds relies on curiosity and discovery rather than achievement points." },
"Extrinsic Motivation": { "quote": "Using external rewards to encourage desired behaviors. Fortnite's Battle Pass creates clear progression goals through cosmetic rewards." },
"Player Autonomy": { "quote": "Freedom to approach objectives in personalized ways. Dishonored allows stealth, combat, or non-lethal approaches to the same objectives." },
"Competence Development": { "quote": "Facilitating gradual skill improvement with appropriate challenges. FromSoftware games create satisfaction through overcoming difficult but fair challenges." },
"Social Connection": { "quote": "Facilitating meaningful player interactions. Among Us creates social dynamics through limited information and deception mechanics." },
"Psychological Safety": { "quote": "Creating environments where players feel comfortable taking risks. Animal Crossing provides a non-threatening space with no failure states." },
"Player Personas": { "quote": "Creating archetypal player profiles to guide design decisions. Riot Games designs League of Legends champions to appeal to different player personas." },
"Mental Models": { "quote": "Understanding how players conceptualize game systems. Portal builds on players' understanding of physics to create its puzzle mechanics." },
"Cognitive Bias": { "quote": "Recognizing how player thinking patterns affect game perception. Achievement systems leverage the endowed progress effect by showing partially filled progress bars." },
"Emotional Design": { "quote": "Deliberately evoking specific feelings through game elements. Inside creates discomfort and unease through environmental storytelling and ambiguous narrative." },
"Physical Comfort": { "quote": "Considering player wellbeing during extended play. Beat Saber includes options to adjust gameplay elements for physical comfort in VR." },
"Contextual Design": { "quote": "Adapting to different play environments and situations. Nintendo Switch games account for both handheld and docked play modes." },
"Player Customization": { "quote": "Allowing players to personalize their experience. Hades' God Mode provides adjustable difficulty without removing the core challenge." },
"Player Progression": { "quote": "Tracking advancement in ways meaningful to the player. Horizon Zero Dawn ties skill acquisition to narrative development and exploration." },
"User Research": { "quote": "Systematically studying player behavior to improve design. Heat maps of player deaths help identify difficulty spikes and unclear guidance." },
"Retention Design": { "quote": "Creating systems that encourage continued engagement. Destiny 2's weekly rituals and seasonal content provide reasons to return regularly." },
"Inclusive Design": { "quote": "Ensuring games are welcoming and playable for diverse audiences. Sea of Thieves' art style and mechanics support both casual and dedicated players." }
}
