{
"Narrative Choice": { "quote": "Decisions that affect story outcomes and character development. The Witcher 3's branching storylines create consequences that manifest hours after choices are made." },
"Mechanical Choice": { "quote": "Options in how gameplay challenges are approached. Deus Ex allows stealth, combat, hacking, or social approaches to the same objectives." },
"Character Creation": { "quote": "Customizing avatar appearance and abilities. Elder Scrolls games allow players to craft unique characters through race, class, and appearance options." },
"Build Diversity": { "quote": "Multiple viable ways to develop character abilities. Path of Exile's extensive skill tree enables countless build possibilities and playstyles." },
"Skill Expression": { "quote": "Systems that allow players to demonstrate mastery. Fighting games like Street Fighter reward technical execution and strategic decision-making." },
"Environmental Interaction": { "quote": "Freedom to manipulate the game world. The physics engine in Half-Life 2 allows creative problem-solving with the gravity gun." },
"Open World Design": { "quote": "Non-linear environments that enable player-directed exploration. Breath of the Wild allows players to chart their own path through Hyrule." },
"Emergent Gameplay": { "quote": "Unexpected interactions between game systems. The chemistry system in Breath of the Wild enables creative solutions not explicitly designed." },
"Sandbox Elements": { "quote": "Tools and systems with minimal restrictions. Minecraft provides raw materials and crafting without prescribed objectives." },
"Dynamic Difficulty": { "quote": "Challenge that adapts to player skill and choices. Left 4 Dead's AI Director adjusts enemy spawns based on team performance." },
"Moral Systems": { "quote": "Ethical choices with gameplay consequences. Dishonored's chaos system reflects player lethality in the game world and story." },
"Roleplaying Opportunities": { "quote": "Systems supporting character immersion and identity. Fallout: New Vegas dialogue options reflect character skills and background." },
"Resource Management": { "quote": "Strategic allocation of limited resources. Survival games like Don't Starve force prioritization between immediate needs and long-term goals." },
"Strategic Planning": { "quote": "Making consequential decisions with incomplete information. XCOM's permadeath and limited resources create high-stakes mission planning." },
"Creative Expression": { "quote": "Tools for player-generated content and aesthetics. Animal Crossing: New Horizons' customization systems enable personal expression through island design." },
"Sequence Breaking": { "quote": "Ability to bypass intended progression paths. Metroid's movement abilities allow expert players to collect items out of the designed order." },
"Consequence Systems": { "quote": "How player actions affect the game world over time. Red Dead Redemption 2's honor system influences how NPCs interact with the player." },
"Player-Set Goals": { "quote": "Freedom to determine objectives beyond developer intentions. Skyrim supports both main questline progression and self-directed exploration." },
"Meta-Game Choices": { "quote": "Strategic decisions outside individual play sessions. Deck building in card games like Hearthstone represents agency in preparation for matches." },
"Social Agency": { "quote": "Meaningful interactions with other players or NPCs. Mass Effect's companion relationships develop based on dialogue choices and actions." },
"Time Management": { "quote": "Deciding how to allocate limited time resources. Persona 5's calendar system forces prioritization between social links, training, and dungeon exploration." },
"Spatial Navigation": { "quote": "Freedom in determining how to traverse the game world. Mirror's Edge rewards creative pathfinding through its parkour mechanics." },
"Action Execution": { "quote": "Control over moment-to-moment gameplay actions. Sekiro's precise combat requires intentional timing for attacks, deflects, and movement." },
"Rule Modification": { "quote": "Player ability to adjust game parameters. Hades' Pact of Punishment allows players to increase difficulty in specific ways for greater rewards." },
"Information Gathering": { "quote": "Player-directed discovery of game knowledge. Outer Wilds relies on player curiosity to uncover its interconnected mysteries." },
"Loadout Selection": { "quote": "Choosing equipment and abilities before encounters. Monster Hunter's weapon selection dramatically changes how players approach hunts." },
"World Persistence": { "quote": "Player actions creating lasting changes to the environment. Minecraft's building mechanics create permanent modifications to the world." },
"Identity Expression": { "quote": "Systems that allow players to express themselves socially. Final Fantasy XIV's housing and glamour systems enable social identity expression." },
"Experimentation": { "quote": "Support for testing ideas and hypotheses. The Legend of Zelda: Tears of the Kingdom's Ultrahand ability encourages creative contraption building." },
"Rejection of Objectives": { "quote": "Freedom to ignore or subvert intended goals. Grand Theft Auto allows players to disregard missions in favor of open-world chaos." }
}
