{
"Power Fantasy": { "quote": "Experiencing extraordinary abilities beyond real-world limitations. God of War lets players embody a godlike warrior capable of defeating mythological beasts and deities." },
"Heroic Fantasy": { "quote": "Being the chosen one destined to save the world. The Legend of Zelda casts players as the hero who must gather courage and power to defeat evil." },
"Mastery Fantasy": { "quote": "Developing exceptional skill through practice and dedication. FromSoftware games reward players who master precise timing and pattern recognition." },
"Creation Fantasy": { "quote": "Building, crafting, and designing with meaningful impact. Minecraft enables players to transform entire landscapes into personalized creations." },
"Exploration Fantasy": { "quote": "Discovering the unknown and charting uncharted territories. No Man's Sky provides an effectively limitless universe of procedural planets to explore." },
"Strategic Fantasy": { "quote": "Outsmarting opponents through superior planning and foresight. Civilization turns players into nation leaders guiding civilizations across millennia." },
"Social Fantasy": { "quote": "Connecting with others and building meaningful relationships. Animal Crossing creates a gentle social simulation where friendship is central." },
"Narrative Fantasy": { "quote": "Living through an epic story with personal agency. Mass Effect allows players to shape galactic history through dialog choices and moral decisions." },
"Competitive Fantasy": { "quote": "Proving superiority through direct contest. Fighting games like Street Fighter let players demonstrate skill in head-to-head competition." },
"Dominance Fantasy": { "quote": "Conquering rivals and establishing superiority. Grand strategy games like Hearts of Iron IV let players rewrite history through military conquest." },
"Survival Fantasy": { "quote": "Persevering against harsh conditions and overwhelming odds. The Long Dark pits players against the unforgiving wilderness and their own mortality." },
"Horror Fantasy": { "quote": "Facing terror and overcoming fear. Resident Evil places players in nightmarish scenarios with limited resources against grotesque threats." },
"Stealth Fantasy": { "quote": "Operating unseen and outwitting enemies through cunning. Metal Gear Solid rewards players for invisibility and non-confrontational solutions." },
"Collection Fantasy": { "quote": "Gathering complete sets of valuable or rare items. Pokémon's 'Gotta Catch 'Em All' slogan encapsulates the drive to collect every creature." },
"Destruction Fantasy": { "quote": "Causing chaos and witnessing spectacular devastation. Just Cause provides tools specifically designed for creative environmental destruction." },
"Management Fantasy": { "quote": "Organizing complex systems with efficiency and precision. Two Point Hospital lets players design and optimize healthcare facilities." },
"Detective Fantasy": { "quote": "Uncovering truth through observation and deduction. Return of the Obra Dinn challenges players to solve a complex maritime mystery piece by piece." },
"Performance Fantasy": { "quote": "Expressing artistry through gameplay. Guitar Hero transforms players into rock stars through rhythm-based performance." },
"Teamwork Fantasy": { "quote": "Coordinating with others to achieve shared goals. Overwatch rewards teams who combine character abilities effectively." },
"Transformation Fantasy": { "quote": "Evolving and changing form for different abilities. Metroid's progression centers on acquiring new forms and powers that change gameplay options." },
"Fantasy Fulfillment": { "quote": "Living out specific real-world dreams or aspirations. Microsoft Flight Simulator offers authentic aviation experiences for aspiring pilots." },
"Knowledge Fantasy": { "quote": "Gaining arcane or specialized information mastery. Trivia games like You Don't Know Jack reward players for their real-world knowledge." },
"Speed Fantasy": { "quote": "Moving with extraordinary velocity and precision. Sonic the Hedgehog centers on the exhilaration of moving at incredible speeds." },
"Tactical Fantasy": { "quote": "Making moment-to-moment decisions with immediate consequences. XCOM requires precise positioning and risk assessment in combat scenarios." },
"Resource Fantasy": { "quote": "Acquiring and managing wealth or supplies with strategic insight. The economy management in EVE Online enables player-driven markets and industries." },
"Moral Fantasy": { "quote": "Making ethical choices that shape the world and characters. Undertale responds to player violence or mercy with significantly different outcomes." },
"Romance Fantasy": { "quote": "Developing intimate relationships with appealing characters. Dating sims like Dream Daddy allow players to pursue romantic storylines." },
"Leadership Fantasy": { "quote": "Guiding others and inspiring loyalty in followers. Dragon Age: Inquisition casts the player as the leader of a growing organization with loyal companions." },
"Lifestyle Fantasy": { "quote": "Living an alternative day-to-day existence. The Sims allows players to design and control virtual people through ordinary and extraordinary life events." },
"Historical Fantasy": { "quote": "Participating in pivotal moments from the past. Assassin's Creed places players at the center of historical periods and events." }
}
