{
"Immersion": { "quote": "The sensation of being mentally transported into the game world. Red Dead Redemption 2's detailed environments and systems create a believable frontier experience." },
"Flow": { "quote": "The mental state of complete absorption and enjoyment. Tetris creates flow through escalating challenge that matches player skill development." },
"Agency": { "quote": "The sense of control and impact on the game world. The Witcher 3's branching narrative makes player choices feel meaningful and consequential." },
"Mastery": { "quote": "The satisfaction of skill development and demonstration. Sekiro rewards players who master its precise parry system with satisfying combat encounters." },
"Challenge": { "quote": "Obstacles that require effort to overcome. Celeste's platforming requires precision but provides accessibility options for different skill levels." },
"Discovery": { "quote": "The joy of finding something new. Outer Wilds creates an entire experience around uncovering secrets through exploration and knowledge." },
"Curiosity": { "quote": "The desire to learn and understand. Tunic provides cryptic information that encourages players to experiment and decipher its mysteries." },
"Autonomy": { "quote": "Freedom to approach objectives in personalized ways. Breath of the Wild's physics system allows for creative solutions to environmental puzzles." },
"Accomplishment": { "quote": "Pride in achieving difficult goals. Completing a difficult boss in Elden Ring creates genuine feelings of achievement and relief." },
"Surprise": { "quote": "Unexpected moments that defy player expectations. Undertale subverts RPG conventions with its combat and morality systems." },
"Wonder": { "quote": "Awe at experiencing something magnificent. Shadow of the Colossus creates moments of wonder through scale and minimalist design." },
"Tension": { "quote": "The stress of uncertain outcomes. XCOM builds tension through consequential decisions with permanent character death." },
"Relief": { "quote": "The release of accumulated tension. Finding a bonfire in Dark Souls after a difficult area creates profound relief." },
"Frustration": { "quote": "The emotion resulting from obstacles to progress. Carefully managed frustration in Celeste makes eventual success more satisfying." },
"Socialization": { "quote": "Connection with other players. Animal Crossing: New Horizons created virtual social spaces during global isolation." },
"Collaboration": { "quote": "Working together toward common goals. Left 4 Dead requires coordinated teamwork to survive its zombie hordes." },
"Competition": { "quote": "Testing skills against other players. Fighting games like Street Fighter create intense competitive experiences through balanced mechanics." },
"Expression": { "quote": "Self-representation through gameplay choices. Minecraft's creative mode allows players to express themselves through building and design." },
"Narrative Engagement": { "quote": "Emotional investment in the game's story. The Last of Us creates attachments to characters through environmental storytelling and refined writing." },
"Progression": { "quote": "The sense of advancement and development. RPGs like Final Fantasy reward time investment with character growth and expanded abilities." },
"Fiero": { "quote": "The emotional triumph after overcoming significant challenge. Defeating a boss in Dark Souls after numerous attempts triggers this powerful feeling." },
"Escapism": { "quote": "Temporary relief from real-world concerns. Fantasy RPGs offer alternative worlds removed from everyday stresses." },
"Cognitive Engagement": { "quote": "Mental stimulation through problem-solving. Portal's spatial puzzles require active thinking and experimentation." },
"Emotional Resonance": { "quote": "Games that evoke genuine feelings. Journey's wordless cooperative experience creates authentic emotional connections." },
"Sensory Pleasure": { "quote": "Enjoyment from visual, audio and tactile elements. Tetris Effect combines music, visuals, and haptic feedback for sensory synesthesia." },
"Anticipation": { "quote": "Excitement about upcoming events. Loot systems in games like Diablo create anticipation through random rewards." },
"Empathy": { "quote": "Understanding of characters' situations and feelings. That Dragon, Cancer puts players in the position of parents facing their child's illness." },
"Horror": { "quote": "Controlled fear in a safe environment. Resident Evil 2's Mr. X creates persistent tension and dread through relentless pursuit." },
"Nostalgia": { "quote": "Emotional connection to past gaming experiences. Remakes like Final Fantasy VII Remake balance nostalgia with new experiences." },
"Presence": { "quote": "The feeling of 'being there' within the game world. Half-Life: Alyx uses VR to create unprecedented levels of physical presence and interaction." }
}
