{
  "Potentiality": {
    "short_description": "The inherent capacity for development, existence, or action not yet actualized, encompassing all possible states and transformations latent within a being or system."
  },
  "Actuality": {
    "short_description": "The realized or manifested state of potential, representing the current form or expression of inherent possibilities in concrete existence."
  },
  "Latency": {
    "short_description": "The dormant state of potential existing below the threshold of manifestation, containing unexpressed possibilities awaiting suitable conditions for emergence."
  },
  "Emergence": {
    "short_description": "The process by which potential qualities or properties arise from simpler preconditions, creating novel characteristics not predictable from constituent elements alone."
  },
  "Manifestation": {
    "short_description": "The expression of potential into observable or experiential form, marking the transition from possibility to actuality through definite embodiment."
  },
  "Capability": {
    "short_description": "The concrete capacity for specific actions or developments, representing defined channels through which potential can flow into actualization."
  },
  "Development": {
    "short_description": "The progressive unfolding of inherent potential through stages of increasing complexity and organization toward fuller expression."
  },
  "Possibility": {
    "short_description": "A specific potential state or outcome that could be actualized under appropriate conditions, existing as part of the total field of potentiality."
  },
  "Propensity": {
    "short_description": "The natural tendency or inclination toward particular forms of actualization, shaping the probable pathways of potential development."
  },
  "Seed Form": {
    "short_description": "The initial configuration containing all future possibilities in concentrated form, serving as the origin point for developmental processes."
  },
  "Actualization": {
    "short_description": "The process of realizing potential through transformation from possibility into manifest reality, requiring specific conditions and energy."
  },
  "Quantum State": {
    "short_description": "The superposition of multiple potential states before observation or interaction, representing pure possibility in its most fundamental form."
  },
  "Field": {
    "short_description": "The underlying matrix of possibility from which actualized forms emerge, containing all potential patterns and relationships in virtual form."
  },
  "Threshold": {
    "short_description": "The critical point at which potential transitions into actuality, marking the boundary between possible and manifest states."
  },
  "Plasticity": {
    "short_description": "The capacity for modification and adaptation, representing the dynamic aspect of potential to assume new forms and capabilities."
  },
  "Constraint": {
    "short_description": "The limiting factors that channel and shape the expression of potential, determining the range of possible actualizations."
  },
  "Capacity": {
    "short_description": "The quantitative dimension of potential, measuring the extent or magnitude of possible development or expression."
  },
  "Vector": {
    "short_description": "The directional tendency of potential development, indicating the probable pathway of actualization under given conditions."
  },
  "Entropy": {
    "short_description": "The measure of potential states available to a system, representing the degree of possibility and uncertainty in future developments."
  },
  "Crystallization": {
    "short_description": "The process of potential assuming definite form, representing the transition from fluid possibility to structured actuality."
  },
  "Resonance": {
    "short_description": "The sympathetic activation of potential through harmonic relationship, catalyzing specific forms of actualization through frequency matching."
  },
  "Matrix": {
    "short_description": "The underlying structure supporting and organizing potential developments, providing the framework for possible manifestations."
  },
  "Catalyst": {
    "short_description": "The agent or condition that initiates the actualization of potential, transforming possibility into manifest reality through specific interaction."
  },
  "Gradient": {
    "short_description": "The differential of potential across a system, creating the conditions for flow and transformation from higher to lower states."
  },
  "Phase Space": {
    "short_description": "The complete set of possible states available to a system, mapping the total landscape of potential configurations and transitions."
  }
}
