{
"Experience Points": { "quote": "Numerical representation of character growth. Final Fantasy awards XP after combat encounters to level up characters and increase stats." },
"Skill Trees": { "quote": "Branching paths of abilities that allow player specialization. Path of Exile's massive skill web enables highly customized character builds." },
"Character Levels": { "quote": "Discrete stages of power that unlock new abilities. World of Warcraft gates content and abilities behind level requirements." },
"Gear Progression": { "quote": "Advancement through equipment upgrades. Diablo III's loot system provides incremental power increases through randomly generated items." },
"Crafting Systems": { "quote": "Creating and upgrading items through collected resources. Monster Hunter World's weapon crafting requires specific monster parts for themed equipment." },
"Perk Systems": { "quote": "Special bonuses that modify gameplay. Fallout's perks provide unique abilities and stat bonuses upon leveling up." },
"Ability Unlocks": { "quote": "Gating capabilities behind progression milestones. Metroid's progression is built around gaining new movement and combat abilities that access new areas." },
"Reputation Systems": { "quote": "Status with in-game factions affecting available content. Star Wars: The Old Republic grants special rewards and storylines based on faction standing." },
"Achievement Systems": { "quote": "Goals that track accomplishments and provide rewards. Hades ties achievements to permanent upgrades and narrative development." },
"Prestige Systems": { "quote": "Resetting progress for long-term benefits. Call of Duty's prestige system allows players to restart progression with special recognition and rewards." },
"Battle Pass": { "quote": "Timed progression tracks with sequential rewards. Fortnite popularized seasonal passes that reward consistent play with cosmetics and currency." },
"Talent Points": { "quote": "Allocated resources for character customization. World of Warcraft's talent system allows players to choose abilities that define their playstyle." },
"Mastery Systems": { "quote": "Tracking proficiency with specific mechanics or tools. Warframe rewards continued use of weapons and frames with additional power and customization." },
"Procedural Advancement": { "quote": "Randomized progression elements. Hades' boon system offers different god-granted powers each run, creating varied builds." },
"Meta Progression": { "quote": "Advancement that persists between gameplay sessions or character deaths. Rogue Legacy allows upgrades to the family manor that benefit future generations of characters." },
"Narrative Unlocks": { "quote": "Story progress that gates features and content. God of War (2018) ties new abilities and areas to story progression and relationship development." },
"Resource Accumulation": { "quote": "Gathering materials that enable advancement. Minecraft's progression centers around mining and crafting increasingly valuable resources." },
"Daily/Weekly Challenges": { "quote": "Time-limited tasks that provide progression resources. Destiny 2 uses weekly challenges to guide player activity and provide powerful rewards." },
"Seasonal Resets": { "quote": "Periodic progression refreshes with new content. Diablo III and Path of Exile use seasons to provide fresh economies and new mechanical twists." },
"Collectible Progression": { "quote": "Advancement through finding and cataloging items. Pokémon's core loop revolves around capturing creatures to fill the Pokédex." },
"Technology Trees": { "quote": "Sequential research paths that unlock new capabilities. Civilization's tech tree represents human advancement from ancient to future technologies." },
"Faction Advancement": { "quote": "Progress within specific groups that unlocks specialized content. Elder Scrolls Online's guilds each have unique progression tracks with themed rewards." },
"Quest Chains": { "quote": "Sequential missions that build upon previous accomplishments. Red Dead Redemption 2's story missions gradually reveal new game regions and mechanics." },
"Player Housing": { "quote": "Customizable spaces that expand with player progress. Final Fantasy XIV's housing system allows for increasingly elaborate decorations and functions." },
"PvP Ranking": { "quote": "Competitive hierarchies based on performance against other players. League of Legends' ranked ladder provides status and end-of-season rewards." },
"Discovery Systems": { "quote": "Progression through exploration and finding new locations. Breath of the Wild rewards exploration with shrines that increase health and stamina." },
"Badge Systems": { "quote": "Visual symbols of accomplishment that confer benefits. Pokémon's gym badges both mark progress and enable gameplay features like HM usage." },
"Time-Based Progression": { "quote": "Advancement tied to real-world time passing. Animal Crossing gates certain events and developments behind daily resets and seasonal changes." },
"Social Progression": { "quote": "Advancement through community interaction. Death Stranding's social strand system rewards players for helping others through shared infrastructure." },
"Cosmetic Unlocks": { "quote": "Visual customization options earned through gameplay. Overwatch provides character skins and emotes as non-power-affecting progression rewards." }
}
