{
"Project Initiation": { "quote": "Defining the project's purpose, scope, and business case. The project charter establishes authority and alignment with organizational goals." },
"Scope Management": { "quote": "Defining and controlling what is and is not included in the project. Clear scope statements prevent scope creep and establish boundaries." },
"Time Management": { "quote": "Scheduling activities and controlling project timeline. Critical path analysis identifies tasks that directly impact project completion date." },
"Cost Management": { "quote": "Planning, estimating, and controlling project budget. Earned value management measures project performance against cost and schedule baselines." },
"Quality Management": { "quote": "Ensuring deliverables meet requirements and standards. Prevention costs are typically lower than inspection and failure costs." },
"Resource Management": { "quote": "Optimizing team members, equipment, and materials. Resource leveling helps avoid overallocation and burnout." },
"Communications Management": { "quote": "Planning and executing information exchange among stakeholders. The communications plan identifies who needs what information, when, and how." },
"Risk Management": { "quote": "Identifying, analyzing, and responding to project uncertainties. Risk registers document potential issues and mitigation strategies." },
"Procurement Management": { "quote": "Acquiring goods and services from outside the project team. Make-or-buy analysis determines whether to create deliverables internally or purchase externally." },
"Stakeholder Management": { "quote": "Identifying and engaging people affected by the project. Power/interest grids help prioritize stakeholder communication strategies." },
"Agile Methodology": { "quote": "Iterative approach focused on collaboration and flexibility. Scrum teams deliver working increments in time-boxed sprints." },
"Waterfall Methodology": { "quote": "Sequential approach with distinct phases. Each phase must be completed before the next begins, making planning and documentation crucial." },
"Kanban": { "quote": "Visual workflow management focused on continuous delivery. Work-in-progress limits prevent bottlenecks and improve flow." },
"Lean Project Management": { "quote": "Eliminating waste and maximizing value. The five principles: value, value stream, flow, pull, and perfection." },
"Critical Path Method": { "quote": "Identifying the sequence of critical tasks that determine project duration. Float or slack represents the amount of time an activity can be delayed." },
"PRINCE2": { "quote": "Structured project management method with defined roles and stages. Projects are driven by business justification throughout their lifecycle." },
"Work Breakdown Structure": { "quote": "Hierarchical decomposition of deliverables into manageable components. The 100% rule ensures all work is included without duplication." },
"Gantt Charts": { "quote": "Visual timeline displaying activities, dependencies, and progress. Horizontal bars represent task duration and relationships." },
"PERT Analysis": { "quote": "Program Evaluation and Review Technique for estimating uncertain durations. (Optimistic + 4×Most Likely + Pessimistic) ÷ 6 provides weighted average duration." },
"Milestone Planning": { "quote": "Identifying significant events or achievements in the project. Milestones have zero duration but mark important transition points." },
"Sprint Planning": { "quote": "Collaborative session to determine work for the upcoming iteration. The team selects items from the prioritized backlog based on capacity." },
"Daily Stand-up": { "quote": "Brief daily meeting to coordinate activities and address obstacles. Three questions: What did I do yesterday? What will I do today? Any impediments?" },
"Retrospective": { "quote": "Team reflection on process improvement. What went well? What could be improved? What actions will we take?" },
"Project Portfolio Management": { "quote": "Selecting and prioritizing projects to achieve strategic objectives. Balancing high-risk/high-reward projects with safer investments." },
"Program Management": { "quote": "Coordinating related projects to achieve benefits not possible individually. Managing interdependencies between projects is a key focus." },
"Change Management": { "quote": "Controlling modifications to scope, schedule, or resources. The change control board evaluates impact before approving changes." },
"Earned Value Management": { "quote": "Measuring project performance against scope, schedule, and cost. CPI < 1 indicates over budget; SPI < 1 indicates behind schedule." },
"Project Governance": { "quote": "Framework for decision-making and oversight. Clearly defined roles, responsibilities, and escalation paths ensure accountability." },
"Lessons Learned": { "quote": "Documenting experiences to improve future projects. Post-project reviews capture knowledge before the team disbands." },
"Project Closure": { "quote": "Formally completing and evaluating the project. Final deliverable acceptance, resource release, and administrative closure." }
}
