{
"Wisdom": { "quote": "The fear of the LORD is the beginning of wisdom, and knowledge of the Holy One is understanding. (Proverbs 9:10)" },
"Perseverance": { "quote": "Fall seven times, stand up eight. (Japanese Proverb)" },
"Patience": { "quote": "Patience is a tree whose root is bitter, but its fruit is very sweet. (Persian Proverb)" },
"Preparation": { "quote": "Dig the well before you are thirsty. (Chinese Proverb)" },
"Knowledge": { "quote": "To know the road ahead, ask those coming back. (Chinese Proverb)" },
"Action": { "quote": "The journey of a thousand miles begins with a single step. (Lao Tzu)" },
"Opportunity": { "quote": "When the wind of change blows, some build walls, others build windmills. (Chinese Proverb)" },
"Consequences": { "quote": "As you sow, so shall you reap. (Biblical, Galatians 6:7)" },
"Self-Reliance": { "quote": "God helps those who help themselves. (Aesop's Fables)" },
"Time": { "quote": "Time waits for no one. (English Proverb)" },
"Perspective": { "quote": "The grass is always greener on the other side of the fence. (American Proverb)" },
"Contentment": { "quote": "A bird in hand is worth two in the bush. (English Proverb)" },
"Adversity": { "quote": "Smooth seas do not make skillful sailors. (African Proverb)" },
"Discernment": { "quote": "All that glitters is not gold. (Shakespeare, The Merchant of Venice)" },
"Unity": { "quote": "If you want to go fast, go alone. If you want to go far, go together. (African Proverb)" },
"Caution": { "quote": "Look before you leap. (English Proverb)" },
"Excellence": { "quote": "The excellence of a gift lies in its appropriateness rather than in its value. (Charles Dudley Warner)" },
"Courage": { "quote": "Courage is knowing what not to fear. (Plato)" },
"Persistence": { "quote": "A falling drop at last will carve a stone. (Lucretius)" },
"Forgiveness": { "quote": "To err is human, to forgive divine. (Alexander Pope)" },
"Moderation": { "quote": "Moderation in all things. (Aristotle)" },
"Honesty": { "quote": "Honesty is the best policy. (Benjamin Franklin)" },
"Self-Knowledge": { "quote": "Know thyself. (Ancient Greek aphorism)" },
"Gratitude": { "quote": "When eating bamboo sprouts, remember the man who planted them. (Chinese Proverb)" },
"Experience": { "quote": "Experience is the best teacher. (Latin Proverb)" },
"Humility": { "quote": "Pride goeth before destruction, and a haughty spirit before a fall. (Proverbs 16:18)" },
"Change": { "quote": "Nothing is permanent except change. (Heraclitus)" },
"Generosity": { "quote": "No act of kindness, no matter how small, is ever wasted. (Aesop)" },
"Friendship": { "quote": "A friend in need is a friend indeed. (Latin Proverb)" },
"Silence": { "quote": "Speech is silver, silence is golden. (Swiss Proverb)" }
}
