{
"Accuracy": { "quote": "The degree to which data correctly represents the real-world entity or event. Customer address matches physical location verification." },
"Completeness": { "quote": "The extent to which required data is present. All mandatory fields in a customer profile are filled with no null values." },
"Consistency": { "quote": "Data is coherent across different datasets and systems. Customer information matches exactly between CRM and billing systems." },
"Timeliness": { "quote": "Data is available when needed and represents the correct time period. Real-time inventory reflects current stock levels within 5 minutes of changes." },
"Validity": { "quote": "Data conforms to defined formats, types, and value ranges. Date fields follow ISO 8601 standard (YYYY-MM-DD)." },
"Uniqueness": { "quote": "Entities are recorded without unintended duplication. Each customer has exactly one unique identifier across all systems." },
"Integrity": { "quote": "Data relationships maintain proper referential constraints. All order records link to valid customer IDs in the customer table." },
"Precision": { "quote": "The exactness of data values to the appropriate decimal place. Financial data calculated and stored to exactly two decimal places." },
"Currency": { "quote": "The degree to which data represents the most recent state of information. Product pricing data updated within 24 hours of price changes." },
"Conformity": { "quote": "Data follows the defined standards and formats. All telephone numbers stored in consistent +1 (XXX) XXX-XXXX format." },
"Reliability": { "quote": "The probability that information is correct and can be depended upon. Medical records achieve 99.99% error-free rate due to validation processes." },
"Accessibility": { "quote": "Data can be obtained by authorized users when and where needed. Business intelligence dashboards provide self-service access to quality-checked data." },
"Relevance": { "quote": "Data is appropriate for the intended use case. Customer segmentation includes only variables with proven predictive value." },
"Traceability": { "quote": "Data lineage and transformations are documented. All financial metrics include metadata about source systems and calculation methodologies." },
"Comprehensiveness": { "quote": "The dataset contains all necessary context and relationships. Customer records include transaction history, communication preferences, and demographic information." },
"Auditability": { "quote": "Changes to data are logged and attributable. Each data modification includes timestamp, user ID, and before/after values." },
"Reasonableness": { "quote": "Data values are within logical expectations. Order quantities fall within expected distribution patterns for product categories." },
"Redundancy": { "quote": "The degree of unnecessary duplication across datasets. Normalized database design eliminates redundant storage of customer details." },
"Bias": { "quote": "The presence of systematic errors or skewed representation. Machine learning training data is evaluated for demographic representation." },
"Coverage": { "quote": "The degree to which data represents the total population of interest. Customer survey responses include adequate representation across all segments." },
"Granularity": { "quote": "The level of detail in the data relative to requirements. Sales data available at transaction level rather than only daily aggregates." },
"Freshness": { "quote": "How up-to-date the data is relative to collection time. Website analytics processed and available within 30 minutes of user activity." },
"Volatility": { "quote": "The measurement of how data changes over time. Product specifications change less than once per year while prices change weekly." },
"Interpretability": { "quote": "Data is presented in clear, understandable formats with adequate context. Analytics include business definitions and calculation methods for each metric." },
"Conciseness": { "quote": "Data is represented without unnecessary complexity. Customer profile contains only relevant fields without extraneous information." },
"Portability": { "quote": "Data can be used across different systems and applications. Data formats comply with industry standards enabling seamless exchange." },
"Privacy Compliance": { "quote": "Data handling meets regulatory requirements for protection. Personally identifiable information is encrypted and access-controlled per GDPR requirements." },
"Accuracy to Source": { "quote": "Data correctly reflects the original source information. Transcribed survey responses match verbatim answers without interpretation errors." },
"Statistical Validity": { "quote": "Data samples represent the population with appropriate confidence levels. Customer feedback represents statistically significant sample with ±3% margin of error." },
"Master Data Alignment": { "quote": "Data conforms to organizational master data standards. All product records reference the official product master hierarchy." }
}
