{
"Factual Questions": { "quote": "Seeking specific, verifiable information: Who wrote 'Pride and Prejudice'? When did World War II end?" },
"Conceptual Questions": { "quote": "Exploring meaning and understanding: What defines consciousness? How does inflation affect purchasing power?" },
"Comparative Questions": { "quote": "Examining similarities and differences: How does classical music differ from jazz? What are the relative merits of democracy versus autocracy?" },
"Causal Questions": { "quote": "Investigating cause and effect: Why did the Roman Empire fall? What causes climate change?" },
"Hypothetical Questions": { "quote": "Considering possibilities and scenarios: What would happen if bees went extinct? How might society function without electricity?" },
"Ethical Questions": { "quote": "Examining moral principles and dilemmas: Is it ever justified to limit free speech? What obligations do we have to future generations?" },
"Personal Questions": { "quote": "Inquiring about individual circumstances: What are your goals? How are you feeling today?" },
"Rhetorical Questions": { "quote": "Asked for effect rather than to elicit information: Isn't it time we took action? Who wouldn't want to succeed?" },
"Leading Questions": { "quote": "Suggesting a particular answer: You agree that this policy is harmful, don't you? Wasn't that movie brilliant?" },
"Open-Ended Questions": { "quote": "Inviting expansive responses: What factors influence human happiness? How might we improve education?" },
"Closed Questions": { "quote": "Requiring brief, specific responses: Did you complete the assignment? Is this statement true or false?" },
"Socratic Questions": { "quote": "Promoting critical thinking through inquiry: What assumptions underlie that conclusion? How do you define success?" },
"Clarifying Questions": { "quote": "Seeking to better understand: Could you explain what you mean by that term? In what sense do you use 'freedom'?" },
"Probing Questions": { "quote": "Exploring deeper implications: What led you to that conclusion? What evidence supports that view?" },
"Reflective Questions": { "quote": "Encouraging introspection: How has this experience changed you? What would you do differently next time?" },
"Strategic Questions": { "quote": "Examining plans and approaches: What are our options? How can we achieve this goal given our constraints?" },
"Existential Questions": { "quote": "Examining the nature and purpose of existence: What gives life meaning? Why is there something rather than nothing?" },
"Scientific Questions": { "quote": "Investigating natural phenomena: How do black holes form? What cellular mechanisms regulate gene expression?" },
"Historical Questions": { "quote": "Examining past events and their significance: How did the Industrial Revolution transform society? What factors led to the fall of apartheid?" },
"Philosophical Questions": { "quote": "Exploring fundamental concepts: What is the nature of reality? How do we know what we know?" },
"Practical Questions": { "quote": "Seeking actionable information: How do I fix this device? What steps should I take to improve my skills?" },
"Devil's Advocate Questions": { "quote": "Challenging assumptions by taking contrary positions: What if the opposite is true? How would critics respond to your argument?" },
"Diagnostic Questions": { "quote": "Identifying problems and causes: Where exactly does it hurt? What errors appear in the log file?" },
"Evaluative Questions": { "quote": "Assessing quality or value: How effective is this approach? What are the strengths and weaknesses of this theory?" },
"Follow-Up Questions": { "quote": "Building on previous responses: You mentioned X; could you elaborate? How does that relate to what you said earlier?" },
"Survey Questions": { "quote": "Gathering information from populations: How satisfied were you with our service? Which features do you use most often?" },
"Background Questions": { "quote": "Establishing context: What experience do you have in this field? What prompted your interest in this topic?" },
"Priority Questions": { "quote": "Determining importance and order: Which goal should we address first? What matters most to you in this decision?" },
"Meta-Questions": { "quote": "Questions about questions: Is this the right question to be asking? How should we approach this inquiry?" },
"Knowledge Gap Questions": { "quote": "Identifying what is unknown: What don't we know yet? What information are we missing to make this decision?" }
}
