{
"Names of Ra": { "quote": "Hail to thee, Ra, perfect each day, who rises at dawn without failing. Khepri in the morning, Ra at noon, Atum in the evening. (Great Hymn to Ra)" },
"Divine Identity": { "quote": "I am Ra-Atum, I was alone in Nun. I am the Great God, the Self-Created One. (Pyramid Texts, Utterance 587)" },
"Divine Creation": { "quote": "I brought myself into being from primordial matter. I created my name as the Lord of All. (Book of the Dead, Chapter 17)" },
"Divine Forms": { "quote": "Ra has appeared in his forms of manifestation. The sacred falcon appears. The light-spirit shines. (Coffin Texts, Spell 335)" },
"Divine Journey": { "quote": "Ra travels across the sky in his solar barque, through the twelve hours of day and twelve hours of night. (Book of Gates)" },
"Divine Power": { "quote": "I am the Lord of Light, crossing millions of years in my existence. I am the Lord to the limit of the heavens. (Litany of Ra)" },
"Divine Authority": { "quote": "I am the Lord of Heaven, Lord of Earth, King of righteousness, Lord of Eternity, Prince of Everlastingness. (Book of the Dead)" },
"Divine Light": { "quote": "I shine at dawn to give life to humanity, rising from the ocean of Nun each day. (Great Hymn to Ra)" },
"Divine Order": { "quote": "I established Maat throughout the Two Lands. I drove away chaos and banished evil. (Book of Gates)" },
"Divine Wisdom": { "quote": "I am the one who knows the Paths of Heaven, every wind that rises is my breath. (Coffin Texts)" },
"Divine Protection": { "quote": "I am the protector of humanity, who hears the prayers of those who call upon me. (Book of the Dead, Chapter 15)" },
"Divine Justice": { "quote": "I am he who judges in the divine court, who weighs truth against chaos. (Book of Coming Forth by Day)" },
"Divine Transformation": { "quote": "I transform myself into Khepri, I become Atum, I rise as Ra to illuminate the Two Lands. (Pyramid Texts)" },
"Divine Cycle": { "quote": "I am born each day, I sail across the sky, I battle Apophis, I set in the west to be reborn. (Book of Amduat)" },
"Divine Manifestations": { "quote": "My forms are manifold, my transformations are infinite in the realm of light. (Book of Gates)" },
"Divine Kingship": { "quote": "I am the King of the Gods, who came into being in the beginning, whose word is law in heaven and earth. (Temple Texts of Karnak)" },
"Divine Life": { "quote": "I give life to humanity, I breathe air into their nostrils, I fill the land with my blessings. (Great Hymn to Ra)" },
"Divine Combat": { "quote": "I fight the serpent Apophis each night, ensuring the sun will rise again. (Book of Amduat)" },
"Divine Unity": { "quote": "All gods are three: Amun, Ra and Ptah. They have no equal. Hidden is his name as Amun, Ra belongs to him as face, Ptah as body. (Leiden Papyrus)" },
"Divine Knowledge": { "quote": "I know what is in the depths, I understand what is in darkness, I see what is in the far distance. (Coffin Texts)" },
"Divine Time": { "quote": "I am the maker of hours, the counter of days, the one who brings the years to pass. (Book of the Dead)" },
"Divine Elements": { "quote": "Fire is my head, water flows from me, air is my breath, earth my body. (Pyramid Texts)" },
"Divine Balance": { "quote": "I maintain the balance between order and chaos, between day and night, between life and death. (Book of Gates)" },
"Divine Renewal": { "quote": "I renew myself each day, I am eternally young yet infinitely old. (Litany of Ra)" },
"Divine Presence": { "quote": "I am present in every god, I am the force that animates their forms. (Coffin Texts)" },
"Divine Vision": { "quote": "My right eye is the sun of day, my left eye is the moon of night. (Book of the Dead)" },
"Divine Voice": { "quote": "When I speak, the gods listen. When I command, heaven and earth tremble. (Temple Inscriptions)" },
"Divine Eternity": { "quote": "I am the yesterday, I know the tomorrow. The battlefield of the gods was made when I spoke. (Book of the Dead, Chapter 17)" },
"Divine Essence": { "quote": "I am the essence of every god, the origin of all that shall be, the eternal one who has no equal. (Pyramid Texts)" },
"Divine Legacy": { "quote": "My throne endures for millions of years, my kingdom is eternal as the stars. (Great Hymn to Ra)" }
}
