{
"Raja Yoga": {
"short_description": "The royal path of systematic mental and spiritual development through meditation, leading to complete mastery of consciousness and direct realization of ultimate reality."
},
"Samadhi": {
"short_description": "The state of complete absorption and union with the object of meditation, where individual consciousness merges with universal consciousness through progressive stages of deepening awareness."
},
"Samyama": {
"short_description": "The combined practice of dharana (concentration), dhyana (meditation), and samadhi (absorption) applied to specific objects to gain perfect knowledge and mastery over them."
},
"Ashtanga": {
"short_description": "The eight-limbed path of Raja Yoga systematically leading to enlightenment, including external disciplines, internal practices, and progressive states of consciousness."
},
"Yama": {
"short_description": "The five fundamental ethical restraints: ahimsa (non-violence), satya (truthfulness), asteya (non-stealing), brahmacharya (sexual restraint), and aparigraha (non-possessiveness)."
},
"Niyama": {
"short_description": "The five personal observances: saucha (purity), santosha (contentment), tapas (spiritual austerity), svadhyaya (self-study), and ishvara pranidhana (surrender to the divine)."
},
"Asana": {
"short_description": "The cultivation of a steady, comfortable posture for meditation, enabling prolonged practice without physical distraction or discomfort."
},
"Pranayama": {
"short_description": "The science of breath control and energy management, harmonizing the vital forces to support higher states of consciousness and meditation."
},
"Pratyahara": {
"short_description": "The withdrawal of sensory awareness from external objects, redirecting attention inward to prepare for deeper meditation practices."
},
"Dharana": {
"short_description": "One-pointed concentration on a single object, developing the mental strength and stability necessary for sustained meditation."
},
"Dhyana": {
"short_description": "Continuous flow of attention toward the object of meditation, where observer and observed begin to merge in sustained awareness."
},
"Chitta": {
"short_description": "The mental substance comprising intellect, ego, and mind, which must be purified and controlled through yogic practice to achieve realization."
},
"Vritti": {
"short_description": "The modifications or fluctuations of consciousness that create mental disturbance and prevent clear perception of reality."
},
"Nirodha": {
"short_description": "The cessation of mental modifications, resulting in the mind becoming still like a perfectly clear crystal reflecting pure awareness."
},
"Klesha": {
"short_description": "The five primary causes of suffering: ignorance, ego, attachment, aversion, and fear of death, which must be overcome through yogic practice."
},
"Siddhis": {
"short_description": "Supernatural powers or perfections that arise naturally through advanced practice, but which must be transcended to achieve final liberation."
},
"Prajna": {
"short_description": "The highest wisdom or insight that arises through perfect meditation, directly perceiving the true nature of reality beyond conceptual understanding."
},
"Viveka": {
"short_description": "The discriminative faculty that distinguishes between the real and unreal, essential for progress in Raja Yoga practice."
},
"Vairagya": {
"short_description": "Complete dispassion and non-attachment to all worldly objects and experiences, enabling the mind to settle into its true nature."
},
"Samprajnata": {
"short_description": "Samadhi with support or seed, where consciousness is absorbed in an object while maintaining subtle distinction."
},
"Asamprajnata": {
"short_description": "Samadhi without support or seed, where all mental modifications cease completely and pure consciousness rests in itself."
},
"Dharma Megha": {
"short_description": "The cloud of virtue or final samadhi that brings the rain of ultimate realization, dissolving all remaining karmic seeds."
},
"Kaivalya": {
"short_description": "The state of absolute independence and liberation, where consciousness abides in its own true nature free from all conditioning."
},
"Pratiprasava": {
"short_description": "The reverse movement of the gunas back to their source, resulting in the dissolution of manifest existence in consciousness."
},
"Purusa": {
"short_description": "The pure consciousness or witness that is eternally free and unchanging, distinct from all modifications of nature."
}
}
