{
"Permadeath": { "quote": "Character death is permanent, requiring a complete restart. In The Binding of Isaac, each failed run means beginning again with no carried progress." },
"Procedural Generation": { "quote": "Levels are algorithmically created for each playthrough. Spelunky's randomized caves ensure no two expeditions are identical." },
"Run-Based Structure": { "quote": "A complete gameplay cycle from start to finish in a single session. Hades structures each escape attempt as a discrete run with its own build and narrative moments." },
"Meta-Progression": { "quote": "Permanent upgrades or unlocks between runs. Dead Cells allows players to unlock new weapons and abilities that appear in subsequent runs." },
"Randomized Loot": { "quote": "Items and equipment generated with variable attributes. Enter the Gungeon's hundreds of unique weapons appear with different properties and synergies each run." },
"Build Variety": { "quote": "Different combinations of abilities and items creating unique playstyles. Slay the Spire's card combinations create thousands of possible deck builds." },
"High Difficulty": { "quote": "Challenging gameplay demanding mastery for success. Darkest Dungeon's brutal combat and stress mechanics punish mistakes severely." },
"Resource Management": { "quote": "Limited supplies requiring careful allocation. Risk of Rain 2's time-scaling difficulty creates tension between gathering resources and progressing quickly." },
"Knowledge Accumulation": { "quote": "Learning enemy patterns, item effects, and optimal strategies across multiple runs. In NetHack, player knowledge of the game's systems matters more than character stats." },
"Tactical Decision-Making": { "quote": "Moment-to-moment choices with significant consequences. FTL: Faster Than Light presents dilemmas where each decision can lead to valuable rewards or catastrophic failure." },
"Emergent Storytelling": { "quote": "Narratives arising from the interplay of systems rather than scripted events. Caves of Qud generates histories for artifacts and locations that create a living world." },
"Character Classes": { "quote": "Distinct starting abilities and playstyles. Dungeon Crawl Stone Soup offers dozens of species and background combinations that radically change gameplay." },
"Turn-Based Origins": { "quote": "Historical roots in turn-based movement and combat. Traditional roguelikes like ADOM give players unlimited time to consider each move." },
"ASCII Graphics": { "quote": "Classic roguelikes used text characters for visuals. Dwarf Fortress's ASCII mode represents creatures and terrain with symbols rather than images." },
"Grid-Based Movement": { "quote": "Character positioning on a discrete grid. Brogue's tactical combat relies on precise positioning on its grid system." },
"Identification Systems": { "quote": "Items with unknown properties requiring discovery. In traditional roguelikes like Angband, potions and scrolls must be identified through use or magic." },
"Hunger Mechanics": { "quote": "Food requirements creating time pressure. In Shiren the Wanderer, managing hunger prevents players from lingering too long in dungeons." },
"Roguelite Variations": { "quote": "Modern interpretations that soften traditional elements. Rogue Legacy allows characters to pass traits and upgrades to their descendants upon death." },
"Synergy Discovery": { "quote": "Finding powerful combinations between items and abilities. The interactions between passive items in The Binding of Isaac can transform a run dramatically." },
"Adaptation": { "quote": "Requiring players to work with what they find rather than pre-planning. Into the Breach's random pilot abilities and weapons force adaptive strategies." },
"High Replayability": { "quote": "Endlessly fresh experiences through system variation. Returnal's shifting biomes and weapon traits create millions of possible run configurations." },
"Risk vs. Reward": { "quote": "Decisions balancing potential gains against dangers. Curse of the Dead Gods tempts players with better rewards for taking on additional curses." },
"Mysterious Interactions": { "quote": "Complex and sometimes hidden system behaviors to discover. Noita's physics-based alchemy system allows for experimental potion creation with unexpected results." },
"Dynamic Difficulty": { "quote": "Challenge that adapts to player performance. Nuclear Throne's difficulty scales with progression and radiation collection." },
"Seed Systems": { "quote": "Numerical codes that can reproduce specific procedural layouts. Enter the Gungeon allows sharing seeds to replicate particularly interesting dungeon configurations." },
"Challenge Modes": { "quote": "Optional restrictions or modifications that increase difficulty. Crypt of the NecroDancer's alternate characters completely change how the game is played." },
"Daily Challenges": { "quote": "Standardized runs available to all players for a limited time. Spelunky 2's daily challenges create competitive leaderboards on identical seeds." },
"Enemy Variety": { "quote": "Diverse foes requiring different tactical approaches. Isaac's bestiary features enemies with unique attack patterns and behaviors." },
"Limited Information": { "quote": "Restricted knowledge about upcoming threats and rewards. In Going Under, players never know what weapons or enemies will appear in the next room." },
"Power Spikes": { "quote": "Dramatic increases in character strength through item combinations. Risk of Rain 2's equipment stacking can create exponentially powerful builds." }
}
