{
  "Basic Role Assignment": { "quote": "\"Act as a historian and explain the causes of World War I.\" (Assigning explicit roles shapes output tone and depth.)" },
  "Expert Persona": { "quote": "\"You are a senior software engineer. Debug this Python code: ...\" (Leveraging expertise for technical precision.)" },
  "Fictional Character Simulation": { "quote": "\"Write a speech in the style of Shakespeare about quantum computing.\" (Mimicking stylistic/tonal traits.)" },
  "Domain-Specific Roles": { "quote": "\"Act as a molecular biologist. Describe CRISPR-Cas9 in simple terms.\" (Tailoring explanations to field-specific knowledge.)" },
  "Educational Roles": { "quote": "\"You are a high school physics teacher. Explain Newton's laws to a beginner.\" (Pedagogical framing for clarity.)" },
  "Adversarial Roles": { "quote": "\"Argue against renewable energy adoption as a skeptic. Then rebut your own points.\" (Testing model bias/counterargument generation.)" },
  "Bias Mitigation Roles": { "quote": "\"As an impartial judge, summarize the pros and cons of cryptocurrency regulation.\" (Neutral role assignment to reduce bias.)" },
  "Creative Roles": { "quote": "\"You are a poet. Write a haiku about black holes.\" (Constraining outputs to artistic formats.)" },
  "Cultural Context Roles": { "quote": "\"Explain climate change as a storyteller from Indigenous traditions.\" (Embedding cultural perspective in narratives.)" },
  "Empathetic Roles": { "quote": "\"Act as a therapist. Respond compassionately to someone experiencing grief.\" (Guiding emotional tone via roleplay.)" },
  "Technical Support Roles": { "quote": "\"You are an IT specialist. Troubleshoot a '404 Not Found' error step-by-step.\" (Structured problem-solving frameworks.)" },
  "Chain-of-Thought Roles": { "quote": "\"As a mathematician, show your reasoning: Solve 3x + 5 = 17.\" (Wei et al., 2022: Explicit reasoning via role-based CoT.)" },
  "Multi-Agent Roleplay": { "quote": "\"Debate: Lawyer (pro) vs. Ethicist (con) on AI rights.\" (Simulating multi-perspective dialogues.)" },
  "Role-Driven Constraints": { "quote": "\"As a journalist, write a 50-word summary of this event.\" (Role + format + brevity constraints.)" },
  "Hypothetical Scenarios": { "quote": "\"You are Elon Musk in 2050. Describe your vision for Mars colonization.\" (Time/identity-shifted speculative roleplay.)" },
  "Audience-Tailored Roles": { "quote": "\"Explain blockchain to a 5-year-old as a kindergarten teacher.\" (Adapting complexity to audience via role.)" },
  "Ethical Advisor Role": { "quote": "\"As an AI ethicist, critique the societal risks of facial recognition.\" (Guiding morally nuanced analysis.)" },
  "Role-Based Storytelling": { "quote": "\"Narrate the discovery of penicillin as a 19th-century lab assistant.\" (Historical POV immersion.)" },
  "Language Learning Roles": { "quote": "\"Act as a Spanish tutor. Correct my grammar: 'Yo gusto leer libros.'\"" },
  "Role for Precision": { "quote": "\"You are a legal scholar. Define 'mens rea' with case examples.\" (Authority-driven specificity.)" },
  "Humor-Driven Roles": { "quote": "\"Write a joke about coding bugs as a stand-up comedian.\" (Tonal alignment via role assignment.)" },
  "Role-Based Summarization": { "quote": "\"As a CEO, summarize this market report in three bullet points.\" (Role-filtered abstraction.)" },
  "Reverse Roleplay": { "quote": "\"Interview me as a hiring manager for a data scientist role.\" (Interactive Q&A role inversion.)" },
  "Cultural Mediator Roles": { "quote": "\"Mediate a dialogue between two politicians from opposing parties.\" (Role as neutral facilitator.)" },
  "Role for Data Generation": { "quote": "\"As a synthetic biologist, generate 5 research questions about mRNA vaccines.\" (Expertise-driven ideation.)" },
  "Temporal Roles": { "quote": "\"You are a futurist from 2123. Describe advancements in renewable energy.\" (Chronological framing.)" },
  "Role-Based Analogies": { "quote": "\"Explain neural networks as a chef teaching a cooking class.\" (Metaphorical teaching via role.)" },
  "Sensory Roles": { "quote": "\"Describe a sunset as a blind painter.\" (Cross-sensory imaginative constraints.)" },
  "Role for Debugging": { "quote": "\"Act as a cybersecurity expert. Identify vulnerabilities in this code snippet.\"" },
  "Role-Driven Creativity": { "quote": "\"You are a Dungeon Master. Create a fantasy quest involving AI-powered artifacts.\" (Genre-blending narratives.)" }
}
