{
"Divine Nature": { "quote": "You have made us for yourself, O Lord, and our heart is restless until it rests in you. (Confessions, Book I)" },
"Faith and Reason": { "quote": "Believe that you may understand; understand that you may believe. (Sermon 43.7, 9)" },
"Time": { "quote": "What then is time? If no one asks me, I know what it is. If I wish to explain it to him who asks, I do not know. (Confessions, Book XI)" },
"Evil": { "quote": "Evil has no positive nature; but the loss of good has received the name 'evil.' (City of God, Book XI)" },
"Free Will": { "quote": "Free will, though it makes evil possible, is also the only thing that makes possible any love or goodness or joy worth having. (On Free Choice of the Will)" },
"Grace": { "quote": "What are we to say of God's grace? Without it, no one is converted to God or makes any progress in God. (On Nature and Grace)" },
"Memory": { "quote": "The memory is, as it were, the stomach of the mind, and joy and sadness are like sweet and bitter food. (Confessions, Book X)" },
"Divine Illumination": { "quote": "The mind needs to be enlightened by light from outside itself, so that it can participate in truth, because it is not itself the nature of truth. (Soliloquies)" },
"Human Nature": { "quote": "Man's nature, indeed, was created at first faultless and without any sin; but that nature of man in which everyone is born from Adam, now wants the Physician, because it is not healthy. (Nature and Grace)" },
"Original Sin": { "quote": "Original sin is the hereditary sin passed down from Adam's transgression to all humanity. (City of God, Book XIII)" },
"Love": { "quote": "Love God and do whatever you please: for the soul trained in love to God will do nothing to offend the One who is Beloved. (Letter 130)" },
"Truth": { "quote": "Truth is like a lion; you don't have to defend it. Let it loose; it will defend itself. (Attributed)" },
"Divine Providence": { "quote": "God judged it better to bring good out of evil than to suffer no evil to exist. (Enchiridion)" },
"Happiness": { "quote": "To fall in love with God is the greatest romance; to seek him the greatest adventure; to find him, the greatest human achievement. (Attributed)" },
"Justice": { "quote": "What are kingdoms without justice? They're just gangs of bandits. (City of God, Book IV)" },
"Knowledge": { "quote": "I learned most, not from those who taught me but from those who talked with me. (De Magistro)" },
"Salvation": { "quote": "God has promised forgiveness to your repentance, but He has not promised tomorrow to your procrastination. (Sermons)" },
"Church": { "quote": "The Church is the Body of Christ, and as such it has two aspects: one that is visible and institutional, another that is invisible and mystical. (On Christian Doctrine)" },
"Scripture": { "quote": "The Holy Scriptures are our letters from home. (Exposition on Psalm 90)" },
"Predestination": { "quote": "God has predestined some to eternal life, while permitting others to remain in their sins. (On the Predestination of the Saints)" },
"Beauty": { "quote": "Beauty is indeed a good gift of God; but that the good may not think it a great good, God dispenses it even to the wicked. (City of God)" },
"Prayer": { "quote": "Pray as though everything depended on God. Work as though everything depended on you. (Attributed)" },
"Divine Wisdom": { "quote": "Understanding is the reward of faith. Therefore, seek not to understand that you may believe, but believe that you may understand. (On the Gospel of John)" },
"Human Soul": { "quote": "The soul is the substance of life in which reason dwells. (On the Quantity of the Soul)" },
"Conversion": { "quote": "Too late have I loved you, O Beauty ever ancient, ever new, too late have I loved you! (Confessions, Book X)" },
"Mortality": { "quote": "Death is not to be regarded as an evil when it follows a good life, for the only thing that makes death evil is what follows death. (City of God)" },
"Divine Order": { "quote": "Order in society is what peace is to people. (City of God)" },
"Theological Method": { "quote": "Faith seeks, understanding finds. (On Free Will)" },
"Christian Life": { "quote": "Love, and do what you will. (Homily on 1 John)" },
"Eternal Life": { "quote": "Our hearts are restless till they find their rest in Thee. (Confessions, Book I)" }
}
