{
"Five Ways": { "quote": "The existence of God can be proved in five ways: Motion, Causation, Contingency, Gradation, and Design. (Summa Theologica, I, Q.2, Art.3)" },
"Natural Law": { "quote": "The natural law is nothing else than the rational creature's participation in the eternal law. (Summa Theologica, I-II, Q.91, Art.2)" },
"Faith and Reason": { "quote": "Faith and reason are like two wings on which the human spirit rises to the contemplation of truth. (Summa Contra Gentiles, Book I, Ch.7)" },
"Divine Nature": { "quote": "God is pure act without any potentiality whatsoever. (Summa Theologica, I, Q.3, Art.1)" },
"Human Nature": { "quote": "Man is composed of a spiritual soul and physical matter, forming a single nature. (Summa Theologica, I, Q.75, Art.4)" },
"Free Will": { "quote": "Man has free will, otherwise counsels, exhortations, commands, prohibitions, rewards, and punishments would be in vain. (Summa Theologica, I, Q.83, Art.1)" },
"Divine Providence": { "quote": "God governs all things by His Providence, and nothing in the world happens by chance. (Summa Theologica, I, Q.22, Art.2)" },
"Truth": { "quote": "Truth is the adequation of thing and intellect. (De Veritate, Q.1, Art.1)" },
"Being": { "quote": "Existence is the most perfect of all things, for it is compared to all things as that by which they are made actual. (On Being and Essence, Ch.4)" },
"Soul": { "quote": "The soul is the first principle of life in those things which live. (Summa Theologica, I, Q.75, Art.1)" },
"Virtue": { "quote": "Virtue is that which makes its possessor good, and his work good likewise. (Summa Theologica, I-II, Q.55, Art.3)" },
"Knowledge": { "quote": "All our knowledge begins with the senses, proceeds then to understanding, and ends with reason. (Summa Theologica, I, Q.84, Art.7)" },
"Justice": { "quote": "Justice is a habit whereby a man renders to each one his due by a constant and perpetual will. (Summa Theologica, II-II, Q.58, Art.1)" },
"Law": { "quote": "Law is an ordinance of reason for the common good, made by him who has care of the community. (Summa Theologica, I-II, Q.90, Art.4)" },
"Grace": { "quote": "Grace does not destroy nature but perfects it. (Summa Theologica, I, Q.1, Art.8)" },
"Evil": { "quote": "Evil is a privation of the good that ought to be present. (Summa Theologica, I, Q.48, Art.1)" },
"Happiness": { "quote": "The ultimate end of human life is happiness or beatitude. (Summa Theologica, I-II, Q.1, Art.8)" },
"Essence and Existence": { "quote": "In God alone, essence and existence are identical. (On Being and Essence, Ch.4)" },
"Angels": { "quote": "Angels are pure forms, subsisting without matter. (Summa Theologica, I, Q.50, Art.2)" },
"Creation": { "quote": "Creation is not a change, but the very dependency of created being on the principle from which it is set up. (Summa Theologica, I, Q.45, Art.3)" },
"Natural Theology": { "quote": "Sacred doctrine is a science because it proceeds from principles known by the light of a higher science, namely, the science of God. (Summa Theologica, I, Q.1, Art.2)" },
"Moral Action": { "quote": "The morality of an act is determined by three things: its object, its end, and its circumstances. (Summa Theologica, I-II, Q.18, Art.4)" },
"Divine Simplicity": { "quote": "God is absolutely simple, admitting of no composition whatsoever. (Summa Theologica, I, Q.3, Art.7)" },
"Human Intellect": { "quote": "The human intellect is the lowest of intellectual beings. (Summa Theologica, I, Q.76, Art.5)" },
"Divine Law": { "quote": "Divine law was necessary for the direction of human life. (Summa Theologica, I-II, Q.91, Art.4)" },
"Political Theory": { "quote": "Man is by nature a political animal, as the Philosopher says. (Commentary on Aristotle's Politics)" },
"Sacraments": { "quote": "A sacrament is a sign of a sacred thing in so far as it sanctifies men. (Summa Theologica, III, Q.60, Art.2)" },
"Metaphysics": { "quote": "Metaphysics deals with being as being. (Commentary on Aristotle's Metaphysics)" },
"Divine Attributes": { "quote": "God is not only His own essence but also His own existence. (Summa Theologica, I, Q.3, Art.4)" },
"Natural Rights": { "quote": "Every man has by nature the right to what is necessary for his preservation. (Summa Theologica, II-II, Q.66, Art.7)" }
}
