{
"Nature of Reality": { "quote": "Brahman is Reality (Sat), Consciousness (Chit), and Bliss (Ananda). (Taittiriya Upanishad 2.1)" },
"Existence Absolute": { "quote": "That which exists is One, without a second. (Chandogya Upanishad 6.2.1)" },
"Pure Consciousness": { "quote": "Consciousness is Brahman. (Aitareya Upanishad 3.1.3)" },
"Supreme Bliss": { "quote": "Brahman is Bliss. From Bliss all beings are born, by Bliss they are sustained, and into Bliss they enter after death. (Taittiriya Upanishad 3.6)" },
"Unified Reality": { "quote": "Where one sees nothing else, hears nothing else, understands nothing else - that is the Infinite. (Chandogya Upanishad 7.24.1)" },
"Eternal Truth": { "quote": "That which remains unchanging during the three periods of time, past, present and future, is called Sat. (Yoga Vasishtha)" },
"Pure Awareness": { "quote": "The Self is self-luminous without darkness and light, and is the reality which is self-manifest. (Atma Upanishad)" },
"Divine Joy": { "quote": "The knower of Brahman attains the Supreme. (Taittiriya Upanishad 2.1)" },
"Ultimate Identity": { "quote": "That thou art - Tat Tvam Asi. (Chandogya Upanishad 6.8.7)" },
"Transcendent Being": { "quote": "Higher than the high, deeper than the deep, this Self is infinite like space. (Maha Upanishad)" },
"Essential Nature": { "quote": "The Self is not this, not this (neti neti). It is incomprehensible, for it cannot be comprehended. (Brihadaranyaka Upanishad 4.4.22)" },
"Universal Consciousness": { "quote": "As the sun illumines the whole world, so does the Self illuminate the whole universe. (Katha Upanishad 2.2.15)" },
"Absolute Happiness": { "quote": "Other joys are but particles of Its bliss. (Brihadaranyaka Upanishad 4.3.32)" },
"Divine Essence": { "quote": "That which makes the eye see but cannot be seen by the eye, know That to be Brahman. (Kena Upanishad 1.6)" },
"Supreme Knowledge": { "quote": "By knowing That which is subtle, you will know everything. (Chandogya Upanishad 6.1.3)" },
"Infinite Being": { "quote": "The Infinite is where one sees nothing else, hears nothing else, understands nothing else. (Chandogya Upanishad 7.24.1)" },
"Pure Experience": { "quote": "It is the witness of all experiences but is itself beyond experience. (Mandukya Upanishad)" },
"Divine Fullness": { "quote": "That is full, this is full. From fullness comes fullness. (Isha Upanishad)" },
"Eternal Present": { "quote": "The Self is the eternal 'now', beyond time, space and causation. (Yoga Vasishtha)" },
"Ultimate Reality": { "quote": "All this is Brahman. This Self is Brahman. (Mandukya Upanishad 1.2)" },
"Divine Light": { "quote": "The light of consciousness is one, illumining all minds. (Yoga Vasishtha)" },
"Supreme Peace": { "quote": "Peace, peace, peace - the peace that passeth understanding. (Prasna Upanishad)" },
"Absolute Truth": { "quote": "Truth alone triumphs, not untruth. (Mundaka Upanishad 3.1.6)" },
"Divine Unity": { "quote": "All this is strung on Me like pearls on a thread. (Bhagavad Gita 7.7)" },
"Cosmic Being": { "quote": "In the beginning, this was Self alone, in the shape of a person. (Brihadaranyaka Upanishad 1.4.1)" },
"Perfect Wholeness": { "quote": "That is whole, this is whole. From wholeness comes wholeness. (Isha Upanishad)" },
"Divine Reality": { "quote": "This Self is Brahman indeed. (Mandukya Upanishad 1.2)" },
"Eternal Now": { "quote": "The Self is the eternal now, beyond the divisions of time. (Yoga Vasishtha)" },
"Ultimate Consciousness": { "quote": "Consciousness is the lamp that illumines all. (Yoga Vasishtha)" },
"Supreme Self": { "quote": "The Self alone exists. All else is Its manifestation. (Vivekachudamani)" }
}
