{
"Educational Scaffolding": { "quote": "Temporary support structures that assist learners in developing understanding and skills until they can achieve them independently. (Vygotsky's Zone of Proximal Development)" },
"Instructional Scaffolding": { "quote": "Supports provided by teachers to bridge the gap between what students can do independently and what they can do with assistance. (Wood, Bruner, & Ross, 1976)" },
"Cognitive Scaffolding": { "quote": "Mental frameworks that help organize information and build knowledge. Concept maps provide visual organization of ideas and their relationships." },
"Procedural Scaffolding": { "quote": "Step-by-step guidance that helps learners complete complex tasks. Cooking recipes break down meal preparation into manageable steps." },
"Conceptual Scaffolding": { "quote": "Support for understanding abstract ideas through concrete examples. Using water flow to explain electricity helps visualize invisible phenomena." },
"Metacognitive Scaffolding": { "quote": "Guidance that promotes self-monitoring and reflection on learning. Question prompts like 'How did you arrive at this solution?' encourage thinking about thinking." },
"Strategic Scaffolding": { "quote": "Tools that help learners develop problem-solving approaches. Polya's four-step process guides mathematical problem-solving: understand, plan, execute, reflect." },
"Motivational Scaffolding": { "quote": "Support for maintaining interest and engagement. Breaking large tasks into achievable milestones creates regular success experiences." },
"Technological Scaffolding": { "quote": "Digital tools that provide support at the moment of need. Spell-checkers highlight errors and suggest corrections during writing." },
"Fading": { "quote": "The gradual removal of scaffolds as learners develop competence. Training wheels on bicycles are eventually removed as balance improves." },
"Reciprocal Scaffolding": { "quote": "Mutual support among peers with different knowledge and skills. Pair programming allows novice and experienced programmers to learn from each other." },
"Hard Scaffolding": { "quote": "Static supports planned in advance. Worksheets with partially worked examples guide students through problem-solving." },
"Soft Scaffolding": { "quote": "Dynamic, in-the-moment support based on learner needs. A teacher asking targeted questions based on a student's specific confusion." },
"Developmental Scaffolding": { "quote": "Support structures aligned with cognitive developmental stages. Concrete manipulatives help young children understand abstract mathematical concepts." },
"Linguistic Scaffolding": { "quote": "Language-based supports for communication and understanding. Sentence starters help language learners formulate complete thoughts." },
"Cultural Scaffolding": { "quote": "Frameworks that help navigate unfamiliar cultural contexts. Cultural orientation programs support international students in adapting to new educational environments." },
"Environmental Scaffolding": { "quote": "Physical arrangements that support learning. Word walls provide visual references for vocabulary development." },
"Emotional Scaffolding": { "quote": "Support for managing feelings during learning challenges. Normalizing struggle helps learners persist through difficulty." },
"Social Scaffolding": { "quote": "Interpersonal supports that facilitate learning. Think-pair-share activities provide conversational practice before whole-group discussion." },
"Game Design Scaffolding": { "quote": "Progressive challenges that build player skills and understanding. Tutorial levels introduce mechanics individually before combining them in complex scenarios." },
"Scaffolding in Writing": { "quote": "Structured supports for developing written communication. The 'hamburger paragraph' model provides a framework for organizing ideas." },
"Scaffolding in Reading": { "quote": "Techniques that support text comprehension. Pre-reading activities activate prior knowledge before engaging with complex texts." },
"Scaffolding in Mathematics": { "quote": "Supports for developing mathematical thinking. Concrete-Representational-Abstract sequence moves from physical objects to symbols." },
"Scaffolding in Science": { "quote": "Frameworks that support scientific inquiry. The scientific method provides a structure for investigation and discovery." },
"Digital Scaffolding": { "quote": "Technology-based supports that adapt to learner needs. Intelligent tutoring systems provide personalized guidance based on performance patterns." },
"Universal Design for Learning": { "quote": "Multiple means of engagement, representation, and action/expression accommodate diverse learner needs." },
"Curriculum Scaffolding": { "quote": "Intentional sequencing of content and skills throughout educational programs. Spiral curriculum revisits concepts with increasing complexity." },
"Assessment Scaffolding": { "quote": "Supports that help learners demonstrate understanding. Rubrics clarify expectations and guide performance." },
"Professional Scaffolding": { "quote": "Structured support for workplace learning. Mentorship programs pair novices with experienced professionals." },
"Life-long Learning Scaffolding": { "quote": "Frameworks that support continuous development across the lifespan. Learning how to learn provides meta-skills for ongoing knowledge acquisition." }
}
