{
"Names of Shiva": { "quote": "Shiva has a thousand names - Mahadeva, Rudra, Nataraja, Neelakantha, each revealing an aspect of His infinite nature. (Shiva Sahasranama)" },
"Divine Trinity": { "quote": "Shiva is one of the Trimurti - the destroyer, alongside Brahma the creator and Vishnu the preserver. (Shiva Purana 1:2)" },
"Divine Form": { "quote": "With throat blue from holding the world's poison, crescent moon in his matted locks, third eye of wisdom, and sacred Ganga flowing from his hair. (Shiva Purana)" },
"Divine Dance": { "quote": "As Nataraja, His cosmic dance creates, sustains, and dissolves the universe. (Ananda Coomaraswamy on Nataraja)" },
"Divine Asceticism": { "quote": "The great yogi, seated in meditation on Mount Kailash, beyond all worldly attachments. (Shiva Purana)" },
"Divine Power": { "quote": "The power of destruction and transformation, manifesting as both terrible and benevolent. (Rudra Samhita)" },
"Divine Family": { "quote": "With his consort Parvati, sons Ganesha and Kartikeya, he exemplifies divine family life. (Shiva Purana)" },
"Divine Symbols": { "quote": "The trident represents the three gunas, the damaru drum the sound of creation, the snake kundalini power. (Shiva Tattva)" },
"Divine Transcendence": { "quote": "Beyond form and formless, beyond time and timeless, the absolute reality. (Shvetashvatara Upanishad 3:2)" },
"Divine Protection": { "quote": "Those who take refuge in Shiva are protected from all worldly afflictions. (Shiva Purana)" },
"Divine Presence": { "quote": "Shiva dwells in all beings as their innermost Self. (Shvetashvatara Upanishad 4:10)" },
"Divine Energy": { "quote": "United with Shakti, he represents the union of consciousness and energy. (Tantric Tradition)" },
"Divine Knowledge": { "quote": "The supreme teacher who imparts the highest wisdom to worthy disciples. (Guru Gita)" },
"Divine Grace": { "quote": "By His grace alone, spiritual liberation is attained. (Tirumular's Tirumantiram)" },
"Divine Abode": { "quote": "Mount Kailash, His sacred dwelling place, represents the pinnacle of spiritual aspiration. (Shiva Purana)" },
"Divine Time": { "quote": "Mahakala, the great time, devourer of all things. (Shiva Purana)" },
"Divine Sound": { "quote": "The primordial sound Om emanates from His damaru drum. (Shiva Purana)" },
"Divine Elements": { "quote": "Master of the five elements - earth, water, fire, air, and ether. (Tantric Tradition)" },
"Divine Warrior": { "quote": "Destroyer of the three cities of demons, protector of dharma. (Shiva Purana)" },
"Divine Healer": { "quote": "As Vaidyanatha, the supreme physician who cures all ills. (Shiva Purana)" },
"Divine Love": { "quote": "His love for devotees is like the ocean - boundless and deep. (Tamil Shaivite Saints)" },
"Divine Justice": { "quote": "The dispenser of karma, rewarding virtue and correcting transgression. (Shiva Purana)" },
"Divine Simplicity": { "quote": "Though lord of the universe, he is pleased with simple bilva leaves. (Shiva Purana)" },
"Divine Marriage": { "quote": "His sacred union with Parvati represents the perfect divine marriage. (Shiva Purana)" },
"Divine Worship": { "quote": "Even a simple offering with devotion reaches Him. (Shiva Purana)" },
"Divine Liberation": { "quote": "The bestower of moksha, final liberation from the cycle of birth and death. (Shvetashvatara Upanishad)" },
"Divine Light": { "quote": "His form is pure consciousness, self-luminous like a million suns. (Shiva Mahimna Stotra)" },
"Divine Peace": { "quote": "In deep meditation on Shiva, supreme peace is attained. (Shiva Sutras)" },
"Divine Play": { "quote": "The entire cosmos is His divine play, yet He remains untouched. (Kashmiri Shaivism)" },
"Divine Reality": { "quote": "Shiva is the ultimate reality, both transcendent and immanent. (Shiva Sutras)" }
}
