{
  "Consciousness Mastery": {
    "short_description": "Powers related to expansion and manipulation of awareness itself."
  },
  "Space-Time Sovereignty": {
    "short_description": "Mastery over dimensional and temporal constraints and properties."
  },
  "Energy Governance": {
    "short_description": "Control over subtle and gross forms of force and power."
  },
  "Matter Transmutation": {
    "short_description": "Powers of transforming physical and subtle substance."
  },
  "Causal Authority": {
    "short_description": "Mastery over chains of cause and effect, karma, and manifestation."
  },
  "Boundary Transcendence": {
    "short_description": "Powers that overcome normal limitations and separations."
  },
  "Knowledge Perfection": {
    "short_description": "Direct access to and understanding of truth and reality."
  },
  "Will Embodiment": {
    "short_description": "Perfect manifestation of intention into reality."
  },
  "Form Mastery": {
    "short_description": "Control over shapes, bodies, and manifestations of being."
  },
  "Vibration Control": {
    "short_description": "Mastery over frequencies and resonances of existence."
  },
  "Unity Realization": {
    "short_description": "Powers stemming from recognition of fundamental oneness."
  },
  "Law Transcendence": {
    "short_description": "Authority over natural and spiritual laws and principles."
  },
  "Memory Sovereignty": {
    "short_description": "Mastery over individual and cosmic records of existence."
  },
  "Force Direction": {
    "short_description": "Control over fundamental forces and their applications."
  },
  "Pattern Recognition": {
    "short_description": "Understanding and manipulation of cosmic templates and archetypes."
  },
  "Essence Extraction": {
    "short_description": "Access to and control over fundamental qualities of being."
  },
  "Presence Projection": {
    "short_description": "Mastery over location and manifestation of consciousness."
  },
  "Reality Engineering": {
    "short_description": "Power to modify and create conditions of existence."
  },
  "Vehicle Mastery": {
    "short_description": "Control over bodies and instruments of consciousness."
  },
  "Principle Command": {
    "short_description": "Authority over fundamental laws and cosmic principles."
  },
  "State Sovereignty": {
    "short_description": "Mastery over conditions and modes of existence."
  },
  "Element Dominion": {
    "short_description": "Control over fundamental building blocks of reality."
  },
  "Dimension Access": {
    "short_description": "Authority over planes and levels of existence."
  },
  "Flow Mastery": {
    "short_description": "Control over movements and currents of force and consciousness."
  },
  "Seed Control": {
    "short_description": "Mastery over potential and manifestation of possibilities."
  },
  "Light Governance": {
    "short_description": "Authority over illumination and revelation at all levels."
  },
  "Sound Mastery": {
    "short_description": "Control over vibration and creative power of sound."
  },
  "Web Navigation": {
    "short_description": "Mastery over networks and interconnections of reality."
  },
  "Core Access": {
    "short_description": "Direct connection to fundamental source of being."
  },
  "Field Command": {
    "short_description": "Control over areas of influence and effect."
  },
   "Consciousness Modification": {
    "short_description": "Powers relating to fundamental alteration of awareness and perception states."
  },
  "Space-Time Manipulation": {
    "short_description": "Abilities affecting the basic fabric of space, time, and causation."
  },
  "Matter-Energy Transmutation": {
    "short_description": "Powers involving transformation between different states of existence."
  },
  "Boundary Transcendence": {
    "short_description": "Abilities to cross or dissolve normal limitations of being."
  },
  "Will Manifestation": {
    "short_description": "Direct materialization of intent into reality without intermediate steps."
  },
  "Vibrational Attunement": {
    "short_description": "Powers based on resonance with subtle forces and energies."
  },
  "Essence Perception": {
    "short_description": "Direct knowing of the true nature of things beyond surface appearance."
  },
  "Force Mastery": {
    "short_description": "Control over fundamental energies and powers of nature."
  },
  "Reality Programming": {
    "short_description": "Ability to alter the underlying patterns and laws of manifestation."
  },
  "Dimensional Access": {
    "short_description": "Powers relating to movement between different planes of existence."
  },
  "Field Manipulation": {
    "short_description": "Control over subtle energy fields and matrices of reality."
  },
  "Causal Engineering": {
    "short_description": "Powers affecting the deep structure of cause and effect relationships."
  },
  "Form Liberation": {
    "short_description": "Transcendence of normal physical and mental limitations of form."
  },
  "Unity Realization": {
    "short_description": "Powers emerging from direct experience of fundamental oneness."
  },
  "Void Navigation": {
    "short_description": "Abilities relating to movement through and manipulation of emptiness."
  },
  "Pattern Recognition": {
    "short_description": "Direct perception of underlying structures and relationships in reality."
  },
  "Essence Emission": {
    "short_description": "Projection of fundamental qualities and energies of being."
  },
  "Law Transcendence": {
    "short_description": "Powers that operate beyond normal natural and physical laws."
  },
  "Matrix Programming": {
    "short_description": "Ability to alter the underlying code or structure of reality."
  },
  "Consciousness Projection": {
    "short_description": "Extension of awareness beyond normal boundaries of self."
  },
  "Karmic Engineering": {
    "short_description": "Powers affecting the deep structure of action and consequence."
  },
  "Information Access": {
    "short_description": "Direct connection to universal knowledge and wisdom."
  },
  "Reality Harmonization": {
    "short_description": "Powers bringing different levels of existence into alignment."
  },
  "Essence Multiplication": {
    "short_description": "Creation of multiple manifestations from single source."
  },
  "Force Channeling": {
    "short_description": "Direction and transformation of fundamental energies."
  },
  "Boundary Dissolution": {
    "short_description": "Removal of apparent separations between different aspects of reality."
  },
  "Mind-Matter Interface": {
    "short_description": "Direct interaction between consciousness and physical reality."
  },
  "Primordial Access": {
    "short_description": "Connection to original or unconditioned states of being."
  },
  "Entity Integration": {
    "short_description": "Powers relating to union with other beings or forces."
  },
  "Quantum Navigation": {
    "short_description": "Manipulation of fundamental uncertainty and possibility states."
  }
}

