{
"System Modeling": { "quote": "Creating interactive representations of real or imaginary systems. SimCity uses interconnected systems for power, water, traffic, pollution, and citizen happiness." },
"Fidelity Spectrum": { "quote": "The range from absolute realism to abstracted simulation. Microsoft Flight Simulator aims for precise physics replication, while Two Point Hospital uses cartoonish representations of hospital management." },
"Emergent Behavior": { "quote": "Complex outcomes arising from simple rule interactions. Dwarf Fortress generates elaborate stories from the interaction of basic personality traits and needs." },
"Resource Management": { "quote": "Balancing limited supplies and competing demands. Cities: Skylines requires juggling finances, citizen needs, and infrastructure development." },
"System Complexity": { "quote": "The depth and interconnection of simulated elements. Oxygen Not Included models thermodynamics, gas pressure, stress, and resource cycles in an underground colony." },
"Decision Consequences": { "quote": "How choices ripple through simulated systems over time. Frostpunk's societal decisions impact citizen hope, discontent, and survival in escalating cold." },
"Time Scales": { "quote": "How simulation speed relates to real time. Civilization compresses thousands of years into hours, while real-time strategy games operate in moments." },
"Abstraction Levels": { "quote": "How directly game elements map to real counterparts. The Sims abstracts human needs into measurable bars, while Farming Simulator models specific equipment operations." },
"Parameter Adjustment": { "quote": "Player control over simulation variables. RollerCoaster Tycoon allows fine-tuning of ride characteristics affecting excitement, intensity, and nausea." },
"Failure Cascades": { "quote": "How problems compound and multiply. In Rimworld, a minor food shortage can lead to hunting accidents, untreated injuries, mental breaks, and colony collapse." },
"Simulation Goals": { "quote": "Objectives within open-ended systems. Planet Coaster balances creative freedom with optional challenges like maintaining guest satisfaction or meeting financial targets." },
"Environmental Factors": { "quote": "How setting affects simulated systems. Surviving Mars requires adapting colony design to dust storms, cold waves, and meteor strikes." },
"Agent Simulation": { "quote": "Modeling individual entities with their own behaviors. SimCity (2013) tracks individual citizens as they travel between home and work." },
"Expert Systems": { "quote": "Specialized knowledge representation in particular domains. Microsoft Flight Simulator incorporates professional aviation knowledge into its flight models." },
"Accuracy vs. Fun": { "quote": "Balancing realistic systems against enjoyable gameplay. The Sims simplifies human relationships for gameplay accessibility, while Euro Truck Simulator maintains precise vehicle physics." },
"Learning Curves": { "quote": "How simulation complexity affects accessibility. Planet Zoo provides simple zoo management while gradually introducing complex breeding and conservation mechanics." },
"Interface Design": { "quote": "How players interact with complex systems. Cities: Skylines uses data visualization layers to make infrastructure problems visible and understandable." },
"Procedural Generation": { "quote": "Algorithmically creating simulation elements. Rimworld generates unique characters, world maps, and event sequences each playthrough." },
"Feedback Loops": { "quote": "Self-reinforcing or self-correcting system cycles. In SimCity, better education leads to higher property values, increasing tax revenue for more education spending." },
"Crisis Management": { "quote": "Responding to sudden system disruptions. Tropico challenges players with natural disasters, coup attempts, and economic sanctions." },
"Economic Modeling": { "quote": "Representing production, trade, and consumption. Anno 1800 features complex production chains and market dynamics." },
"Physics Simulation": { "quote": "Modeling physical forces and object interactions. BeamNG.drive focuses on realistic vehicle damage and driving physics." },
"Biological Systems": { "quote": "Representing living organisms and ecosystems. Wildlife Park models animal needs, behaviors, and environmental requirements." },
"System Visualization": { "quote": "Making complex data understandable. Prison Architect uses color-coding and icons to show prisoner needs and facility status." },
"Realistic Constraints": { "quote": "Limitations that mirror real-world challenges. Bus Simulator imposes schedule adherence, traffic laws, and passenger satisfaction." },
"Sandbox Elements": { "quote": "Player freedom within simulation frameworks. Planet Coaster balances management challenges with creative freedom in design." },
"Historical Modeling": { "quote": "Representing past events and systems. Crusader Kings III models medieval politics, warfare, and dynastic succession." },
"Social Simulation": { "quote": "Modeling relationships and community dynamics. The Sims 4 tracks complex webs of friendships, romances, and family connections." },
"Educational Value": { "quote": "Learning through system interaction. Kerbal Space Program teaches orbital mechanics and rocket design through experimentation." },
"Simulation Ethics": { "quote": "Moral questions raised by system representation. Frostpunk forces difficult choices between survival and humanity in a frozen world." }
}
