{
"Spatial Data Types": { "quote": "Geometric primitives like point, line, polygon, and multipolygon that represent real-world objects in space." },
"Spatial Reference Systems": { "quote": "Coordinate systems that map locations to positions on Earth: WGS84 (EPSG:4326) for GPS coordinates, Web Mercator (EPSG:3857) for web mapping." },
"Spatial Indexing": { "quote": "R-trees, quadtrees, and grid-based indexes optimize spatial queries by organizing data based on location." },
"Spatial Queries": { "quote": "Operations that analyze spatial relationships: ST_Intersects(geom1, geom2), ST_Contains(geom1, geom2), ST_Distance(geom1, geom2)." },
"Topological Relationships": { "quote": "Spatial predicates describing how geometries relate: touches, overlaps, contains, within, intersects, disjoint, equals, crosses." },
"Spatial Joins": { "quote": "Combining datasets based on spatial relationships: SELECT * FROM cities JOIN states ON ST_Within(cities.geom, states.geom)." },
"Raster Data": { "quote": "Cell-based representation of continuous phenomena like elevation, temperature, or satellite imagery stored as regularly spaced grids." },
"Vector Data": { "quote": "Discrete geometric objects represented by coordinates: roads as lines, buildings as polygons, landmarks as points." },
"Projections": { "quote": "Mathematical transformations to represent Earth's curved surface on flat maps: Mercator preserves angles, Albers preserves area." },
"Geodetic Calculations": { "quote": "Measurements accounting for Earth's ellipsoidal shape: ST_Distance_Spheroid for true distances on Earth's surface." },
"Buffer Analysis": { "quote": "Creating zones of specified distance around features: ST_Buffer(geom, distance) generates a polygon at fixed distance from input." },
"Spatial Clustering": { "quote": "Grouping nearby features: ST_ClusterDBSCAN(geom, eps, minpoints) identifies density-based clusters." },
"Geocoding": { "quote": "Converting addresses to coordinates: '1600 Pennsylvania Ave, Washington DC' → (38.8977, -77.0365)." },
"Reverse Geocoding": { "quote": "Converting coordinates to meaningful locations: (40.7128, -74.0060) → 'New York City, NY, USA'." },
"Geospatial Functions": { "quote": "Operations for spatial analysis: ST_Area(), ST_Length(), ST_Centroid(), ST_Union(), ST_Intersection()." },
"Coordinate Transformation": { "quote": "Converting between different spatial reference systems: ST_Transform(geom, 4326)." },
"Map Algebra": { "quote": "Operations on raster data: combining elevation and slope rasters to identify landslide risk zones." },
"Topology": { "quote": "Rules maintaining spatial relationships between features: shared boundaries between adjacent polygons remain aligned when either is edited." },
"Spatial ETL": { "quote": "Extract, Transform, Load processes for spatial data: converting CAD drawings to GIS formats while maintaining spatial accuracy." },
"OGC Standards": { "quote": "Open Geospatial Consortium specifications like WFS, WMS, and GeoPackage ensure interoperability between spatial systems." },
"GeoJSON": { "quote": "Open standard format representing geographic features: {\"type\":\"Point\",\"coordinates\":[-122.4194,37.7749]}." },
"Well-Known Text": { "quote": "Text markup language for representing vector geometries: POINT(0 0), LINESTRING(0 0, 1 1), POLYGON((0 0, 1 0, 1 1, 0 1, 0 0))." },
"Spatial DBMS": { "quote": "Database systems with spatial capabilities: PostgreSQL/PostGIS, SQL Server Spatial, Oracle Spatial, SpatiaLite, MongoDB Geospatial." },
"Proximity Analysis": { "quote": "Finding nearest neighbors or features within specified distance: ST_DWithin(geom1, geom2, distance)." },
"Spatial Constraints": { "quote": "Rules enforcing spatial data integrity: ensuring new buildings don't overlap with existing structures." },
"3D Spatial Data": { "quote": "Three-dimensional geometries incorporating height or depth: buildings with elevation, underground utilities, geological models." },
"Temporal-Spatial Data": { "quote": "Information varying across both space and time: tracking vehicle movements, analyzing urban growth patterns, monitoring climate change." },
"Web Mapping": { "quote": "Delivering spatial data via internet: Leaflet, OpenLayers, and Mapbox GL JS render interactive maps from spatial databases." },
"Digital Elevation Models": { "quote": "Raster datasets representing terrain height: used for viewshed analysis, hydrological modeling, and contour generation." },
"Spatial Statistics": { "quote": "Analyzing patterns and relationships in geographic data: Moran's I measures spatial autocorrelation, Getis-Ord Gi* identifies hot spots." }
}
