{
  "Life Journey": { "quote": "The one aim of [my] yoga is an inner self-development by which each one who follows it can in time discover the One Self in all and evolve a higher consciousness than the mental." },
  "Integral Yoga": { "quote": "By yoga we can rise from morality to spirituality, from the ethical to the spiritual life, from the external law to the law of the spirit." },
  "Evolution": { "quote": "Man is a transitional being; he is not final. The step from man to superman is the next approaching achievement in the earth's evolution." },
  "Supermind": { "quote": "The Supermind is the Truth-Consciousness, the Divine Gnosis which is the native plane of the Divine." },
  "Divine Life": { "quote": "A divine life in a divine body is the formula of the ideal that we envisage." },
  "Consciousness": { "quote": "Consciousness is not only power of awareness of self and things, it is or has also a dynamic and creative energy." },
  "Transformation": { "quote": "The whole aim of my yoga is an inner self-development by which each one who follows it can in time discover the One Self in all and evolve a higher consciousness." },
  "Divine Mother": { "quote": "The One whom we adore as the Mother is the divine Conscious Force that dominates all existence." },
  "Spiritual Evolution": { "quote": "The animal is a living laboratory in which Nature has worked out man; man may well be a living laboratory in which Nature wills to work out superman." },
  "Human Unity": { "quote": "The unity of all human beings is an absolute fact of the universal existence." },
  "Divine Manifestation": { "quote": "All life is Yoga. All life, consciously or unconsciously, is an attempt to find the Divine." },
  "Spiritual Practice": { "quote": "The practice of yoga brings us face to face with the extraordinary complexity of our own being." },
  "Divine Knowledge": { "quote": "Knowledge is not a systematic collection of facts but an illumination of the soul." },
  "Synthesis": { "quote": "The true and full object and utility of Yoga can only be accomplished when the conscious Yoga in man becomes, like the subconscious Yoga in Nature, outwardly conterminous with life itself." },
  "Sadhana": { "quote": "The whole of life is a Sadhana, an experience and development of the consciousness leading towards the Divine." },
  "Liberation": { "quote": "Liberation is not the aim - the aim is the divine realization of the Divine in the world." },
  "Divine Work": { "quote": "All work done for the Divine is equally divine; the humble work of the sweeper is as precious as the work of the artist and thinker." },
  "Spiritual Freedom": { "quote": "True freedom is an inner state of the soul independent of outer circumstances." },
  "Divine Love": { "quote": "Love is the crown of all being and its way of fulfilment, its utterly satisfying absolute." },
  "Psychic Being": { "quote": "The psychic being is the soul evolving in the course of its cycles of birth carrying with it a developing divine consciousness." }
}

