{
"Metadata Definition": { "quote": "Data that provides information about other data, serving as the foundation for information organization and discovery." },
"Dublin Core": { "quote": "A standard metadata element set with 15 core elements including title, creator, subject, and date for describing digital resources." },
"MODS": { "quote": "Metadata Object Description Schema, a rich XML-based standard derived from MARC for descriptive metadata in libraries and repositories." },
"MARC": { "quote": "Machine-Readable Cataloging, the standard format for bibliographic records in library catalogs since the 1960s." },
"XML Schemas": { "quote": "Structured documents that define the structure, content, and semantics of XML documents for metadata exchange." },
"RDF": { "quote": "Resource Description Framework provides a standard model for data interchange, forming the foundation of the semantic web." },
"Taxonomy": { "quote": "Hierarchical classification systems organizing concepts into parent-child relationships for improved navigation." },
"Ontology": { "quote": "Formal representation of knowledge with entities, relationships, and rules that enable complex queries and inference." },
"Controlled Vocabulary": { "quote": "Standardized term collections that ensure consistency in metadata assignment and retrieval." },
"Thesaurus": { "quote": "Semantically structured vocabularies showing relationships between terms including broader, narrower, and related concepts." },
"Descriptive Metadata": { "quote": "Information describing resource content such as title, author, and subject for identification and discovery." },
"Administrative Metadata": { "quote": "Information managing digital resources including rights, preservation data, and technical specifications." },
"Technical Metadata": { "quote": "Information about file characteristics like format, size, compression, and creation software." },
"Rights Metadata": { "quote": "Information about intellectual property including copyright status, license terms, and access restrictions." },
"Preservation Metadata": { "quote": "Information supporting long-term maintenance of digital resources, including PREMIS standard elements." },
"PREMIS": { "quote": "Preservation Metadata Implementation Strategies, a standard for digital preservation metadata." },
"Structural Relationships": { "quote": "Information about how resource components relate to each other, such as page order in a digitized book." },
"Metadata Schema": { "quote": "Formal organization of metadata elements, defining rules for syntax, semantics, and values." },
"Crosswalks": { "quote": "Mappings between elements in different metadata schemas, enabling interoperability between systems." },
"Harvesting Protocols": { "quote": "Standards like OAI-PMH that enable automated collection of metadata from distributed repositories." },
"METS": { "quote": "Metadata Encoding and Transmission Standard, an XML schema for encoding descriptive, administrative, and structural metadata." },
"Linked Data": { "quote": "Method of publishing structured data using standard web technologies to create connections between related resources." },
"Embedded Metadata": { "quote": "Information stored within digital files themselves, such as EXIF data in images or ID3 tags in audio files." },
"EXIF": { "quote": "Exchangeable Image File Format, metadata embedded in image files including camera settings, date, and location." },
"ID3 Tags": { "quote": "Metadata container in MP3 files storing information about artist, album, title, and other audio attributes." },
"Content Management Systems": { "quote": "Platforms that use metadata to organize, store, and retrieve digital assets efficiently." },
"Digital Object Identifiers": { "quote": "Persistent identifiers (DOIs) that provide stable references to digital objects regardless of location changes." },
"Metadata Registry": { "quote": "Centralized systems that document and maintain metadata standards, enhancing consistency and interoperability." },
"Schema.org": { "quote": "Collaborative vocabulary for structured data markup on web pages, improving search engine understanding of content." },
"Microdata": { "quote": "HTML specification for embedding machine-readable data in web documents to enhance semantic meaning." }
}
