{
"Sufism": {
"short_description": "The mystical dimension of Islam focused on direct experience of divine reality through love, knowledge, and spiritual practices that purify the heart and transform consciousness."
},
"Tasawwuf": {
"short_description": "The traditional Arabic term for the spiritual science of Sufism, encompassing both theoretical knowledge and practical methods for achieving divine realization and human perfection."
},
"Tariqa": {
"short_description": "The spiritual path or way, organized as a systematic method of spiritual training under qualified guidance, transmitting both outer knowledge and inner secrets of realization."
},
"Murshid": {
"short_description": "The spiritual guide or master who has achieved realization and is authorized to lead others on the path, embodying both the transmission of tradition and direct spiritual influence."
},
"Murid": {
"short_description": "The spiritual aspirant who has committed to following the path under guidance, entering into a sacred relationship of transformation through service and surrender to divine will."
},
"Dhikr": {
"short_description": "The practice of divine remembrance through repetition of sacred names or phrases, serving as the central method of purifying consciousness and maintaining awareness of divine presence."
},
"Sama": {
"short_description": "Spiritual audition through music and movement, using rhythm and sound to induce elevated states of consciousness and direct experience of divine reality."
},
"Fana": {
"short_description": "The extinction of the limited self in divine reality, representing the dissolution of ego-consciousness in direct experience of ultimate truth."
},
"Baqa": {
"short_description": "The state of subsistence in divine reality after fana, where consciousness returns to function in the world while maintaining awareness of ultimate truth."
},
"Hal": {
"short_description": "Temporary spiritual states that arise spontaneously on the path, providing glimpses of higher realities but requiring integration through continued practice."
},
"Maqam": {
"short_description": "Permanent spiritual stations achieved through consistent practice and divine grace, representing stable levels of realization maintained under all circumstances."
},
"Silsila": {
"short_description": "The chain of spiritual transmission linking current practitioners to the Prophet Muhammad through successive generations of realized masters."
},
"Baraka": {
"short_description": "Spiritual blessing or power transmitted through the tradition, capable of transforming consciousness and circumstances through divine grace."
},
"Himma": {
"short_description": "Spiritual aspiration and concentrated will, representing the focused intention necessary for progress on the path and spiritual realization."
},
"Latifa": {
"short_description": "Subtle spiritual centers within the human being that are activated and developed through practices, each corresponding to different aspects of consciousness."
},
"Kashf": {
"short_description": "Spiritual unveiling or direct perception of reality beyond ordinary consciousness, providing immediate knowledge of truth without conceptual mediation."
},
"Marifah": {
"short_description": "Direct knowledge of divine reality through experience, transcending both intellectual understanding and traditional learning."
},
"Muhabbah": {
"short_description": "Divine love that transforms the lover into the beloved, representing both the path and goal of spiritual realization through love."
},
"Adab": {
"short_description": "Spiritual courtesy and proper conduct reflecting inner refinement, essential for maintaining harmonious relationships and receiving spiritual influence."
},
"Khanqah": {
"short_description": "Sufi gathering place or spiritual center where practitioners meet for instruction, practice, and communion in divine presence."
},
"Wird": {
"short_description": "Daily spiritual practices assigned by the guide, including specific prayers, invocations, and contemplations tailored to individual needs."
},
"Yaqin": {
"short_description": "Certainty of divine reality achieved through direct experience, progressing from knowledge to vision to complete realization."
},
"Nafs": {
"short_description": "The soul or self in its various stages of development, from its raw state through progressive refinement to complete purification."
},
"Qutb": {
"short_description": "The spiritual axis or pole of the age, representing the highest level of realization and authority in maintaining spiritual order."
},
"Wali": {
"short_description": "Friend of God who has achieved spiritual completion and serves as a channel of divine grace and guidance for others."
}
}
