{
"Essential Nature": { "quote": "That which is supreme, ultimate, and beyond all attributes yet containing all possibilities. (Vedanta Sutra 1.1.2)" },
"Transcendent Aspect": { "quote": "Beyond name and form, beyond time and space, beyond all that is and is not. (Mandukya Upanishad)" },
"Immanent Presence": { "quote": "Closer to you than your jugular vein. (Quran 50:16)" },
"Absolute Reality": { "quote": "Before Abraham was, I am. (John 8:58)" },
"Universal Consciousness": { "quote": "The one consciousness that illumines all experiences. (Yoga Vasistha 2.16)" },
"Infinite Being": { "quote": "Infinite and eternal, without beginning or end, the source of all existence. (Bhagavad Gita 10:3)" },
"Ultimate Truth": { "quote": "The way and the truth and the life. (John 14:6)" },
"Supreme Identity": { "quote": "Neither this nor that, yet both and beyond - neti neti. (Brihadaranyaka Upanishad 2.3.6)" },
"Absolute Existence": { "quote": "The ground of being itself. (Paul Tillich, Systematic Theology)" },
"Divine Essence": { "quote": "The essence of all essences, the reality of all realities. (Ibn Arabi, Fusus al-Hikam)" },
"Primordial Source": { "quote": "From which all beings arise and to which all return. (Tao Te Ching 16)" },
"Ultimate Principle": { "quote": "The principle of all principles, the light of all lights. (Kena Upanishad 1.3)" },
"Supreme Intelligence": { "quote": "The cosmic intelligence that orders all things. (Heraclitus, Fragment 41)" },
"Absolute Freedom": { "quote": "Perfect freedom beyond all bondage and limitation. (Ashtavakra Gita 1:10)" },
"Divine Unity": { "quote": "The One without a second. (Chandogya Upanishad 6.2.1)" },
"Universal Spirit": { "quote": "The spirit that pervades all existence. (Bhagavad Gita 13:14)" },
"Supreme Power": { "quote": "The power behind all powers, the force behind all forces. (Zohar 2:42b)" },
"Eternal Being": { "quote": "That which always was, is, and shall be. (Revelation 1:8)" },
"Ultimate Reality": { "quote": "The reality that underlies all appearances. (Lankavatara Sutra)" },
"Divine Perfection": { "quote": "Perfect and complete, lacking nothing. (James 1:4)" },
"Supreme Love": { "quote": "The source of all love and compassion. (1 John 4:16)" },
"Absolute Knowledge": { "quote": "The knower of all that is knowable. (Mundaka Upanishad 1.1.9)" },
"Divine Presence": { "quote": "The omnipresent reality in which we live and move and have our being. (Acts 17:28)" },
"Supreme Will": { "quote": "The will that manifests all possibilities. (Ibn Arabi, Fusus al-Hikam)" },
"Ultimate Purpose": { "quote": "The alpha and omega, the purpose of all purposes. (Revelation 22:13)" },
"Divine Harmony": { "quote": "The supreme harmony that maintains the cosmic order. (Tao Te Ching 42)" },
"Absolute Peace": { "quote": "The peace that passes all understanding. (Philippians 4:7)" },
"Supreme Good": { "quote": "The highest good from which all good derives. (Plato, Republic)" },
"Divine Law": { "quote": "The eternal law that governs all existence. (Aquinas, Summa Theologica I-II.91.1)" },
"Ultimate Mystery": { "quote": "The mystery of mysteries, the gate to all wonders. (Tao Te Ching 1)" }
}
