{
  "Abstract Strategy": { "quote": "Pure mental sport: No chance, hidden information, or theme - just perfect information and logic. (Chess, Go)" },
  "Worker Placement": { "quote": "Limited action spaces create tension: Each choice denies opportunities to opponents. (Vital Lacerda)" },
  "Deck Building": { "quote": "Construct your engine dynamically: Weak starting cards evolve into powerful combos. (Dominion's DNA)" }, 
  "Legacy Games": { "quote": "Permanent changes tell your group's unique story. (Rob Daviau's innovation)" },
  "Drafting Mechanic": { "quote": "Simultaneous selection with hate-picking: 7 Wonders' civilization engine." },
  "Area Control": { "quote": "Territory disputes resolved through strategic allocation. (Risk's enduring legacy)" },
  "Social Deduction": { "quote": "Truth hides behind layers of deception. (Werewolf's midnight accusations)" },
  "Cooperative Play": { "quote": "Shared fate against escalating challenges. (Pandemic's disease cubes)" },
  "Engine Building": { "quote": "Compound interest through synergistic combinations. (Terraforming Mars' infrastructure)" },
  "Tableau Construction": { "quote": "Personal player board as evolving masterpiece. (Wingspan's avian ecosystems)" },
  "Push Your Luck": { "quote": "Risk versus reward quantified through dice. (Can't Stop's vertical climb)" },
  "Trading & Negotiation": { "quote": "Diplomacy through resource bartering. (Catan's sheep-for-ore economy)" },
  "Campaign Games": { "quote": "Persistent progression across sessions. (Gloomhaven's sealed envelopes)" },
  "Miniatures Gaming": { "quote": "Tactical positioning meets painter's artistry. (Warhammer's plastic crack)" },
  "18XX Series": { "quote": "Stock manipulation meets railroad logistics. (1829's operational puzzle)" },
  "Roll & Write": { "quote": "Dice-driven puzzle on personal sheets. (Yahtzee's modern evolution)" },
  "Tile Placement": { "quote "Carcassonne's meeple landscapes: Cities grow with monastery hearts." },
  "Dungeon Crawlers": { "quote": "Grid-based tactical combat with loot progression. (Gloomhaven's card-driven initiatives)" },
  "Living Card Games": { "quote": "Fixed distribution replaces random packs. (Android: Netrunner's reboot philosophy)" },
  "Party Games": { "quote": "Laughter through shared absurdity. (Cards Against Humanity's dark humor)" },
  "Wargaming": { "quote": "Historical conflict simulated through chit-pulling. (Twilight Struggle's cold war tension)" },
  "Deck Construction": { "quote": "Pre-game strategy meets in-game adaptation. (Magic: The Gathering's color pie)" },
  "Real-Time Games": { "quote": "Simultaneous action under time pressure. (Escape: The Curse of the Temple's dice clatter)" },
  "Solo Modes": { "quote": "AI opponents through automa decks. (Viticulture's solo vineyard management)" },
  "Print & Play": { "quote": "Democratized design through PDF distribution. (Button Shy's wallet-sized games)" },
  "Player Elimination": { "quote": "High stakes through permanent removal. (Risk's enduring betrayal mechanic)" },
  "Drafting": { "quote": "Simultaneous selection with hate-picking. (7 Wonders' civilization engine)" },
  "Table Talk": { "quote": "Unstructured negotiation as core mechanic. (Diplomacy's alliance-breaking)" },
  "Component Quality": { "quote": "Weighty tokens enhance tactile experience. (Scythe's metal mechs)" },
  "Victory Points": { "quote": "Abstracted success metrics through multiple paths. (Point salad design philosophy)" }
}

