{
"Table Name": { "quote": "The unique identifier for the table within the database schema. Example: 'customers', 'orders', 'products'." },
"Schema": { "quote": "The namespace that organizes database objects. Example: 'public', 'sales', 'inventory'." },
"Columns": { "quote": "The individual fields that define the table structure. Example: 'customer_id', 'first_name', 'email_address'." },
"Data Types": { "quote": "The classification of data each column can store. Example: INTEGER, VARCHAR(255), TIMESTAMP, BOOLEAN." },
"Primary Key": { "quote": "The column or combination of columns that uniquely identifies each row. Example: 'customer_id', 'order_number'." },
"Foreign Keys": { "quote": "Columns that reference primary keys in other tables to establish relationships. Example: 'customer_id' in 'orders' references 'id' in 'customers'." },
"Indexes": { "quote": "Data structures that improve query performance on specific columns. Example: B-tree index on 'last_name' for faster customer lookups." },
"Constraints": { "quote": "Rules that enforce data integrity. Example: NOT NULL, UNIQUE, CHECK (price > 0)." },
"Default Values": { "quote": "Predefined values assigned when no value is specified. Example: DEFAULT CURRENT_TIMESTAMP, DEFAULT 0." },
"Auto Increment": { "quote": "Mechanism for automatically generating sequential values. Example: IDENTITY, SERIAL, AUTO_INCREMENT." },
"Table Partitioning": { "quote": "Dividing large tables into smaller, more manageable pieces. Example: Partitioning by date range or geographic region." },
"Collation": { "quote": "Rules for comparing and sorting character data. Example: utf8mb4_unicode_ci, latin1_swedish_ci." },
"Character Set": { "quote": "Encoding scheme for storing text data. Example: UTF-8, Latin1, ASCII." },
"Storage Engine": { "quote": "Software component managing how data is stored and retrieved. Example: InnoDB, MyISAM, PostgreSQL TOAST." },
"Table Comments": { "quote": "Documentation about the table's purpose and usage. Example: 'Stores customer contact information and account status'." },
"Column Comments": { "quote": "Documentation about individual column meaning and usage. Example: 'ISO 3166-1 alpha-2 country code'." },
"Created Date": { "quote": "When the table was initially created. Example: '2023-01-15 14:30:45'." },
"Last Modified": { "quote": "When the table structure was last altered. Example: '2023-03-22 09:17:32'." },
"Row Count": { "quote": "The current number of records in the table. Example: 1,452,891 rows." },
"Size on Disk": { "quote": "Physical storage space consumed by the table. Example: 256MB, 2.1GB." },
"Permissions": { "quote": "Access control rules for the table. Example: SELECT, INSERT, UPDATE, DELETE privileges." },
"Triggers": { "quote": "Procedures that automatically execute in response to certain events. Example: AFTER INSERT trigger for auditing." },
"View Dependencies": { "quote": "Views that rely on this table. Example: 'customer_summary_view', 'active_accounts_view'." },
"Distribution Key": { "quote": "Column used to distribute data across nodes in distributed systems. Example: Hash distribution on 'customer_id'." },
"Compression": { "quote": "Data compression methods applied to the table. Example: Row compression, page compression, columnar compression." },
"Statistics": { "quote": "Metadata used by the query optimizer. Example: Column cardinality, histograms, frequent values." },
"Cascading Actions": { "quote": "Automated operations when referenced data changes. Example: ON DELETE CASCADE, ON UPDATE CASCADE." },
"Temporary Status": { "quote": "Whether the table persists beyond the current session. Example: TEMPORARY, GLOBAL TEMPORARY." },
"Logging": { "quote": "How changes to the table are recorded. Example: Archive logging, transaction logging, change data capture." },
"Sequence Generators": { "quote": "Objects that produce sequential values for columns. Example: SEQUENCE, IDENTITY columns." }
}
