{
"Names of Tao": { "quote": "The Tao that can be named is not the eternal Tao. (Tao Te Ching 1)" },
"Nature of Tao": { "quote": "The Tao is like a well: used but never used up. (Tao Te Ching 4)" },
"Essence of Tao": { "quote": "The Tao is empty yet inexhaustible. (Tao Te Ching 4)" },
"Tao Principles": { "quote": "The heavy is the root of the light; the still is the master of unrest. (Tao Te Ching 26)" },
"Tao Virtues": { "quote": "The highest good is like water. Water benefits all things and does not compete. (Tao Te Ching 8)" },
"Tao Practice": { "quote": "Do your work, then step back. The only path to serenity. (Tao Te Ching 9)" },
"Tao Unity": { "quote": "Heaven and Earth and I are living together, the ten thousand things and I are one. (Chuang Tzu)" },
"Tao Balance": { "quote": "When people see some things as beautiful, other things become ugly. When people see some things as good, other things become bad. (Tao Te Ching 2)" },
"Tao Wisdom": { "quote": "Knowledge of the eternal is enlightenment. Not knowing it leads to disaster. (Tao Te Ching 16)" },
"Tao Action": { "quote": "Act without doing; work without effort. (Tao Te Ching 63)" },
"Tao Process": { "quote": "The Tao gave birth to One, One gave birth to Two, Two gave birth to Three, Three gave birth to all things. (Tao Te Ching 42)" },
"Tao Nature": { "quote": "Man follows Earth, Earth follows Heaven, Heaven follows the Tao, and the Tao follows what is natural. (Tao Te Ching 25)" },
"Tao Path": { "quote": "A good traveler has no fixed plans and is not intent upon arriving. (Tao Te Ching 27)" },
"Tao Power": { "quote": "The softest thing in the universe overcomes the hardest thing in the universe. (Tao Te Ching 43)" },
"Tao Leadership": { "quote": "The best leader is one people barely know exists. (Tao Te Ching 17)" },
"Tao Transformation": { "quote": "Returning is the motion of the Tao. (Tao Te Ching 40)" },
"Tao Manifestation": { "quote": "The nameless is the origin of Heaven and Earth. (Tao Te Ching 1)" },
"Tao Paradox": { "quote": "True words seem paradoxical. (Tao Te Ching 78)" },
"Tao Simplicity": { "quote": "Simplicity, patience, compassion. These three are your greatest treasures. (Tao Te Ching 67)" },
"Tao Harmony": { "quote": "When the great Tao is forgotten, kindness and morality arise. (Tao Te Ching 18)" },
"Tao Mystery": { "quote": "Dark and mysterious, the Tao is the source of all being. (Tao Te Ching 1)" },
"Tao Cultivation": { "quote": "He who knows others is wise; he who knows himself is enlightened. (Tao Te Ching 33)" },
"Tao Emptiness": { "quote": "We join spokes together in a wheel, but it is the center hole that makes the wagon move. (Tao Te Ching 11)" },
"Tao Integration": { "quote": "Heaven, Earth, and human beings are three treasures sharing one body. (Huainanzi)" },
"Tao Cycles": { "quote": "Reversal is the movement of the Tao; weakness is the method of the Tao. (Tao Te Ching 40)" },
"Tao Reality": { "quote": "The Great Tao flows everywhere, both left and right. (Tao Te Ching 34)" },
"Tao Presence": { "quote": "The Tao is always present within you. (Tao Te Ching 6)" },
"Tao Understanding": { "quote": "Those who know do not speak. Those who speak do not know. (Tao Te Ching 56)" },
"Tao Spontaneity": { "quote": "Act naturally and everything will fall into place. (Chuang Tzu)" },
"Tao Oneness": { "quote": "The ten thousand things carry yin and embrace yang, achieving harmony through blending these forces. (Tao Te Ching 42)" }
}
