{
"Nature of Learning": { "quote": "Education is not preparation for life; education is life itself. (John Dewey)" },
"Infinite Knowledge": { "quote": "The more I learn, the more I realize how much I don't know. (Albert Einstein)" },
"Universal Teaching": { "quote": "The whole universe is a school, and every particle in it holds a lesson. (Ancient Vedic Wisdom)" },
"Eternal Education": { "quote": "Education is not the filling of a pail, but the lighting of a fire. (W.B. Yeats)" },
"Cosmic Classroom": { "quote": "The cosmos is within us. We are made of star-stuff. We are a way for the universe to know itself. (Carl Sagan)" },
"Divine Learning": { "quote": "Learning is not attained by chance, it must be sought for with ardor and attended to with diligence. (Abigail Adams)" },
"Wisdom Path": { "quote": "By three methods we may learn wisdom: by reflection, which is noblest; by imitation, which is easiest; and by experience, which is the bitterest. (Confucius)" },
"Knowledge Creation": { "quote": "The beautiful thing about learning is that no one can take it away from you. (B.B. King)" },
"Infinite Growth": { "quote": "The capacity to learn is a gift; the ability to learn is a skill; the willingness to learn is a choice. (Brian Herbert)" },
"Universal Understanding": { "quote": "The universe is not required to make sense to you. But you are required to make sense of the universe. (Neil deGrasse Tyson)" },
"Eternal Questions": { "quote": "The important thing is not to stop questioning. Curiosity has its own reason for existence. (Albert Einstein)" },
"Learning Process": { "quote": "Tell me and I forget. Teach me and I remember. Involve me and I learn. (Benjamin Franklin)" },
"Knowledge Evolution": { "quote": "The illiterate of the 21st century will not be those who cannot read and write, but those who cannot learn, unlearn, and relearn. (Alvin Toffler)" },
"Wisdom Gathering": { "quote": "Knowledge speaks, but wisdom listens. (Jimi Hendrix)" },
"Universal Curriculum": { "quote": "The world is a book and those who do not travel read only one page. (Saint Augustine)" },
"Infinite Possibilities": { "quote": "Education is not the learning of facts, but the training of the mind to think. (Albert Einstein)" },
"Teaching Methods": { "quote": "The art of teaching is the art of assisting discovery. (Mark Van Doren)" },
"Learning Environment": { "quote": "The only person who is educated is the one who has learned how to learn and change. (Carl Rogers)" },
"Knowledge Transfer": { "quote": "In learning you will teach, and in teaching you will learn. (Phil Collins)" },
"Wisdom Application": { "quote": "Knowledge is of no value unless you put it into practice. (Anton Chekhov)" },
"Learning Community": { "quote": "None of us is as smart as all of us. (Ken Blanchard)" },
"Educational Journey": { "quote": "Learning is a treasure that will follow its owner everywhere. (Chinese Proverb)" },
"Knowledge Synthesis": { "quote": "Study the past if you would define the future. (Confucius)" },
"Teaching Philosophy": { "quote": "The function of education is to teach one to think intensively and to think critically. (Martin Luther King Jr.)" },
"Learning Dynamics": { "quote": "Learning never exhausts the mind. (Leonardo da Vinci)" },
"Educational Purpose": { "quote": "The purpose of education is to replace an empty mind with an open one. (Malcolm Forbes)" },
"Knowledge Integration": { "quote": "Real knowledge is to know the extent of one's ignorance. (Confucius)" },
"Teaching Excellence": { "quote": "A teacher affects eternity; he can never tell where his influence stops. (Henry Adams)" },
"Universal Growth": { "quote": "Live as if you were to die tomorrow. Learn as if you were to live forever. (Mahatma Gandhi)" },
"Infinite Discovery": { "quote": "The more that you read, the more things you will know. The more that you learn, the more places you'll go. (Dr. Seuss)" }
}
