{
"Names of Mother": { "quote": "She is known as Aditi, the Divine Mother, the infinite source of all existence. (Rig Veda 10.72)" },
"Divine Mother": { "quote": "The Divine Mother is the conscious Power that brings forth the worlds. (Sri Aurobindo, The Mother)" },
"Mother's Titles": { "quote": "Queen of Heaven, Mother of Mercy, Notre Dame, Magna Mater - the Great Mother of all beings." },
"Mothers": { "quote": "The One Mother manifests as many - Durga, Kali, Lakshmi, Mary, Isis, Tara. (Devi Mahatmya)" },
"Definitions": { "quote": "I am the Divine Mother. In me are all worlds, all gods, all beings. (Devi Gita 1.8)" },
"Mother Fundamentals": { "quote": "The Mother is the executive force of the Divine, the supreme Shakti. (Sri Aurobindo)" },
"Mother's Identity": { "quote": "She is Prakriti, the primal Nature, the creative force of existence. (Sankhya Philosophy)" },
"Divine Mother Person": { "quote": "The personal aspect of the Divine as Mother who nurtures and transforms all beings." },
"Mother's Aspects": { "quote": "The four great aspects: Maheshwari, Mahakali, Mahalakshmi, Mahasaraswati. (Sri Aurobindo)" },
"Mother's Attributes": { "quote": "Wisdom, Power, Harmony, Perfection are her fundamental attributes." },
"Mother's Powers": { "quote": "All powers are hers - creation, preservation, dissolution, and transformation." },
"Mother's Process": { "quote": "Through her unfolds the eternal play of creation and evolution." },
"Mother's Game": { "quote": "The cosmos is her play of consciousness and force. (Tantric tradition)" },
"Mother's Forces": { "quote": "The universal forces are her dynamic expressions in Nature." },
"Mother Nature": { "quote": "Nature is the outer expression of the Divine Mother's creative force." },
"Mother's End": { "quote": "In her is both the beginning and the fulfillment of all things." },
"Mother's Formations": { "quote": "All forms are her forms, all movements her movements." },
"Mother Reality": { "quote": "She is the supreme Reality manifesting as the conscious Force." },
"Mother Concepts": { "quote": "She is both transcendent silence and dynamic action." },
"Mother Relationship": { "quote": "She is the bridge between the Supreme and Creation." },
"Grades of Mother": { "quote": "From the highest supramental to the physical, she manifests in all grades of existence." },
"Mother's Symbols": { "quote": "The lotus, the flame, the dawn are her eternal symbols." },
"Mother's Knowledge": { "quote": "All knowledge flows from her wisdom-light." },
"Mother's Parts": { "quote": "Every particle of existence contains her presence." },
"Mother's Play": { "quote": "The evolution of consciousness is her divine play." },
"Mother's Properties": { "quote": "Love, Light, and Life are her essential properties." },
"Mother's Representation": { "quote": "She represents the executive power of the Divine in manifestation." },
"Mother's Manifestation": { "quote": "She manifests wherever consciousness evolves towards light." },
"Mother's Practices": { "quote": "Surrender, aspiration, and receptivity are the ways to approach her." },
"Mother's Domains": { "quote": "All domains of existence are her fields of action." }
}
