{
"Games as Art": { "quote": "Computer games constitute a new and as yet poorly developed art form that holds great promise for both designers and players." },
"Games as Play": { "quote": "A game is a form of art in which participants, termed players, make decisions in order to manage resources through game tokens in the pursuit of a goal." },
"Games as Conflict": { "quote": "A game is a closed formal system that subjectively represents a subset of reality. A game has conflict - players directly interact and can hamper each other's efforts." },
"Fundamental Elements": { "quote": "Four common factors are present in all games: representation, interaction, conflict, and safety." },
"Representation": { "quote": "The game represents subjectively a subset of reality. The player is therefore presented with a simpler and more clearly defined situation than reality offers." },
"Interaction": { "quote": "Games provide a representation of reality, but an interactive one - unlike books, movies, or other forms of narrative." },
"Safety": { "quote": "Games provide a psychological safety net - the consequences of conflict are always less severe than the situations they model." },
"Challenge": { "quote": "Challenge is the primary factor in the enjoyment of a game. Without challenge, without risk of defeat, games are meaningless." },
"Fantasy": { "quote": "Fantasy is one of the key psychological motivations for game play. Fantasy fulfills needs that cannot be met in the real world." },
"Exploration": { "quote": "The joy of discovering something new, of seeing unexplored territory for the first time, is a universal experience that games can provide." },
"Mental Stimulation": { "quote": "Games, either explicitly or implicitly, embody puzzles. Problem-solving is one of the great motivations for game play." },
"Games as Social Lubricant": { "quote": "Games can be social experiences, providing frameworks for interaction between people. Some games foster cooperative behavior, while others feed competitive urges." },
"Exercise": { "quote": "Many games promote physical development. Even digital games can require physical dexterity and coordination." },
"Need for Acknowledgment": { "quote": "Games provide an opportunity to achieve something, to be better at something than others, and to be recognized for those achievements." },
"Computer as Game Technology": { "quote": "The computer is the most flexible and powerful game technology developed. It can take on a staggering variety of game designs." },
"I/O Structures": { "quote": "Input/output structures are the technological constraints that shape what is possible in computer games. They define how the player communicates with the computer and vice versa." },
"Relationships": { "quote": "A game creates a subjective and deliberately simplified representation of emotional reality. As such, relationships between objects in games are simpler than their real counterparts." },
"Indirection": { "quote": "Game designers create games, but players interact with the rules, not with the designer. This indirection creates a barrier to artistic expression." },
"Design Sequence": { "quote": "First, choose a goal and a topic. Second, research and prepare. Third, design the core. Fourth, complete the design. Fifth, test and revise." },
"Goal Setting": { "quote": "The first and most important decision any designer makes is the goal of the game. What kind of experience is this game trying to create?" },
"Research & Preparation": { "quote": "A game without a solid foundation in research will likely be shallow. The amount of research should be appropriate to the goal of the game." },
"Designing the Core": { "quote": "The core of a game design is the set of fundamental rules that define what the game is. From this core, all other game features should develop." },
"Design Elaboration": { "quote": "Once the core is established, the game design must be completed by adding the remaining necessary details." },
"Development Cycle": { "quote": "Like any creative process, game design is iterative. It's rare that a designer gets it right the first time." },
"The Game Design Process": { "quote": "Game design is less a process of building than one of refinement. The designer must strip away extraneous material to reveal the game within." },
"Player's Perspective": { "quote": "Never underestimate the importance of putting yourself in the player's shoes. The designer must see the game through the player's eyes." },
"Balancing": { "quote": "A game is balanced when the choices presented to the player are meaningful - when each option is viable but not clearly superior to others." },
"Playtesting": { "quote": "Playtesting is perhaps the most critical part of game development. Watching people play your game will reveal problems you never anticipated." },
"Educational Games": { "quote": "Educational games are difficult to design because they must serve two masters: education and entertainment. Neither can be sacrificed for the other." },
"Future of Computer Games": { "quote": "As computers advance, so too will games. The future will bring games of greater technical sophistication, greater subtlety, and greater potential for artistic expression." }
}
