{
    "Eternal Nature": { "quote": "That which never was born and never dies. (Katha Upanishad 1.2.18)" },
    "Timeless Essence": { "quote": "Before Abraham was, I am. (John 8:58)" },
    "Infinite Duration": { "quote": "A thousand years in your sight are like a day that has just gone by. (Psalm 90:4)" },
    "Perpetual Existence": { "quote": "Neither death nor life... neither the present nor the future... will be able to separate us. (Romans 8:38-39)" },
    "Eternal Present": { "quote": "Time is the moving image of eternity. (Plato, Timaeus)" },
    "Timeless Truth": { "quote": "The eternal truth remains unchanging through all changes. (Bhagavad Gita 2:16)" },
    "Eternal Return": { "quote": "That which has been is what will be, that which is done is what will be done. (Ecclesiastes 1:9)" },
    "Everlasting Life": { "quote": "Whoever believes in him shall have eternal life. (John 3:15)" },
    "Eternal Law": { "quote": "The Dharma is timeless, leading onward. (Dhammapada 1)" },
    "Endless Cycle": { "quote": "The wheel of time turns without beginning or end. (Vishnu Purana)" },
    "Eternal Mind": { "quote": "The eternal intelligence pervades all existence. (Yoga Sutras 4.18)" },
    "Timeless Wisdom": { "quote": "Wisdom is eternal, preceding all creation. (Proverbs 8:22-23)" },
    "Eternal Light": { "quote": "The light shines in the darkness, and the darkness has not overcome it. (John 1:5)" },
    "Perpetual Motion": { "quote": "The Tao is constant in non-action, yet everything gets done. (Tao Te Ching 37)" },
    "Eternal Love": { "quote": "Love never fails. (1 Corinthians 13:8)" },
    "Timeless Beauty": { "quote": "Beauty is eternal, only its expressions change. (Rabindranath Tagore)" },
    "Eternal Peace": { "quote": "Peace eternal lies in the eternal silence. (Sri Aurobindo)" },
    "Endless Space": { "quote": "Space is eternal and infinite, containing all possibilities. (Upanishads)" },
    "Eternal Spirit": { "quote": "The Spirit is eternal, unchanging, and all-pervading. (Bhagavad Gita 2:24)" },
    "Timeless Now": { "quote": "The eternal now contains all times. (Meister Eckhart)" },
    "Eternal Unity": { "quote": "All multiplicity must be resolved into eternal unity. (Plotinus, Enneads)" },
    "Perpetual Renewal": { "quote": "Behold, I make all things new. (Revelation 21:5)" },
    "Eternal Memory": { "quote": "What has been will be remembered eternally. (Ecclesiastes 1:11)" },
    "Timeless Design": { "quote": "The eternal patterns underlie all manifest forms. (Plato, Republic)" },
    "Eternal Order": { "quote": "The cosmic order is eternally maintained. (Rig Veda 10.190)" },
    "Endless Potential": { "quote": "In the eternal is infinite possibility. (Upanishads)" },
    "Eternal Presence": { "quote": "The eternal presence dwells in the heart of all beings. (Bhagavad Gita 18:61)" },
    "Timeless Purpose": { "quote": "The eternal purpose which he accomplished in Christ. (Ephesians 3:11)" },
    "Eternal Way": { "quote": "The way that can be named is not the eternal way. (Tao Te Ching 1)" },
    "Endless Journey": { "quote": "The path to the eternal is itself eternal. (Buddhist teaching)" }
}
