{
"Names of Theos": { "quote": "Zeus, Apollo, Athena - many names for divine manifestations. (Plato, Cratylus 396a)" },
"Divine Essence": { "quote": "The divine is that which moves without being moved. (Aristotle, Metaphysics XII)" },
"Cosmic Mind": { "quote": "Nous (Divine Mind) orders all things. (Anaxagoras, Fragment 12)" },
"Divine Wisdom": { "quote": "The divine is the highest wisdom, which steers all things. (Heraclitus, Fragment 41)" },
"Ultimate Reality": { "quote": "The One is prior to all things and is the cause of all being. (Plotinus, Enneads V.2.1)" },
"Divine Logos": { "quote": "The Logos pervades all things and governs all. (Heraclitus, Fragment 1)" },
"Divine Providence": { "quote": "Providence is the divine reason itself. (Stoic doctrine, Chrysippus)" },
"Divine Forms": { "quote": "The Forms are divine patterns in nature. (Plato, Timaeus 28a-29a)" },
"Divine Unity": { "quote": "All things are one. (Parmenides, On Nature)" },
"Divine Law": { "quote": "The divine law nourishes all human laws. (Heraclitus, Fragment 114)" },
"Divine Nature": { "quote": "Nature loves to hide. (Heraclitus, Fragment 123)" },
"Divine Creation": { "quote": "The Demiurge fashioned the cosmos according to the eternal Forms. (Plato, Timaeus 29a)" },
"Divine Harmony": { "quote": "The cosmos is ordered by number and harmony. (Pythagoras)" },
"Divine Beauty": { "quote": "Beauty is the splendor of the divine. (Plotinus, Enneads I.6)" },
"Divine Truth": { "quote": "Truth is the beginning of all good things. (Plato, Laws 730c)" },
"Divine Justice": { "quote": "Justice is the divine order of the soul. (Plato, Republic 443d-e)" },
"Divine Power": { "quote": "The divine power moves the heavens. (Aristotle, On the Heavens)" },
"Divine Intelligence": { "quote": "The divine mind thinks itself. (Aristotle, Metaphysics XII.9)" },
"Divine Presence": { "quote": "The divine is present in all things. (Thales)" },
"Divine Eternal": { "quote": "That which always is has no becoming. (Plato, Timaeus 27d-28a)" },
"Divine Good": { "quote": "The Good is beyond being in dignity and power. (Plato, Republic 509b)" },
"Divine Order": { "quote": "The cosmos is governed by divine reason. (Stoic doctrine)" },
"Divine Soul": { "quote": "The soul is divine and immortal. (Plato, Phaedo 80a-b)" },
"Divine Light": { "quote": "Light is the visible image of the divine. (Plotinus, Enneads IV.3.17)" },
"Divine Knowledge": { "quote": "Knowledge of the divine is the highest wisdom. (Aristotle, Metaphysics I.2)" },
"Divine Love": { "quote": "Divine love moves the sun and other stars. (Aristotle, Metaphysics XII)" },
"Divine Virtue": { "quote": "Virtue is divine and blessed. (Plato, Republic 352d)" },
"Divine Mystery": { "quote": "The mysteries reveal the divine nature. (Eleusinian Mysteries)" },
"Divine Wisdom": { "quote": "Sophia (Wisdom) is the divine understanding. (Pythagoras)" },
"Divine Perfection": { "quote": "The divine is complete perfection. (Aristotle, Metaphysics XII.7)" }
}
