{
"Divine Origin": { "quote": "When the skies above were not yet named, nor earth below pronounced by name, Apsu, the first one, their begetter, and maker Tiamat, who bore them all. (Enuma Elish, Tablet I)" },
"Primordial Nature": { "quote": "Mother Hubur, who fashions all things. (Enuma Elish, Tablet I)" },
"Divine Waters": { "quote": "Their waters commingled as a single body. (Enuma Elish, Tablet I)" },
"Creative Power": { "quote": "She who created everything, Mother Tiamat who gives life to all the gods. (Babylonian Creation Myth)" },
"Divine Form": { "quote": "A dragon with scales, mighty horns, and a tail that fills the heavens. (Enuma Elish, Tablet IV)" },
"Divine Army": { "quote": "She spawned monster-serpents, sharp of tooth and merciless of fang. (Enuma Elish, Tablet I)" },
"Divine Weapons": { "quote": "With poison, not blood, she filled their bodies. (Enuma Elish, Tablet I)" },
"Divine Chaos": { "quote": "She bore the storms, the raging winds, filled with venom like blood. (Enuma Elish, Tablet I)" },
"Divine Authority": { "quote": "She set up Kingu, made him chief among them, leader of the host. (Enuma Elish, Tablet I)" },
"Divine Vengeance": { "quote": "Day and night she plots evil to avenge Apsu. (Enuma Elish, Tablet II)" },
"Divine Children": { "quote": "Mother of the gods, whose strength is unequaled. (Enuma Elish, Tablet II)" },
"Divine Battle": { "quote": "Tiamat and Marduk, wisest of gods, joined for combat, met in battle. (Enuma Elish, Tablet IV)" },
"Divine Elements": { "quote": "From her two eyes her tears flowed down. (Enuma Elish, Tablet I)" },
"Divine Legacy": { "quote": "From her body, he created the world. (Enuma Elish, Tablet V)" },
"Divine Power": { "quote": "She has gathered her forces, terrifyingly she rises up. (Enuma Elish, Tablet II)" },
"Divine Realm": { "quote": "In the deep, she rules over the primordial waters. (Babylonian Cosmology)" },
"Divine Monsters": { "quote": "Fierce dragons she has clothed with terror. (Enuma Elish, Tablet I)" },
"Divine Wisdom": { "quote": "She who knows the ancient ways, keeper of primordial knowledge. (Mesopotamian Tradition)" },
"Divine Creation": { "quote": "From whose flesh and blood, Marduk created the cosmos. (Enuma Elish, Tablet V)" },
"Divine Sovereignty": { "quote": "She who ruled over the waters before time began. (Babylonian Myth)" },
"Divine Nature": { "quote": "Salt water Tiamat, who gave birth to them all. (Enuma Elish, Tablet I)" },
"Divine Transformation": { "quote": "From her body came the heavens and the earth. (Enuma Elish, Tablet V)" },
"Divine Opposition": { "quote": "Against her children she has taken a hostile stance. (Enuma Elish, Tablet II)" },
"Divine Primacy": { "quote": "The great mother who existed before the gods. (Babylonian Text)" },
"Divine Attributes": { "quote": "Endowed with the tablet of destinies, granted supreme power. (Enuma Elish, Tablet I)" },
"Divine Forces": { "quote": "She created the eleven kinds of monsters to wage war. (Enuma Elish, Tablet I)" },
"Divine Dominion": { "quote": "Ruler of the primordial sea, mother of the first gods. (Mesopotamian Creation Account)" },
"Divine Destiny": { "quote": "From her defeat came the order of the universe. (Enuma Elish, Tablet V)" },
"Divine Mystery": { "quote": "In the beginning, when all was darkness and water. (Babylonian Cosmogony)" },
"Divine Sacrifice": { "quote": "Through her death, the world was born. (Enuma Elish, Tablet V)" }
}
