{
"Nature of Heaven": { "quote": "Heaven's movement is vigorous. In accordance with this, the superior person never ceases to strengthen himself. (I Ching, Hexagram 1)" },
"Mandate of Heaven": { "quote": "Heaven sees as our people see; Heaven hears as our people hear. (Book of Documents, 尚书)" },
"Heaven's Way": { "quote": "The way of Heaven and Earth is persistent and unchanging. (Doctrine of the Mean, 中庸)" },
"Divine Order": { "quote": "Heaven does not speak, yet the four seasons proceed in order and all things flourish. (Analects 17:19)" },
"Heavenly Virtue": { "quote": "What Heaven has conferred is called The Nature; accordance with this nature is called The Path. (Doctrine of the Mean)" },
"Celestial Pattern": { "quote": "Heaven's net is vast; sparse but nothing escapes it. (Dao De Jing 73)" },
"Heaven's Will": { "quote": "Death and life have their determined appointments; riches and honors depend upon Heaven. (Analects 12:5)" },
"Divine Harmony": { "quote": "When Heaven and Earth are in harmony, all things flourish. (Book of Changes, 易经)" },
"Heaven's Principle": { "quote": "The principle of Heaven is eternal and unchanging. (Zhu Xi, 朱熹)" },
"Celestial Power": { "quote": "Of the powers of Heaven and Earth, humanity forms the heart. (Zhang Zai, 张载)" },
"Heaven's Authority": { "quote": "Only Heaven is great; only Yao could model himself upon it. (Mencius 2A:3)" },
"Divine Guidance": { "quote": "Heaven produces the virtuous nature of humanity. (Xunzi, 荀子)" },
"Heavenly Nature": { "quote": "Human nature is good, just as water flows downward. (Mencius 6A:2)" },
"Celestial Virtue": { "quote": "The superior person waits for the appointments of Heaven. (Analects 14:38)" },
"Heaven's Justice": { "quote": "Heaven does not create people for the sake of rank; rank exists for the sake of duty. (Xunzi)" },
"Divine Destiny": { "quote": "He who does not know the will of Heaven cannot be considered a superior person. (Analects 20:3)" },
"Heavenly Pattern": { "quote": "Heaven's way is to show no favoritism. (Xunzi)" },
"Celestial Order": { "quote": "When Heaven is about to confer a great responsibility on any man, it first exercises his mind with suffering. (Mencius 6B:15)" },
"Heaven's Mission": { "quote": "Heaven gives birth to the people and provides them with rulers. (Book of Documents)" },
"Divine Morality": { "quote": "What Heaven establishes is called destiny; following destiny is called the Way. (Doctrine of the Mean)" },
"Heavenly Wisdom": { "quote": "To know the will of Heaven, one must first understand human nature. (Mencius)" },
"Celestial Balance": { "quote": "Heaven and Earth set the pattern, and all things follow their own way. (I Ching)" },
"Heaven's Direction": { "quote": "The wise find pleasure in water; the virtuous find pleasure in hills. (Analects 6:23)" },
"Divine Connection": { "quote": "Between Heaven and Earth, humans form the third power. (Book of Changes)" },
"Heaven's Blessing": { "quote": "Heaven blesses the diligent. (Book of Documents)" },
"Celestial Law": { "quote": "The laws of Heaven operate without error. (Zhou Yi, 周易)" },
"Heaven's Purpose": { "quote": "Heaven creates all people and gives them their various capacities. (Xunzi)" },
"Divine Enlightenment": { "quote": "When Heaven is about to bestow a great office on someone, it first fills their heart with suffering. (Mencius)" },
"Heavenly Truth": { "quote": "The way of Heaven is to benefit others and not to injure. (I Ching)" },
"Celestial Harmony": { "quote": "When Heaven and Earth are in their proper positions, the four seasons follow their proper course. (Book of Changes)" }
}
