{
"Tibetan Buddhism": {
"short_description": "A profound tradition of Buddhist practice and realization combining Indian Mahayana Buddhism with indigenous Tibetan elements, characterized by tantric practices, elaborate philosophical systems, and direct transmission lineages."
},
"Vajrayana": {
"short_description": "The diamond or thunderbolt vehicle of direct transformation, utilizing advanced tantric methods to achieve enlightenment in a single lifetime through the unity of wisdom and skilled means."
},
"Dzogchen": {
"short_description": "The Great Perfection teaching revealing the natural state of mind as primordially pure awareness, complete with all qualities of enlightenment when recognized and stabilized through direct introduction."
},
"Mahamudra": {
"short_description": "The Great Seal system of meditation focusing on direct recognition of mind's true nature through progressive stages of practice combining shamatha and vipashyana with tantric methods."
},
"Lamrim": {
"short_description": "The graduated path to enlightenment systematizing all Buddhist teachings into progressive stages of practice suitable for practitioners of different capacities and orientations."
},
"Mandala": {
"short_description": "Sacred architecture of enlightened mind displayed as intricate arrangements of deities and pure lands, used as supports for visualization practice and understanding enlightened reality."
},
"Yidam": {
"short_description": "Meditation deity embodying specific aspects of enlightenment, serving as focus for practice and catalyst for transformation through identification with enlightened qualities."
},
"Dakini": {
"short_description": "Female embodiments of enlightened wisdom activity, serving as guardians of profound teachings and catalysts for spiritual realization through direct transmission of wisdom."
},
"Terma": {
"short_description": "Hidden treasures of teaching concealed by great masters for future discovery, including physical objects, pure vision revelations, and direct mind transmission of essential instructions."
},
"Tulku": {
"short_description": "Recognized reincarnations of accomplished masters who intentionally take rebirth to continue their enlightened activity of benefiting beings through teaching and practice."
},
"Ngondro": {
"short_description": "Preliminary practices establishing the foundation for advanced tantric methods through purification, accumulation of merit, and cultivation of devotion and realization."
},
"Phowa": {
"short_description": "Practice of conscious transference of consciousness at the time of death, ensuring favorable rebirth or liberation through direct projection into pure realms."
},
"Tonglen": {
"short_description": "Practice of sending and taking, developing bodhicitta through visualization of taking others' suffering and giving them happiness, transforming adverse circumstances into path."
},
"Bardo": {
"short_description": "Intermediate states between death and rebirth, including opportunities for liberation through recognition of mind's true nature and application of essential instructions."
},
"Rinpoche": {
"short_description": "Precious teachers embodying lineage blessings and essential instructions, serving as living links to enlightened realization through direct transmission of wisdom mind."
},
"Samaya": {
"short_description": "Sacred commitments maintaining pure connection with teachers, teachings, and practice community, ensuring successful progression on path through proper relationship with wisdom."
},
"Torma": {
"short_description": "Ritual offerings shaped from blessed substances, representing various aspects of offering and transformation in tantric practice and ceremony."
},
"Tsok": {
"short_description": "Feast gathering for accumulation of merit and wisdom through shared practice, offering, and consumption of blessed substances in tantric context."
},
"Lung": {
"short_description": "Oral transmission of texts and practices authorizing practitioners to engage with specific teachings through direct connection with lineage blessing."
},
"Wang": {
"short_description": "Empowerment ceremonies transmitting authority and blessing to practice specific tantric methods through direct introduction to enlightened mind essence."
},
"Rigpa": {
"short_description": "Pure awareness as the fundamental nature of mind, recognized and stabilized through direct introduction and progressive stages of practice in Dzogchen tradition."
},
"Lojong": {
"short_description": "Mind training practices transforming adverse circumstances into path through application of specific contemplations and point-by-point instructions."
},
"Chod": {
"short_description": "Practice of cutting through ego-clinging through offering of body visualized as universe of enlightened offering, often performed in frightening places."
},
"Drubthab": {
"short_description": "Systematic methods of deity practice including visualization, mantra recitation, and essential instructions for transformation through identification with enlightened qualities."
},
"Protector": {
"short_description": "Enlightened beings or oathbound spirits guarding dharma teachings and practitioners, removing obstacles and creating favorable conditions for practice through various activities."
}
}
