{
"Usability": { "quote": "The ease of use and learnability of a product. Good usability minimizes friction between user intent and task completion." },
"Accessibility": { "quote": "Design that enables people with disabilities to perceive, understand, navigate, and interact with products. WCAG guidelines provide standards for creating accessible digital experiences." },
"Information Architecture": { "quote": "The organization and structure of content to help users find information and complete tasks. Card sorting helps identify intuitive groupings of information." },
"User Research": { "quote": "Systematic investigation of users and their requirements to add context and insight into the design process. Contextual inquiry observes users in their natural environment." },
"Interaction Design": { "quote": "Designing interactive digital products, environments, systems, and services. Microinteractions like pull-to-refresh create moments that delight users." },
"Visual Design": { "quote": "The aesthetic appearance of the interface, including color, typography, spacing, and imagery. Apple's design language prioritizes clarity, deference, and depth." },
"User Journey Mapping": { "quote": "Visualization of the process a user goes through to accomplish a goal. Customer journey maps identify pain points and opportunities across touchpoints." },
"Wireframing": { "quote": "Creating skeletal outlines of a product to establish structure and flow. Low-fidelity wireframes focus on layout and functionality rather than visual design." },
"Prototyping": { "quote": "Building representations of a design to test concepts and gather feedback. Interactive prototypes in Figma allow users to experience the flow before development." },
"Usability Testing": { "quote": "Evaluating a product by testing it with representative users. Think-aloud protocol reveals users' thought processes during interaction." },
"Heuristic Evaluation": { "quote": "Examining an interface against established usability principles. Nielsen's 10 heuristics provide a framework for identifying common usability issues." },
"Cognitive Load": { "quote": "The mental effort required to use a product. Progressive disclosure reveals information only when needed to reduce cognitive burden." },
"Affordances": { "quote": "Qualities of an object that indicate how it can be used. Buttons with shadows suggest they can be pressed through visual affordance." },
"Feedback": { "quote": "Responses to user actions that communicate results. Loading indicators assure users that a process is underway rather than broken." },
"Mental Models": { "quote": "How users perceive and understand a system based on previous experience. File folder icons leverage existing understanding of physical organization systems." },
"Personas": { "quote": "Fictional characters created to represent different user types. Data-driven personas prevent designing for edge cases or stereotypes." },
"Design Systems": { "quote": "Collection of reusable components guided by standards. Google's Material Design provides consistent experiences across platforms." },
"User-Centered Design": { "quote": "An iterative design approach focusing on users and their needs. Early and continuous focus on users improves product relevance and adoption." },
"A/B Testing": { "quote": "Comparing two versions of a design to determine which performs better. Small incremental changes measured against conversion metrics guide design evolution." },
"Emotional Design": { "quote": "Creating experiences that evoke appropriate emotions. Don Norman's visceral, behavioral, and reflective levels address different aspects of emotional connection." },
"Microcopy": { "quote": "Small pieces of text that guide users through an interface. Error messages that suggest solutions rather than just reporting problems reduce user frustration." },
"Content Strategy": { "quote": "Planning, creation, delivery, and management of content. Content audits identify gaps and redundancies in existing information." },
"Gestalt Principles": { "quote": "How humans perceive and organize visual elements. Proximity, similarity, and continuity guide users in understanding related information." },
"Dark Patterns": { "quote": "Interface designs that trick users into unintended actions. Forced continuity automatically charges users after free trials without clear consent." },
"Responsive Design": { "quote": "Creating interfaces that adapt to different screen sizes and devices. Fluid grids, flexible images, and media queries enable consistent experiences across platforms." },
"Onboarding": { "quote": "The process of familiarizing users with a new product. Progressive onboarding introduces features as users need them rather than all at once." },
"Design Thinking": { "quote": "A problem-solving approach that includes empathy, definition, ideation, prototyping, and testing. This human-centered approach encourages innovative solutions to complex problems." },
"First-time User Experience": { "quote": "The initial interaction between a user and a product. Reducing friction during initial setup increases the likelihood of continued engagement." },
"Gamification": { "quote": "Applying game mechanics to non-game contexts. Progress indicators and achievement systems can increase user motivation and engagement." },
"Voice User Interface": { "quote": "Interaction with systems through spoken commands. Conversational design principles guide natural language experiences that feel human and helpful." }
}
