{
"Vector Embeddings": { "quote": "Numerical representations of data in high-dimensional space where semantic similarity corresponds to vector proximity." },
"Similarity Search": { "quote": "Finding vectors that are close to a query vector based on distance metrics like cosine similarity or Euclidean distance." },
"Approximate Nearest Neighbor": { "quote": "Algorithms that trade perfect accuracy for speed when searching large vector spaces (e.g., HNSW, IVF, PQ)." },
"Indexing Structures": { "quote": "Data structures that organize vectors to enable efficient retrieval (e.g., trees, graphs, quantization-based structures)." },
"HNSW (Hierarchical Navigable Small World)": { "quote": "Graph-based indexing algorithm creating connections between similar vectors at multiple layers for efficient navigation." },
"IVF (Inverted File Index)": { "quote": "Partitioning technique that divides vector space into clusters to narrow search space." },
"Product Quantization": { "quote": "Compression technique that reduces vector dimensionality by splitting vectors into subvectors and quantizing each separately." },
"Dimensionality": { "quote": "The number of values in each vector, typically ranging from dozens to thousands depending on the embedding model." },
"Curse of Dimensionality": { "quote": "Phenomenon where vector search becomes increasingly difficult as dimensionality increases due to sparsity." },
"Distance Metrics": { "quote": "Mathematical formulas measuring similarity between vectors (cosine, Euclidean, dot product, Manhattan)." },
"Cosine Similarity": { "quote": "Measure of similarity between vectors based on the cosine of the angle between them, normalized for vector magnitude." },
"Vector Normalization": { "quote": "Process of scaling vectors to unit length to facilitate comparison using simpler distance calculations." },
"Hybrid Search": { "quote": "Combining vector similarity with traditional keyword or metadata filtering for more precise results." },
"Semantic Search": { "quote": "Using vector embeddings to find results based on meaning rather than exact keyword matches." },
"Embedding Models": { "quote": "Machine learning models (often neural networks) that convert raw data into vector representations." },
"Recall Rate": { "quote": "Percentage of true nearest neighbors successfully retrieved by approximate search algorithms." },
"FAISS (Facebook AI Similarity Search)": { "quote": "Open-source library for efficient similarity search and clustering of dense vectors." },
"Sparse Vectors": { "quote": "Vectors where most elements are zero, often used in traditional information retrieval." },
"Dense Vectors": { "quote": "Vectors where most elements have non-zero values, typical in neural network embeddings." },
"Vector Quantization": { "quote": "Technique that maps vectors to a discrete set of representative vectors to reduce storage requirements." },
"Scalar Quantization": { "quote": "Reducing precision of vector components (e.g., from 32-bit float to 8-bit integer) to save space." },
"Clustering": { "quote": "Grouping similar vectors to improve search efficiency or discover patterns in the data." },
"Reranking": { "quote": "Post-processing step that applies more precise similarity measures to initial search results." },
"Multi-tenancy": { "quote": "Supporting multiple isolated users or applications within the same vector database instance." },
"Sharding": { "quote": "Distributing vector data across multiple machines to handle large datasets and high query loads." },
"CRUD Operations": { "quote": "Create, read, update, and delete functionality for managing vector data." },
"Metadata Filtering": { "quote": "Constraining vector searches based on associated structured data attributes." },
"Incremental Updates": { "quote": "Ability to modify vector indices without complete rebuilding as data changes." },
"Vector Database Persistence": { "quote": "Storage mechanisms ensuring vector data and indices survive system restarts." },
"Real-time Indexing": { "quote": "Capability to make newly added vectors immediately available for search queries." }
}
