{
"Divine Name": { "quote": "I am who I am. (Exodus 3:14)" },
"Divine Unity": { "quote": "Hear, O Israel: The LORD our God, the LORD is one. (Deuteronomy 6:4)" },
"Divine Eternity": { "quote": "Before the mountains were born or you brought forth the whole world, from everlasting to everlasting you are God. (Psalm 90:2)" },
"Divine Creation": { "quote": "In the beginning God created the heavens and the earth. (Genesis 1:1)" },
"Divine Presence": { "quote": "Where can I go from your Spirit? Where can I flee from your presence? (Psalm 139:7)" },
"Divine Covenant": { "quote": "I will establish my covenant as an everlasting covenant between me and you and your descendants after you. (Genesis 17:7)" },
"Divine Justice": { "quote": "He is the Rock, his works are perfect, and all his ways are just. (Deuteronomy 32:4)" },
"Divine Mercy": { "quote": "The LORD, the LORD, the compassionate and gracious God, slow to anger, abounding in love and faithfulness. (Exodus 34:6)" },
"Divine Holiness": { "quote": "Holy, holy, holy is the LORD Almighty; the whole earth is full of his glory. (Isaiah 6:3)" },
"Divine Wisdom": { "quote": "The LORD by wisdom founded the earth; by understanding he established the heavens. (Proverbs 3:19)" },
"Divine Power": { "quote": "Ah, Sovereign LORD, you have made the heavens and the earth by your great power and outstretched arm. Nothing is too hard for you. (Jeremiah 32:17)" },
"Divine Protection": { "quote": "The LORD is my rock, my fortress and my deliverer. (Psalm 18:2)" },
"Divine Leadership": { "quote": "The LORD is my shepherd, I lack nothing. (Psalm 23:1)" },
"Divine Truth": { "quote": "Your word is truth. (John 17:17)" },
"Divine Law": { "quote": "The law of the LORD is perfect, refreshing the soul. (Psalm 19:7)" },
"Divine Judgment": { "quote": "For the LORD is our judge, the LORD is our lawgiver, the LORD is our king. (Isaiah 33:22)" },
"Divine Providence": { "quote": "I know the plans I have for you, declares the LORD, plans to prosper you and not to harm you. (Jeremiah 29:11)" },
"Divine Knowledge": { "quote": "O LORD, you have searched me and you know me. (Psalm 139:1)" },
"Divine Victory": { "quote": "The LORD will fight for you; you need only to be still. (Exodus 14:14)" },
"Divine Sovereignty": { "quote": "The earth is the LORD's, and everything in it, the world, and all who live in it. (Psalm 24:1)" },
"Divine Redemption": { "quote": "I have redeemed you; I have summoned you by name; you are mine. (Isaiah 43:1)" },
"Divine Glory": { "quote": "The heavens declare the glory of God; the skies proclaim the work of his hands. (Psalm 19:1)" },
"Divine Promise": { "quote": "Not one of all the LORD's good promises to Israel failed; every one was fulfilled. (Joshua 21:45)" },
"Divine Voice": { "quote": "The voice of the LORD is powerful; the voice of the LORD is majestic. (Psalm 29:4)" },
"Divine Peace": { "quote": "The LORD bless you and keep you; the LORD make his face shine on you and be gracious to you. (Numbers 6:24-25)" },
"Divine Healing": { "quote": "I am the LORD, who heals you. (Exodus 15:26)" },
"Divine Guidance": { "quote": "Your word is a lamp for my feet, a light on my path. (Psalm 119:105)" },
"Divine Kingship": { "quote": "The LORD reigns forever and ever. (Exodus 15:18)" },
"Divine Faithfulness": { "quote": "Your faithfulness continues through all generations. (Psalm 119:90)" },
"Divine Dwelling": { "quote": "Let them construct a sanctuary for Me, that I may dwell among them. (Exodus 25:8)" }
}
